var u = require('../utils');
var desc = {gend: 'fem', var: 'i'};

var tests = {
    'gati': { // path F
        'sg': ['गतिः', 'गते', 'गतिम्', 'गत्या', 'गतये', 'गतेः', 'गतेः', 'गतौ'], // -गतितः
        'du': ['गती', 'गती', 'गती', 'गतिभ्याम्', 'गतिभ्याम्', 'गतिभ्याम्', 'गत्योः', 'गत्योः'],
        'pl': ['गतयः', 'गतयः', 'गतीः', 'गतिभिः', 'गतिभ्यः', 'गतिभ्यः', 'गतीनाम्', 'गतिषु'],
    },

    'kIrti': { // glory, fame
        'sg': ['कीर्तिः', 'कीर्ते', 'कीर्तिम्', 'कीर्त्या', 'कीर्तये-कीर्त्यै', 'कीर्तेः-कीर्त्याः', 'कीर्तेः-कीर्त्याः', 'कीर्तौ-कीर्त्याम्'],
        'du': ['कीर्ती', 'कीर्ती', 'कीर्ती', 'कीर्तिभ्याम्', 'कीर्तिभ्याम्', 'कीर्तिभ्याम्', 'कीर्त्योः', 'कीर्त्योः'],
        'pl': ['कीर्तयः', 'कीर्तयः', 'कीर्तीः', 'कीर्तिभिः', 'कीर्तिभ्यः', 'कीर्तिभ्यः', 'कीर्तीनाम्', 'कीर्तिषु'],
    },
    // 'mani': { // mind
    //     'sg': ['', '', '', '', '', '', '', ''],
    //     'du': ['', '', '', '', '', '', '', ''],
    //     'pl': ['', '', '', '', '', '', '', ''],
    // },
    'Bakti': { // devotion
        'sg': ['भक्तिः', 'भक्ते', 'भक्तिम्', 'भक्त्या', 'भक्त्यै-भक्तये', 'भक्त्याः-भक्तेः', 'भक्त्याः-भक्तेः', 'भक्त्याम्-भक्तौ'],
        'du': ['भक्ती', 'भक्ती', 'भक्ती', 'भक्तिभ्याम्', 'भक्तिभ्याम्', 'भक्तिभ्याम्', 'भक्त्योः', 'भक्त्योः'],
        'pl': ['भक्तयः', 'भक्तयः', 'भक्तीः', 'भक्तिभिः', 'भक्तिभ्यः', 'भक्तिभ्यः', 'भक्तीनाम्', 'भक्तिषु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
