var u = require('../utils');
var desc = {gend: 'masc', var: 'i'};

// total 72

var tests = {
    'agni': { // fire
        'sg': ['अग्निः', 'अग्ने', 'अग्निम्', 'अग्निना', 'अग्नये', 'अग्नेः', 'अग्नेः', 'अग्नौ'], // abl. -अग्नितः ?
        'du': ['अग्नी', 'अग्नी', 'अग्नी', 'अग्निभ्याम्', 'अग्निभ्याम्', 'अग्निभ्याम्', 'अग्न्योः', 'अग्न्योः'],
        'pl': ['अग्नयः', 'अग्नयः', 'अग्नीन्', 'अग्निभिः', 'अग्निभ्यः', 'अग्निभ्यः', 'अग्नीनाम्', 'अग्निषु'],
    },
    'muni': { // sage
        'sg': ['मुनिः', 'मुने', 'मुनिम्', 'मुनिना', 'मुनये', 'मुनेः', 'मुनेः', 'मुनौ'], // -मुनितः
        'du': ['मुनी', 'मुनी', 'मुनी', 'मुनिभ्याम्', 'मुनिभ्याम्', 'मुनिभ्याम्', 'मुन्योः', 'मुन्योः'],
        'pl': ['मुनयः', 'मुनयः', 'मुनीन्', 'मुनिभिः', 'मुनिभ्यः', 'मुनिभ्यः', 'मुनीनाम्', 'मुनिषु'],
    },
    'Suci': { // virtue
        'sg': ['शुचिः', 'शुचे', 'शुचिम्', 'शुचिना', 'शुचये', 'शुचेः', 'शुचेः', 'शुचौ'],
        'du': ['शुची', 'शुची', 'शुची', 'शुचिभ्याम्', 'शुचिभ्याम्', 'शुचिभ्याम्', 'शुच्योः', 'शुच्योः'],
        'pl': ['शुचयः', 'शुचयः', 'शुचीन्', 'शुचिभिः', 'शुचिभ्यः', 'शुचिभ्यः', 'शुचीनाम्', 'शुचिषु'],
    },
    // file: masc_in ?
    'yogin': { //
        'sg': ['योगी', 'योगिन्', 'योगिनम्', 'योगिना', 'योगिने', 'योगिनः', 'योगिनः', 'योगिनि'],
        'du': ['योगिनौ', 'योगिनौ', 'योगिनौ', 'योगिभ्याम्', 'योगिभ्याम्', 'योगिभ्याम्', 'योगिनोः', 'योगिनोः'],
        'pl': ['योगिनः', 'योगिनः', 'योगिनः', 'योगिभिः', 'योगिभ्यः', 'योगिभ्यः', 'योगिनाम्', 'योगिषु'],
    },
    'hari': { //
        'sg': ['हरिः', 'हरे', 'हरिम्', 'हरिणा', 'हरये', 'हरेः', 'हरेः', 'हरौ'],
        'du': ['हरी', 'हरी', 'हरी', 'हरिभ्याम्', 'हरिभ्याम्', 'हरिभ्याम्', 'हर्योः', 'हर्योः'],
        'pl': ['हरयः', 'हरयः', 'हरीन्', 'हरिभिः', 'हरिभ्यः', 'हरिभ्यः', 'हरीणाम्', 'हरिषु'],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
