var u = require('../utils');
var desc = {gend: 'neut', var: 'a'};

var tests = {
    'Asya': { // mouth
        'sg': ['आस्यम्', 'आस्य', 'आस्यम्', 'आस्येन', 'आस्याय', 'आस्यात्', 'आस्यस्य', 'आस्ये'],
        'du': ['आस्ये', 'आस्ये', 'आस्ये', 'आस्याभ्याम्', 'आस्याभ्याम्', 'आस्याभ्याम्', 'आस्ययोः', 'आस्ययोः'],
        'pl': ['आस्यानि', 'आस्यानि', 'आस्यानि', 'आस्यैः', 'आस्येभ्यः', 'आस्येभ्यः', 'आस्यानाम्', 'आस्येषु'],
    },
    'vana': { // forest
        'sg': ['वनम्', 'वन', 'वनम्', 'वनेन', 'वनाय', 'वनात्', 'वनस्य', 'वने'],
        'du': ['वने', 'वने', 'वने', 'वनाभ्याम्', 'वनाभ्याम्', 'वनाभ्याम्', 'वनयोः', 'वनयोः'],
        'pl': ['वनानि', 'वनानि', 'वनानि', 'वनैः', 'वनेभ्यः', 'वनेभ्यः', 'वनानाम्', 'वनेषु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
