var u = require('../utils');
var desc = {gend: 'neut', var: 'an'};

var tests = {
    'nAman': { // name
        'sg': ['नाम', 'नामन्-नाम', 'नाम', 'नाम्ना', 'नाम्ने', 'नाम्नः', 'नाम्नः', 'नामनि-नाम्नि'],
        'du': ['नामनी-नाम्नी', 'नामनी-नाम्नी', 'नामनी-नाम्नी', 'नामभ्याम्', 'नामभ्याम्', 'नामभ्याम्', 'नाम्नोः', 'नाम्नोः'],
        'pl': ['नामानि', 'नामानि', 'नामानि', 'नामभिः', 'नामभ्यः', 'नामभ्यः', 'नाम्नाम्', 'नामसु'],
    },
    'karman': { //
        'sg': ['कर्म', 'कर्मन्-कर्म', 'कर्म', 'कर्मणा', 'कर्मणे', 'कर्मणः', 'कर्मणः', 'कर्मणि'],
        'du': ['कर्म्णी-कर्मणी', 'कर्म्णी-कर्मणी', 'कर्म्णी-कर्मणी', 'कर्मभ्याम्', 'कर्मभ्याम्', 'कर्मभ्याम्', 'कर्मणोः', 'कर्मणोः'],
        'pl': ['कर्माणि', 'कर्माणि', 'कर्माणि', 'कर्मभिः', 'कर्मभ्यः', 'कर्मभ्यः', 'कर्मणाम्', 'कर्मसु'],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

}


describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
