// наборы tins для /bin/jnu2stem

// перенести в utils
var c = {};
c.laN = 'लङ्';


//  ['तिप्', 'तस्', 'झि', 'सिप्', 'थस्', 'थ', 'मिप्', 'वस्', 'मस्', 'त', 'आताम्', 'झ', 'थास्', 'आथाम्', 'ध्वम्', 'इट्', 'वहि', 'महिङ्'];
//  {'लट्', 'लङ्', 'लिट्', 'लुङ्', 'लुट्', 'ऌट्', 'लोट्', 'विधिलिङ्', 'आशीर्लिङ्', 'ॡङ्'};
// GANA: 'भ्वादि', 'अदादि', 'जुहोत्यादि', 'दिवादि', 'तुदादि', 'रुधादि', 'तनादि', 'क्र्यादि', 'क्र्यादि', 'चुरादि'
// PADA: 'प.प', 'आ.प'

// var ctins = {'भ्वादि': {}, 'अदादि': {}, 'जुहोत्यादि': {}, 'दिवादि': {}, 'तुदादि': {}, 'रुधादि': {}, 'तनादि': {}, 'क्र्यादि': {}, 'क्र्यादि': {}, 'चुरादि': {}};
var ctins = {'01': {}, 'अदादि': {}, 'जुहोत्यादि': {}, 'दिवादि': {}, 'तुदादि': {}, 'रुधादि': {}, 'तनादि': {}, 'क्र्यादि': {}, 'क्र्यादि': {}, 'चुरादि': {}};

// === law
ctins['01']['लट्'] = {};
ctins['01']['लट्']['प'] = [
    '{"तिप्":["ति"],"तस्":["तः"],"झि":["न्ति"],"सिप्":["सि"],"थस्":["थः"],"थ":["थ"],"मिप्":["ामि"],"वस्":["ावः"],"मस्":["ामः"]}'
];
ctins['01']['लट्']['आ'] = [
    '{"त":["ते"],"आताम्":["ेते"],"झ":["न्ते"],"थास्":["से"],"आथाम्":["ेथे"],"ध्वम्":["ध्वे"],"इट्":["े"],"वहि":["ावहे"],"महिङ्":["ामहे"]}'
];

// === laN
ctins['01']['लङ्'] = {};
ctins['01']['लङ्']['प'] = [
    '{"तिप्":["त्"],"तस्":["ताम्"],"झि":["न्"],"सिप्":["ः"],"थस्":["तम्"],"थ":["त"],"मिप्":["म्"],"वस्":["ाव"],"मस्":["ाम"]}'
];
ctins['01']['लङ्']['आ'] = [
    '{"त":["त"],"आताम्":["ेताम्"],"झ":["न्त"],"थास्":["थाः"],"आथाम्":["ेथाम्"],"ध्वम्":["ध्वम्"],"इट्":["े"],"वहि":["ावहि"],"महिङ्":["ामहि"]}'
];

// === la
ctins['01']['लोट्'] = {};
ctins['01']['लोट्']['प'] = [
    '{"तिप्":["तु","तात्"],"तस्":["ताम्"],"झि":["न्तु"],"सिप्":["","तात्"],"थस्":["तम्"],"थ":["त"],"मिप्":["ानि"],"वस्":["ाव"],"मस्":["ाम"]}',
    '{"तिप्":["तु","तात्"],"तस्":["ताम्"],"झि":["न्तु"],"सिप्":["","तात्"],"थस्":["तम्"],"थ":["त"],"मिप्":["ाणि"],"वस्":["ाव"],"मस्":["ाम"]}'
];
ctins['01']['लोट्']['आ'] = [
    '{"त":["ताम्"],"आताम्":["ेताम्"],"झ":["न्ताम्"],"थास्":["स्व"],"आथाम्":["ेथाम्"],"ध्वम्":["ध्वम्"],"इट्":["ै"],"वहि":["ावहै"],"महिङ्":["ामहै"]}'
];

// === la
ctins['01']['विधिलिङ्'] = {};
ctins['01']['विधिलिङ्']['प'] = [
    'ेत्,ेताम्,ेयुः,ेः,ेतम्,ेत,ेयम्,ेव,ेम'
];
ctins['01']['विधिलिङ्']['आ'] = [
    'ेत,ेयाताम्,ेरन्,ेथाः,ेयाथाम्,ेयध्वम्,ेय,ेवहि,ेमहि'
];

// === la
ctins['01'][''] = {};
ctins['01']['']['प'] = [
    ''
];
ctins['01']['']['आ'] = [
    ''
];

// ================================= GANA second
// === law
ctins['अदादि']['लट्'] = {};
ctins['अदादि']['लट्']['प'] = [
    'ति,तः,न्ति,सि,थः,थ,मि,वः,मः',
    'िति,ितः,न्ति,िषि,िथः,िथ,िमि,िवः,िमः',
    'त्ति,त्तः,दन्ति,त्सि,त्थः,त्थ,द्मि,द्वः,द्मः' // не работает
];
ctins['अदादि']['लट्']['आ'] = [
    // добавить после полного index.js
    'ते,वाते,वते,षे,वाथे,ध्वे,वे,वहे,महे',
    'ते,याते,यते,षे,याथे,ध्वे,ये,वहे,महे',
    // 'ेते,याते,ेरते,ेषे,याथे,ेध्वे,ये,ेवहे,ेमहे',
    // 'ष्टे,शाते,शते,शिषे,शाथे,शिध्वे,शे,श्वहे,श्महे',
];

// === la
ctins['अदादि'][''] = {};
ctins['अदादि']['']['प'] = [
    ''
];
ctins['अदादि']['']['आ'] = [
    ''
];



exports = module.exports = ctins;
