// наборы tins для /bin/jnu2stem

// перенести в utils
var c = {};
c.laN = 'लङ्';


//  ['तिप्', 'तस्', 'झि', 'सिप्', 'थस्', 'थ', 'मिप्', 'वस्', 'मस्', 'त', 'आताम्', 'झ', 'थास्', 'आथाम्', 'ध्वम्', 'इट्', 'वहि', 'महिङ्'];
//  {'लट्', 'लङ्', 'लिट्', 'लुङ्', 'लुट्', 'ऌट्', 'लोट्', 'विधिलिङ्', 'आशीर्लिङ्', 'ॡङ्'};
// GANA: 'भ्वादि', 'अदादि', 'जुहोत्यादि', 'दिवादि', 'तुदादि', 'रुधादि', 'तनादि', 'क्र्यादि', 'क्र्यादि', 'चुरादि'
// PADA: 'प.प', 'आ.प'

// var ctins = {'भ्वादि': {}, 'अदादि': {}, 'जुहोत्यादि': {}, 'दिवादि': {}, 'तुदादि': {}, 'रुधादि': {}, 'तनादि': {}, 'क्र्यादि': {}, 'क्र्यादि': {}, 'चुरादि': {}};
var ctins = {'01': {}, 'अदादि': {}, 'जुहोत्यादि': {}, 'दिवादि': {}, 'तुदादि': {}, 'रुधादि': {}, 'तनादि': {}, 'क्र्यादि': {}, 'क्र्यादि': {}, 'चुरादि': {}};

// === law
ctins['01']['लट्'] = {};
ctins['01']['लट्']['प'] = [
    '{"तिप्":["ति"],"तस्":["तः"],"झि":["न्ति"],"सिप्":["सि"],"थस्":["थः"],"थ":["थ"],"मिप्":["ामि"],"वस्":["ावः"],"मस्":["ामः"]}'
];
ctins['01']['लट्']['आ'] = [
    '{"त":["ते"],"आताम्":["ेते"],"झ":["न्ते"],"थास्":["से"],"आथाम्":["ेथे"],"ध्वम्":["ध्वे"],"इट्":["े"],"वहि":["ावहे"],"महिङ्":["ामहे"]}'
];

// === laN
ctins['01']['लङ्'] = {};
ctins['01']['लङ्']['प'] = [
    '{"तिप्":["त्"],"तस्":["ताम्"],"झि":["न्"],"सिप्":["ः"],"थस्":["तम्"],"थ":["त"],"मिप्":["म्"],"वस्":["ाव"],"मस्":["ाम"]}'
];
ctins['01']['लङ्']['आ'] = [
    '{"त":["त"],"आताम्":["ेताम्"],"झ":["न्त"],"थास्":["थाः"],"आथाम्":["ेथाम्"],"ध्वम्":["ध्वम्"],"इट्":["े"],"वहि":["ावहि"],"महिङ्":["ामहि"]}'
];

// === la
ctins['01']['लोट्'] = {};
ctins['01']['लोट्']['प'] = [
    '{"तिप्":["तु","तात्"],"तस्":["ताम्"],"झि":["न्तु"],"सिप्":["","तात्"],"थस्":["तम्"],"थ":["त"],"मिप्":["ानि"],"वस्":["ाव"],"मस्":["ाम"]}',
    '{"तिप्":["तु","तात्"],"तस्":["ताम्"],"झि":["न्तु"],"सिप्":["","तात्"],"थस्":["तम्"],"थ":["त"],"मिप्":["ाणि"],"वस्":["ाव"],"मस्":["ाम"]}'
];
ctins['01']['लोट्']['आ'] = [
    '{"त":["ताम्"],"आताम्":["ेताम्"],"झ":["न्ताम्"],"थास्":["स्व"],"आथाम्":["ेथाम्"],"ध्वम्":["ध्वम्"],"इट्":["ै"],"वहि":["ावहै"],"महिङ्":["ामहै"]}'
];

// === la
ctins['01']['विधिलिङ्'] = {};
ctins['01']['विधिलिङ्']['प'] = [
    '{"तिप्":["त्"],"तस्":["ताम्"],"झि":["युः"],"सिप्":["ः"],"थस्":["तम्"],"थ":["त"],"मिप्":["यम्"],"वस्":["व"],"मस्":["म"]}'
];
ctins['01']['विधिलिङ्']['आ'] = [
    '{"त":["त"],"आताम्":["याताम्"],"झ":["रन्"],"थास्":["थाः"],"आथाम्":["याथाम्"],"ध्वम्":["ध्वम्"],"इट्":["य"],"वहि":["वहि"],"महिङ्":["महि"]}'
];


// === la
ctins['01']['लिट्'] = {};
ctins['01']['लिट्']['प'] = [
    '{"तिप्":[""],"तस्":["तुः"],"झि":["ुः"],"सिप्":["िथ"],"थस्":["थुः"],"थ":[""],"मिप्":[""],"वस्":["िव"],"मस्":["िम"]}',
    '{"तिप्":["ाञ्चकार"],"तस्":["ाञ्चक्रतुः"],"झि":["ाञ्चक्रुः"],"सिप्":["ाञ्चकर्थ"],"थस्":["ाञ्चक्रथुः"],"थ":["ाञ्चक्र"],"मिप्":["ाञ्चकर","ाञ्चकार"],"वस्":["ाञ्चकृव"],"मस्":["ाञ्चकृम"]}',
    '{"तिप्":["ौ"],"तस्":["तुः"],"झि":["ुः"],"सिप्":["ाथ","िथ"],"थस्":["थुः"],"थ":[""],"मिप्":["ौ"],"वस्":["िव"],"मस्":["िम"]}'
];
ctins['01']['लिट्']['आ'] = [
    '{"त":["े"],"आताम्":["ाते"],"झ":["िरे"],"थास्":["िषे"],"आथाम्":["ाथे"],"ध्वम्":["िध्वे","िढ्वे"],"इट्":["े"],"वहि":["िवहे"],"महिङ्":["िमहे"]}',
    '{"त":["े"],"आताम्":["ाते"],"झ":["िरे"],"थास्":["िषे"],"आथाम्":["ाथे"],"ध्वम्":["िध्वे"],"इट्":["े"],"वहि":["िवहे"],"महिङ्":["िमहे"]}',
    '{"त":["ाञ्चक्रे"],"आताम्":["ाञ्चक्राते"],"झ":["ाञ्चक्रिरे"],"थास्":["ाञ्चकृषे"],"आथाम्":["ाञ्चक्राथे"],"ध्वम्":["ाञ्चकृढ्वे"],"इट्":["ाञ्चक्रे"],"वहि":["ाञ्चकृवहे"],"महिङ्":["ाञ्चकृमहे"]}',
];

// === luw
ctins['01']['लुट्'] = {};
ctins['01']['लुट्']['प'] = [
    '{"तिप्":["ता"],"तस्":["तारौ"],"झि":["तारः"],"सिप्":["तासि"],"थस्":["तास्थः"],"थ":["तास्थ"],"मिप्":["तास्मि"],"वस्":["तास्वः"],"मस्":["तास्मः"]}'
];
ctins['01']['लुट्']['आ'] = [
    '{"त":["ता"],"आताम्":["तारौ"],"झ":["तारः"],"थास्":["तासे"],"आथाम्":["तासाथे"],"ध्वम्":["ताध्वे"],"इट्":["ताहे"],"वहि":["तास्वहे"],"महिङ्":["तास्महे"]}'
];


// === lfq
ctins['01']['लृट्'] = {};
ctins['01']['लृट्']['प'] = [
    '{"तिप्":["ष्यति"],"तस्":["ष्यतः"],"झि":["ष्यन्ति"],"सिप्":["ष्यसि"],"थस्":["ष्यथः"],"थ":["ष्यथ"],"मिप्":["ष्यामि"],"वस्":["ष्यावः"],"मस्":["ष्यामः"]}',
    '{"तिप्":["स्यति"],"तस्":["स्यतः"],"झि":["स्यन्ति"],"सिप्":["स्यसि"],"थस्":["स्यथः"],"थ":["स्यथ"],"मिप्":["स्यामि"],"वस्":["स्यावः"],"मस्":["स्यामः"]}'
];
ctins['01']['लृट्']['आ'] = [
    '{"त":["ष्यते"],"आताम्":["ष्येते"],"झ":["ष्यन्ते"],"थास्":["ष्यसे"],"आथाम्":["ष्येथे"],"ध्वम्":["ष्यध्वे"],"इट्":["ष्ये"],"वहि":["ष्यावहे"],"महिङ्":["ष्यामहे"]}',
    '{"त":["स्यते"],"आताम्":["स्येते"],"झ":["स्यन्ते"],"थास्":["स्यसे"],"आथाम्":["स्येथे"],"ध्वम्":["स्यध्वे"],"इट्":["स्ये"],"वहि":["स्यावहे"],"महिङ्":["स्यामहे"]}'
];

// === ASIrliN
ctins['01']['आशीर्लिङ्'] = {};
ctins['01']['आशीर्लिङ्']['प'] = [
    '{"तिप्":["त्"],"तस्":["स्ताम्"],"झि":["सुः"],"सिप्":["ः"],"थस्":["स्तम्"],"थ":["स्त"],"मिप्":["सम्"],"वस्":["स्व"],"मस्":["स्म"]}',
    '{"तिप्":["ायात्","ेयात्"],"तस्":["ायास्ताम्","ेयास्ताम्"],"झि":["ायासुः","ेयासुः"],"सिप्":["ायाः","ेयाः"],"थस्":["ायास्तम्","ेयास्तम्"],"थ":["ायास्त","ेयास्त"],"मिप्":["ायासम्","ेयासम्"],"वस्":["ायास्व","ेयास्व"],"मस्":["ायास्म","ेयास्म"]}'
];
ctins['01']['आशीर्लिङ्']['आ'] = [
    '{"त":["ष्ट"],"आताम्":["यास्ताम्"],"झ":["रन्"],"थास्":["ष्ठाः"],"आथाम्":["यास्थाम्"],"ध्वम्":["ध्वम्","ढ्वम्"],"इट्":["य"],"वहि":["वहि"],"महिङ्":["महि"]}',
    '{"त":["ष्ट"],"आताम्":["यास्ताम्"],"झ":["रन्"],"थास्":["ष्ठाः"],"आथाम्":["यास्थाम्"],"ध्वम्":["ध्वम्"],"इट्":["य"],"वहि":["वहि"],"महिङ्":["महि"]}',
    '{"त":["ष्ट"],"आताम्":["यास्ताम्"],"झ":["रन्"],"थास्":["ष्ठाः"],"आथाम्":["यास्थाम्"],"ध्वम्":["ढ्वम्"],"इट्":["य"],"वहि":["वहि"],"महिङ्":["महि"]}'
];

// === lfN
ctins['01']['लृङ्'] = {};
ctins['01']['लृङ्']['प'] = [
    '{"तिप्":["त्"],"तस्":["ताम्"],"झि":["न्"],"सिप्":["ः"],"थस्":["तम्"],"थ":["त"],"मिप्":["म्"],"वस्":["ाव"],"मस्":["ाम"]}'
];
ctins['01']['लृङ्']['आ'] = [
    '{"त":["त"],"आताम्":["ेताम्"],"झ":["न्त"],"थास्":["थाः"],"आथाम्":["ेथाम्"],"ध्वम्":["ध्वम्"],"इट्":["े"],"वहि":["ावहि"],"महिङ्":["ामहि"]}'
];

// === luN
ctins['01']['लुङ्'] = {};
ctins['01']['लुङ्']['प'] = [
    '{"तिप्":["ीत्"],"तस्":["िष्टाम्"],"झि":["िषुः"],"सिप्":["ीः"],"थस्":["िष्टम्"],"थ":["िष्ट"],"मिप्":["िषम्"],"वस्":["िष्व"],"मस्":["िष्म"]}',
    '{"तिप्":["त्"],"तस्":["ताम्"],"झि":["न्"],"सिप्":["ः"],"थस्":["तम्"],"थ":["त"],"मिप्":["म्"],"वस्":["ाव"],"मस्":["ाम"]}',
    '{"तिप्":["जीत्","ाजीत्"],"तस्":["जिष्टाम्","ाजिष्टाम्"],"झि":["जिषुः","ाजिषुः"],"सिप्":["जीः","ाजीः"],"थस्":["जिष्टम्","ाजिष्टम्"],"थ":["जिष्ट","ाजिष्ट"],"मिप्":["जिषम्","ाजिषम्"],"वस्":["जिष्व","ाजिष्व"],"मस्":["जिष्म","ाजिष्म"]}',
    '{"तिप्":["टीत्","ाटीत्"],"तस्":["टिष्टाम्","ाटिष्टाम्"],"झि":["टिषुः","ाटिषुः"],"सिप्":["टीः","ाटीः"],"थस्":["टिष्टम्","ाटिष्टम्"],"थ":["टिष्ट","ाटिष्ट"],"मिप्":["टिषम्","ाटिषम्"],"वस्":["टिष्व","ाटिष्व"],"मस्":["टिष्म","ाटिष्म"]}',

];
ctins['01']['लुङ्']['आ'] = [
    '{"त":["ष्ट"],"आताम्":["षाताम्"],"झ":["षत"],"थास्":["ष्ठाः"],"आथाम्":["षाथाम्"],"ध्वम्":["ध्वम्","ढ्वम्"],"इट्":["षि"],"वहि":["ष्वहि"],"महिङ्":["ष्महि"]}',
    '{"त":["ष्ट"],"आताम्":["षाताम्"],"झ":["षत"],"थास्":["ष्ठाः"],"आथाम्":["षाथाम्"],"ध्वम्":["ध्वम्"],"इट्":["षि"],"वहि":["ष्वहि"],"महिङ्":["ष्महि"]}',
    '{"त":["ष्ट"],"आताम्":["षाताम्"],"झ":["षत"],"थास्":["ष्ठाः"],"आथाम्":["षाथाम्"],"ध्वम्":["ढ्वम्"],"इट्":["षि"],"वहि":["ष्वहि"],"महिङ्":["ष्महि"]}',
    '{"तिप्":["डीत्","ाडीत्"],"तस्":["डिष्टाम्","ाडिष्टाम्"],"झि":["डिषुः","ाडिषुः"],"सिप्":["डीः","ाडीः"],"थस्":["डिष्टम्","ाडिष्टम्"],"थ":["डिष्ट","ाडिष्ट"],"मिप्":["डिषम्","ाडिषम्"],"वस्":["डिष्व","ाडिष्व"],"मस्":["डिष्म","ाडिष्म"]}',
    '{"तिप्":["णीत्","ाणीत्"],"तस्":["णिष्टाम्","ाणिष्टाम्"],"झि":["णिषुः","ाणिषुः"],"सिप्":["णीः","ाणीः"],"थस्":["णिष्टम्","ाणिष्टम्"],"थ":["णिष्ट","ाणिष्ट"],"मिप्":["णिषम्","ाणिषम्"],"वस्":["णिष्व","ाणिष्व"],"मस्":["णिष्म","ाणिष्म"]}',
    '{"तिप्":["नीत्","ानीत्"],"तस्":["निष्टाम्","ानिष्टाम्"],"झि":["निषुः","ानिषुः"],"सिप्":["नीः","ानीः"],"थस्":["निष्टम्","ानिष्टम्"],"थ":["निष्ट","ानिष्ट"],"मिप्":["निषम्","ानिषम्"],"वस्":["निष्व","ानिष्व"],"मस्":["निष्म","ानिष्म"]}',
    '{"तिप्":["सीत्","ासीत्"],"तस्":["सिष्टाम्","ासिष्टाम्"],"झि":["सिषुः","ासिषुः"],"सिप्":["सीः","ासीः"],"थस्":["सिष्टम्","ासिष्टम्"],"थ":["सिष्ट","ासिष्ट"],"मिप्":["सिषम्","ासिषम्"],"वस्":["सिष्व","ासिष्व"],"मस्":["सिष्म","ासिष्म"]}'
];

// === la
ctins['01'][''] = {};
ctins['01']['']['प'] = [
    ''
];
ctins['01']['']['आ'] = [
    ''
];

// === la
ctins['01'][''] = {};
ctins['01']['']['प'] = [
    ''
];
ctins['01']['']['आ'] = [
    ''
];

// ================================= GANA second
// === law
ctins['अदादि']['लट्'] = {};
ctins['अदादि']['लट्']['प'] = [
    'ति,तः,न्ति,सि,थः,थ,मि,वः,मः',
    'िति,ितः,न्ति,िषि,िथः,िथ,िमि,िवः,िमः',
    'त्ति,त्तः,दन्ति,त्सि,त्थः,त्थ,द्मि,द्वः,द्मः' // не работает
];
ctins['अदादि']['लट्']['आ'] = [
    // добавить после полного index.js
    'ते,वाते,वते,षे,वाथे,ध्वे,वे,वहे,महे',
    'ते,याते,यते,षे,याथे,ध्वे,ये,वहे,महे',
    // 'ेते,याते,ेरते,ेषे,याथे,ेध्वे,ये,ेवहे,ेमहे',
    // 'ष्टे,शाते,शते,शिषे,शाथे,शिध्वे,शे,श्वहे,श्महे',
];

// === la
ctins['अदादि'][''] = {};
ctins['अदादि']['']['प'] = [
    ''
];
ctins['अदादि']['']['आ'] = [
    ''
];



exports = module.exports = ctins;
