// наборы tins для /bin/jnu2stem

// перенести в utils
var c = {};
c.laN = 'लङ्';


//  ['तिप्', 'तस्', 'झि', 'सिप्', 'थस्', 'थ', 'मिप्', 'वस्', 'मस्', 'त', 'आताम्', 'झ', 'थास्', 'आथाम्', 'ध्वम्', 'इट्', 'वहि', 'महिङ्'];
//  {'लट्', 'लङ्', 'लिट्', 'लुङ्', 'लुट्', 'ऌट्', 'लोट्', 'विधिलिङ्', 'आशीर्लिङ्', 'ॡङ्'};
// GANA: भ्वादि, अदादि, जुहोत्यादि, दिवादि, तुदादि, रुधादि, तनादि, क्र्यादि, क्र्यादि, चुरादि
// PADA: 'प.प', 'आ.प'

var ctins = {};

ctins['भ्वादि'] = {};

// === law
ctins['भ्वादि']['लट्'] = {};
ctins['भ्वादि']['लट्']['प.प'] = [
    'ति,तः,न्ति,सि,थः,थ,ामि,ावः,ामः'
];
ctins['भ्वादि']['लट्']['आ.प'] = [
    'ते,ेते,न्ते,से,ेथे,ध्वे,े,ावहे,ामहे'
];

// === laN
ctins['भ्वादि']['लङ्'] = {};
ctins['भ्वादि']['लङ्']['प.प'] = [
    'त्,ताम्,न्,ः,तम्,त,म्,ाव,ाम'
];
ctins['भ्वादि']['लङ्']['आ.प'] = [
    'त,ेताम्,न्त,थाः,ेथाम्,ध्वम्,े,ावहि,ामहि',
    'त,ेताम्,न्त,ेथाः,ेथाम्,ध्वम्,े,ावहि,ामहि',
    'त,ताम्,न्त,थाः,ेथाम्,ध्वम्,े,ावहि,ामहि',
    'त,्ताम्,न्त,थाः,ेथाम्,ध्वम्,े,ावहि,ामहि'
];

// === la
ctins['भ्वादि']['लोट्'] = {};
ctins['भ्वादि']['लोट्']['प.प'] = [
    'तु,ताम्,न्तु,,तम्,त,ानि,ाव,ाम'
];
ctins['भ्वादि']['लोट्']['आ.प'] = [
    'ताम्,ेताम्,न्ताम्,स्व,ेथाम्,ध्वम्,ै,ावहै,ामहै',
    'ताम्,ेयाताम्,न्ताम्,स्व,ेयाथाम्,ध्वम्,ै,ावहै,ामहै',
    'िताम्,ेताम्,न्ताम्,स्व,ेथाम्,ध्वम्,ै,ावहै,ामहै'
];

// === la
ctins['भ्वादि']['विधिलिङ्'] = {};
ctins['भ्वादि']['विधिलिङ्']['प.प'] = [
    'ेत्,ेताम्,ेयुः,ेः,ेतम्,ेत,ेयम्,ेव,ेम'
];
ctins['भ्वादि']['विधिलिङ्']['आ.प'] = [
    'ेत,ेयाताम्,ेरन्,ेथाः,ेयाथाम्,ेयध्वम्,ेय,ेवहि,ेमहि'
];

// === la
ctins['भ्वादि'][''] = {};
ctins['भ्वादि']['']['प.प'] = [
    ''
];
ctins['भ्वादि']['']['आ.प'] = [
    ''
];

// === la
ctins['भ्वादि'][''] = {};
ctins['भ्वादि']['']['प.प'] = [
    ''
];
ctins['भ्वादि']['']['आ.प'] = [
    ''
];


exports = module.exports = ctins;
