// наборы tins для /bin/jnu2stem

// перенести в utils
var c = {};
c.laN = 'लङ्';

// var tips = ['तिप्', 'तस्', 'झि', 'सिप्', 'थस्', 'थ', 'मिप्', 'वस्', 'मस्', 'त', 'आताम्', 'झ', 'थास्', 'आथाम्', 'ध्वम्', 'इट्', 'वहि', 'महिङ्'];

var tins = {
    'लट्': {
        'परस्मै': ['["ति","तः","न्ति","सि","थः","थ","ामि","ावः","ामः"]'],
        'आत्मने': ['["ते","ेते","न्ते","से","ेथे","ध्वे","े","ावहे","ामहे"]']},
    'लङ्': {
        'परस्मै': ['["त्","ताम्","न्","ः","तम्","त","म्","ाव","ाम"]'],
        'आत्मने': ['["त","ेताम्","न्त","थाः","ेथाम्","ध्वम्","े","ावहि","ामहि"]', '["त","ेताम्","न्त","ेथाः","ेथाम्","ध्वम्","े","ावहि","ामहि"]', '["त","ताम्","न्त","थाः","ेथाम्","ध्वम्","े","ावहि","ामहि"]']},

    'लिट्': {
        'परस्मै': ['["","तुः","ुः","िथ","िथुः","","","िव","िम"]', '["","तुः","ुः","थ","थुः","","","िव","िम"]', '["","तुः","ुः","िथ","थुः","","","िव","िम"]'],
        'आत्मने': ['["्रे","्राते","्रिरे","ृषे","्राथे","्रृढ्वे","्रे","्रृवहे","्रृमहे"]', '["े","ाते","िरे","िषे","ाथे","िध्वे","े","िवहे","िमहे"]', ]},
    'लुङ्': {
        'परस्मै': ['["सीत्","ताम्","सुः","सीः","तम्","त","सम्","स्व","स्म"]', '["ीत्","िष्टाम्","िषुः","ीः","िष्टम्","िष्ट","िषम्","िष्व","िष्म"]', '["ीत्","िष्टाम्","िषुः","ीः","ितम्","ित","िम्","िष्व","िष्म"]', '["षीत्","ष्टाम्","षुः","षीः","तम्","ष्ट","षम्","ष्व","ष्म"]'],
        // первый json - должен включать букву -i- в каждом tin, сейчас она отходит к корню
        // второй - букву -e-
        // и исправить stems соответсвенно?
        'आत्मने': ['["ष्ट","षाताम्","षत","ष्ठाः","षाथाम्","ध्वम्","षि","ष्वहि","ष्महि"]',  '["िष्ट","िषाताम्","िषत","िष्ठाः","िषाथाम्","िढ्वम्","षि","िष्वहि","िष्महि"]']},
    // 'लुट्': {
    //     // -ta в начале каждой tin
    //     'परस्मै': [ '["","रौ","रः","सि","स्थः","स्थ","स्मि","स्वः","स्मः"]'],
    //     'आत्मने': ['["","रौ","रः","से","साथे","ध्वे","हे","स्वहे","स्महे"]']},
    // 'ऌट्': {
    //     // добавлена -ishya, так что все tins попадет в exceptions - как поправить?
    //     // или это разные массивы, - канонический для index и здешние jsons ?
    //     'परस्मै': ['["िष्यति","िष्यतः","िष्यन्ति","िष्यसि","िष्यथः","िष्यथ","िष्यामि","िष्यावः","िष्यामः"]'], // , '["ति","तः","न्ति","सि","थः","थ","ामि","ावः","ामः"]'
    //     'आत्मने': ['["ते","ेते","न्ते","से","ेथे","ध्वे","े","ावहे","ामहे"]']},
    // 'लोट्': {
    //     'परस्मै': ['["तु","ताम्","न्तु","","तम्","त","ानि","ाव","ाम"]'],
    //     'आत्मने': ['["ताम्","ेताम्","न्ताम्","स्व","ेथाम्","ध्वम्","ै","ावहै","ामहै"]']},
    // 'विधिलिङ्': {
    //     'परस्मै': ['["त्","ताम्","युः","ः","तम्","त","यम्","व","म"]'],
    //     'आत्मने': ['["त","याताम्","रन्","थाः","याथाम्","ध्वम्","य","वहि","महि"]']},
    // 'आशीर्लिङ्': {
    //     'परस्मै': ['["त्","स्ताम्","सुः","ः","स्तम्","स्त","सम्","स्व","स्म"]'],
    //     'आत्मने': ['["ष्ट","यास्ताम्","रन्","ष्ठाः","यास्थाम्","ध्वम्","य","वहि","महि"]']},
    // 'ॡङ्': {
    //     // - в начале -
    //     'परस्मै': [ '["त्","ताम्","न्","ः","तम्","त","म्","ाव","ाम"]'],
    //     'आत्मने': ['["त","ेताम्","न्त","थाः","ेथाम्","ध्वम्","े","ावहि","ामहि"]']}
    // 'templ': {
    // 'परस्मै': [],
    // 'आत्मने': []},
}

// var tins = {'लट्': [], 'लङ्': [], 'लिट्': [], 'लुङ्': [], 'लुट्': [], 'ऌट्': [], 'लोट्': [], 'विधिलिङ्': [], 'आशीर्लिङ्': [], 'ॡङ्': []};


exports = module.exports = tins;
