/*
 * константы FIXME: этот файл убрать - новый const.js
 *
 */

var shiva = require('shiva-sutras');

var Const = {};

Const.firsts = ['sg.1', 'sg.2', 'sg.3']; // FIXME: добавить сюда невозможные imperfect
Const.strong = ['sg.1', 'sg.2', 'sg.3']; // FIXME: добавить сюда невозможные imperfect
Const.thematic = [1,4,6,10];
//Const.cases = ['sg.3', 'sg.2', 'sg.1', 'du.3', 'du.2', 'du.1', 'pl.3', 'pl.2', 'pl.1'];
Const.consonants = shiva('हल्').result;
Const.vowels = shiva('अच्').liga().result;    //(',ा,ि,ी,ु,ू,ृ,ॄ,ऌ,े,ै,ो,ौ,ै,ौ');
Const.dirghas = shiva('अच्').dirgha().liga().result;    //(',ा,ि,ी,ु,ू,ृ,ॄ,ऌ,े,ै,ो,ौ,ै,ौ');
Const.Vowels = shiva('अच्', true).result;
Const.virama = '्';
Const.A = 'ा';
Const.e = 'े';
Const.anusvara = 'ं';
Const.visarga = 'ः';

Const.voiced_asp = shiva('झष्').result.sort();
Const.voiced = shiva('जश्').result.sort();
Const.unvoiced_asp = shiva('खच').result.sort();
Const.unvoiced = shiva('चय्').result.sort();

Const.vriddhi = {
    //"": "अ", // _ a - default, 'zero' for consonant stems
    "अ": "आ", // a A
    "आ": "आ", // A A
    "इ": "ऐ", // i ai
    "ए": "ऐ", // e ai
    "उ": "औ", // u au
    "ओ": "औ", // o au
    "ऋ": "आर", // r. Ar
    //"": "", // l. al
}

Const.longshort = {
    "आ": "अ", // A a
    "ा": "", // A a
    "ई": "इ", // I i
    "ऊ": "उ", // u
    //"": "", //
    "ू": "ु",
    "ी": "ि",
    //"": "",
}

Const.shortlong = { // redup
    //"अ": "आ", // A a
    //"": "ा", // A a
    //"इ": "ई", // I i
    //"उ": "ऊ", // u
    //"": "", //
    "ु": "ू",
    "ि": "ी",
    //"": "",
}

Const.guttural = ['क', 'ख', 'ग', 'घ', 'ड', 'ह'];
Const.palatal = ['च', 'छ', 'ज', 'झ', 'ञ', 'ज']; // j twice due to gana.3

Const.canBeCons = {
    'स': 'ष',
    'ध': 'त',
    'द': 'त',
    //'': '',
}

// FIXME: это нужно перенести в ShivaSutra?
Const.guna = {
    'ि' : 'े',
    'ु': 'ो',
    'ृ': 'र्',
    // л?
}

// везде в коде пока эта старая aguna !!!! Кроме lib/kridanta - теперь aguna - массив - краткая-долгая
Const.aguna = {
    'ो' : 'ु',
    'े': 'ि',
    // 'र्': 'ृ',
    // '': '',
}

Const.aGuna = {
    //'आ': 'अ',
    'ए': 'इ',
    'ओ': 'उ',
    'आर्': 'ऋ',
    //'': '',
}

Const.Guna = {
    'अ': 'आ',
    'इ': 'ए',
    'उ': 'ओ',
    'ऋ': 'आर्',
    'ई': 'ए',
    'ऊ': 'ओ',
    '': '',
}

Const.Long = {
    'अ': 'आ',
    'इ': 'ई',
    'उ': 'ऊ',
    //'ऋ': '',
    '': '',
}

Const.aLong = {
    'आ': 'अ',
    'ई': 'इ',
    'ऊ': 'उ',
    //'': 'ऋ',
    '': '',
}

Const.semivow = {
    'इ': 'य',
    'उ': 'व',
}

Const.agunaNEW = { // т.е. vriddhi to guna + vowel; guna to vowel
    'ो' : ['ु', 'ू'],
    'े': ['ि', 'ी'],
    '्र': ['ृ'], // दर् не уверен, во-первых, - в книге-то ar? - т.е. это агуна, но какая-то не такая. И не даст-ли лишних значений?
    'र्': ['ृ'], // вот это верная агуна, а ту - в exceptions
    'ए': ['इ', 'ई'],
    'ओ': ['उ', 'ऊ'],
    // vriddhi:
    'औ': ['उ', 'ऊ'],
    'ऐ': ['इ', 'ई'],
    'ै': ['ि', 'ी', 'े'],
    'ौ' : ['ु', 'ू', 'ो'],
    //'आर्': ['ऋ'], // आश्वपाल
}

Const.avriddhi = {
    'ौ' : 'ु', // nOti-nu
    // '': '',
}

// sandhi: अधि-अध्य; अभि-अभ्यु;
// ut- или ud- ?
// не, висарга в конце, это огого
//Const.upasarga = ['अति', 'अधि', 'अध्य', 'अनु', 'अप', 'अपि', 'अभि', 'अभ्यु', 'अव', 'आ', 'उत्', 'उद्', 'उप', 'नि', 'परा', 'परि', 'प्र', 'प्रति', 'वि', 'सम्', 'सु'];
// 'दुस्', 'दुर', 'निस्', 'निर्',

Const.upacomb = ['उपसं'];
Const.upaHash = {
    'नि': ['नि', 'xxx'],
    'दुस्': ['दुस्', 'दुर्', 'दुः', 'दुश्', 'दुष्'],
    'निस्': ['निस्', 'निर्', 'निः', 'निश्', 'निष्'],
    'अति': ['अति', 'अत्य'],
    'अधि': ['अधि', 'अध्य'],
    'अनु': ['अनु', 'xxx'],
    'अप': ['अप', 'xxx'],
    'अपि': ['अपि', 'xxx'],
    'अभि': ['अभि', 'अभ्य'],
    'अव': ['अव', 'xxx'],
    'आ': ['आ'],
    'उप': ['उप'],
    'उत्': ['उत्', 'उद्'],
    'अव': ['अव', 'xxx'],
    'परि': ['परि', 'xxx'],
    'परा': ['परा', 'xxx'],
    'प्र': ['प्र', 'xxx'],
    'प्रति': ['प्रति', 'प्रत्य'],
    'वि': ['वि', 'xxx'],
    'सम्': ['सं', 'xxx'],
    'सु': ['सु', 'स्व'],
}

// first gana has -yati endings, as in four gana
Const.yexcs =['नय', 'गाय'];

Const.eightExcep = ['कर्', 'कुर्', 'तन्', 'प्रतन्', 'सन्', 'मन्', 'क्षन्', 'वन्', 'अवतन्', 'आतन्', 'इन्', 'वितन्', 'सन्तन्', 'उत्तन्', 'अवितन्', 'अभ्यातन्'];

Const.exceptions = {
    'बध्': 'बन्ध्',
    'ध्रुह्': 'द्रुह्',
    'गी': 'गै', // g=one_lat_pas_gE
    '': '',
}

Const.redupExcep = { // а.к.а. strongDhatu ? поскольку rud-> rod - усиление?
    'नि': 'नी',
    'भि': 'भी',
    'गि': 'जि',
    'घन्': 'हन्',
    'षु': 'सु',
    'गन्': 'गम्',
    //'': '',
    'हू': 'हु',
    'सथ्': 'स्था',
    'सृम्': 'स्मृ',
    'कि': 'चि',
    '': '',
    '': '',

    // дальше значения из ganas. Переименовать просто в dhatuExcep? dhatuCorr?

    'शृ': 'श्रु',
    // ninth-class, W.730. a: grath or granth, badh or bandh, math or manth, skabh or skambh, stabh or stambh
    'बध्': 'बन्ध्',
    'ग्रथ्': 'ग्रन्थ्',
    'मथ्': 'मन्थ्',
    'स्कभ्': 'स्कम्भ्',
    ' स्तभ्': ' स्तम्भ्',
    //
    'स्थी': 'स्था',
    'गी': 'गै',

    'धुह्': 'दुह्', // это теперь рег. замена в ганах
    'वुच्': 'वच्',
    'प्': 'पा', // путается с imperfect Ap без A
    'य्': 'या',
    'नव्': 'नु',
    'नौ': 'नु',
    'य्': 'इ',
    'ची': 'चि',
    'श्रू': 'श्रु',
    'श्': 'अश्',
    'सू': 'सु', // почему-то закоммент. а нужно для five_lat_pass_su
    'ह्र्द': 'हृद',
    'चष्': 'चक्ष्',
    'चाल्': 'चल्',
    'अत्': 'अद्',
    'आस्द्': 'आस्',
    'लीढ्': 'लिह्',
    'ली': 'लिह्',
    'ब्रवी': 'ब्रू',
    'वश्': 'वच्',
    'ब्रुव्': 'ब्रू',
    'सुप्': 'स्वप्',
    'ई': 'या',
    'कर्': 'कृ',
    'कुर्': 'कृ',
    '': '',
}

Const.weakDhatu = { // weak -> dhatu
    // кандидаты в авто-замену ब्रू-
    'ग': 'गम्',
    'उक्': 'वच्-ब्रू', // ब्रू=-tvAc, वच्=-kta
    //'उक्': 'ब्रू',
    'दत्': 'दा-दे-दो',
    'बह्': 'बंह्',
    'उप्': 'वप्',
    'ऊ': 'वह्-ऊय्', // vah -UQaH
    'सुप्': 'स्वप्-सृभ्',
    'इष्': 'यज्',
    'विद्': 'व्यध्',
    'प्रष्': 'प्रछ्',
    'गी': 'गै',
    'हि': 'धा',
    'पी': 'पा-प्याय्',
    'जी': 'ज्या',
    'न': 'नम्',
    'य': 'यम्',
    'र': 'रम्',
    'क्ष': 'क्षन्',
    'त': 'तन्',
    //'मा': 'मन्',
    'ह': 'हन्',

    //'': '', дальше kridanta
    'अध्यी': 'अधी',
    'खि': 'खिद्',
    'गन्': 'गम्',
    //'गा': 'गै',
    //'ग्ला': 'ग्लै',
    //'त्रा': 'त्रै',
    //'ध्या': 'ध्यै',
    'नन्': 'नम्',
    'मङ्ज्': 'मज्ज्', // FIXME: это м.б. сандхи?
    //'म्ला': 'म्लै',
    'यन्': 'यम्',
    'रन्': 'रम्',
    'लि': 'लिह्',
    'वो': 'वह्', // WTF ? странный случай
    'वा': 'वे',
    'असू्': 'असूय',
    'करि': 'कॄ', // или करि , а не कृ, - чтобы не путать с कृ ?
    'क्षाल्': 'क्षल्',
    'गर्ह्': 'ग्रह्',
    'गृ': 'गॄ',
    'जृ': 'जॄ',
    //'ताड्': 'तड्',
    'दव्': 'दू', // FIXME: м.б. sandhi ?
    'पृ': 'पॄ',
    'भवि': 'भू', // BU - две формы
    'भवित': 'भू',
    'मूर्च्छ्': 'मुर्छ्',

    // ktvAc
    'जग्': 'अद्',
    'कु': 'कृ',
    'खिट्': 'खिद्', // FIXME: см. Ki -> Kid выше. Похоже, там тоже д.б. Ki.d -> Kid
    'द': 'दा',
    'ह्': 'धा',
    'नक्ष्': 'नश्',
    'तॄ': '',
    'भू': 'अस्',
    'श्': 'शी',
    'रू': 'रुह्',
    'उश्': 'वस्',
    'हह्': 'ह्वे',
    'अष्': 'अक्ष्',
    'इध्': 'इन्ध्',
    'उच्छ्': 'उछ्',
    'ऊर्': 'उर्व्', // N->v
    'अच्': 'अञ्च्',
    //'उक्': 'वच्',
    'ऊर्णाव्': 'ऊर्णु',
    'ऋच्छ्': 'ऋछ्',
    'ऋफ्': 'ऋम्फ्',
    'ईर्': 'ॠ',
    //'काम्': 'कम्',
    'कान्': 'कम्',
    //'काल्': 'कल्',
    'चिकित्स्': 'कित्',
    'कुच्': 'कुञ्च्',
    'कुथ्': 'कुन्थ्',
    'कलृप्': 'कृप्',
    'कीर्': 'कॄ',
    'कीर्त्': 'कॄत्',
    'क्नू': 'क्नूय्',
    'क्रान्': 'क्रम्',
    'क्लान्': 'क्लम्',
    'क्लिन्': 'क्लिद्',
    'क्षान्': 'क्षम्',
    'क्षी': 'क्षि',
    'क्षि्': 'क्षि',
    'क्ष्यू': 'क्षीव्',
    'क्षुण्': 'क्षुद्',

    'क्षयू': 'क्षेव्',
    //'क्षा': 'क्षै', // A-ai
    'क्ष्मा': 'क्ष्माय्',
    'क्ष्विण्': 'क्ष्विद्',
    //'खाड्': 'खड्',
    'खा': 'खन्',
    //'खा': 'खै',
    'खिन्': 'खिद्',

    //'गाज्': 'गज्',
    //'गाल्': 'गल्',
    'गू': 'गु',
    'जुगुप्स्': 'गुप्',
    'गुफ्': 'गुम्फ्',
    'गूर्': 'गुर्व्',
    'गू': 'गुह्',
    'गीर्': 'गॄ',
    'ग्रास्': 'ग्रस्',
    'ग्लुच्': 'ग्लुञ्च्',
    //'घाट्': 'घट्',
    'घार्': 'घृ',
    'क्शा': 'चक्ष्',
    'ख्या': 'चक्ष्',
    'चच्': 'चञ्च्',
    // 'चाट्': 'चट्',
    // 'चान्': 'चन्',
    'चन्': 'चम्',
    // 'चार्': 'चर्',
    // 'चाल्': 'चल्',
    // 'चाह्': 'चह्',

    'चय्': 'चि',
    'चपय्': 'चि',
    'चाय्': 'चि',
    'चिर्य्': 'चिरि',
    'छन्': 'छम्',
    'ध्': 'छो',
    'जा': 'जन्',
    'जप्': 'जभ्',
    'जान्': 'जम्',
    'जिरि्': 'जिरि',
    'जीर्': 'जॄ',
    'जार्': 'जॄ',
    'ज्ञाप्': 'ज्ञा',
    'ज्रा्': 'ज्रि',
    //'जा': 'जै',
    'तष्': 'तक्ष्',

    'तच्': 'तञ्च्',
    'तान्': 'तम्',
    'तुन्': 'तुद्',
    //'तुप्': 'तुष्', // FIXME: dhatu tup существует. Лишнее значение  BUG:
    'तुप्': 'तुम्प्-तुष्',
    'तुफ्': 'तुम्फ्',
    'तूर्': 'तुर्व्',

    'तृ': 'तृण्-तृह्-तृंह्',
    'तीर्': 'तॄ',
    'त्रुप्': 'त्रुम्प्',
    'त्वष्': 'त्वक्ष्',
    'त्वच्': 'त्वञ्च्',

    'दान्': 'दम्',
    'दप्': 'दम्भ्',
    'दीदांस्': 'दान्',
    'द्यू': 'दिव्',
    'दीध्': 'दीधी',
    'दू': 'दु',
    'दूर्व्': 'दुर्व्',
    'दर्भ्': 'दृभ्',

    'दरी': 'दॄ',
    'दरि': 'दॄ',
    'दृप्': 'दृभ्',
    //'दा': 'दै',
    'दष्': 'दंश्',
    //'द्या': 'द्यै',
    'द्रू': 'द्रुह्',
    //'द्रा': 'द्रै',
    'धौ': 'धाव्',
    'धून्': 'धू',
    'धीर्': 'धॄ',
    'धी': 'धे',
    'नीर्': 'नॄ',
    'गा': 'गाह्',
    'गू': 'गु-गुह्',

    'नद्': 'नह्', // FIXME: это м.б. сандхи?
    'पिच्छ्': 'पिछ्',
    'पव्': 'पू',
    'पार्': 'पॄ',
    'पृष्': 'प्रछ्',
    'प्रीणि': 'प्री',
    'बीभत्स्': 'बध्',
    'मन्न': 'मद्',
    'मि': 'मा-मे',

    'मिच्छ्': 'मिछ्',
    'मिन्': 'मिद्',
    'मी': 'मिह्',
    'माय्': 'मी',
    'मूर्': 'मुर्छ्-मुर्व्-मॄ',
    'मुक्': 'म्रुच्',
    'म्लुक्': 'म्लुञ्च्',
    'यान्': 'यम्',

    'याव्': 'यु',
    'युच्छ्': 'युछ्',
    'रज्': 'रञ्ज्',
    'रि': 'री',
    'लच्छ्': 'लछ्',
    'लग्': 'लज्-लस्ज्', // м.б. сандхи?
    'ओलण्ड्': 'लण्ड्',
    'ली': 'लिह्',
    'लाय्': 'ली',
    'लुप्': 'लुभ्',
    'लु': 'लू',
    'वच्': 'वञ्च्',
    'वान्': 'वम्',
    'उश्': 'वश्',
    'उष्': 'वस्',
    'विच्छ्': 'विछ्',
    'विच्छाय्': 'विछ्',

    'विग्': 'विज्', // сандхи?
    'विन्': 'विद्',
    'वृ': 'वृह्',
    'वूर्': 'वॄ',
    'वेवि': 'वेवी',
    'विच्': 'व्यच्',
    'वी': 'व्ये',
    'वृश्': 'व्रश्च्',
    'शन्': 'शद्',
    'शान्': 'शम्',
    'शीशांस्': 'शान्',
    'शिष्': 'शास्',
    'शुध्': 'शुन्ध्',
    'शुभ्': 'शुम्भ्',
    'शि': 'शो',
    'श्रथ्': 'श्रन्थ्',
    'श्रान्': 'श्रम्',
    'शृ': 'श्रा',

    'श्रृ': 'श्रै',
    'ष्ठयू': 'ष्ठिव्',
    'सज्': 'सञ्ज्',
    'सन्': 'सण्',
    'सा': 'सन्',
    'सज्ज्': 'सस्ज्',
    'सिप्': 'सिभ्',
    'स्यू': 'सिव्',
    'सृप्': 'सृम्भ्',
    'सि': 'सो',

    'स्कन्': 'स्कन्द्',
    'स्तुप्': 'स्तुभ्',
    'स्तृ': 'स्तृह्',
    'स्तीर्': 'स्तॄ',
    'स्निग्': 'स्निह्',
    'स्नी': 'स्निह्',
    'स्फा': 'स्फाय्',
    'स्फी': 'स्फाय्',

    'स्माय्': 'स्मि',
    'स्यन्': 'स्यन्द्',
    'स्यान्': 'स्यम्',
    'स्रप्': 'स्रम्भ्',
    'स्रस्': 'स्रंस्',
    'स्वज्': 'स्वञ्ज्',
    'स्विण्': 'स्विद्',

    'हम्': 'हम्म्',
    'ही': 'हा',
    '': '',
    'ह्रीच्छ्': 'ह्रीछ्',
    'दिग्': 'दिह्',
    'दुग्': 'दुह्',
    'द्रुग्': 'द्रुह्',
    'हूर्ष्': 'हुर्छ्',
    'कर्त्': 'कृ',
    'दग्' : 'दह्',
    'प्रच्': 'प्रछ्',
    //'मोग्': 'मुह्',
    'मुग्': 'मुह्', // seems like a sandhi
    'रुद्': 'रुह्', // the same
    'भव्': 'अस्',
    'असूय्': 'असूय',
    'जरी': 'जॄ',
    '': '',
    // here
    '': '',

    // FIXME: долгая соединительная I. - метод?
    'गृही': 'ग्रह्',
    '': '',
    '': '',
    // не нужная вирама. Корень на гласную. Нужно заменить на метод - добавлять вираму, только если в корне нет гласной
    'स्थ्': 'स्था',
    '': '',
    '': '',
    '': '',
    '': '',
    // FIXME: отброшено d/t из-за tt
    'प': 'पद्',
    '': '',
    '': '',
    '': '',
    // FIXME: неправильно отброшено окончание i, иногда вместе с d,D
    'च्': 'चि',
    'ज्': 'जि',
    'छ्': 'छिद्',
    'भ्': 'भिद्',

    '': ''
}

Const.weakNama = { // weak -> dhatu
    'गुरतल्प': 'गुरुतल्प',
    'नेयाय': 'न्याय',
    'वार्त': 'वृत्त',
    'साप्त': 'सप्तत',
    'सामाज': 'समाज',
    'वादर': 'बदर', // FIXME: можно регулярно va->ba ?
    'मह': 'महत्',
    'विद्व': 'विद्वस्',
    'विद्वत्': 'विद्वस्',
    '': '',
    '': '',
    '': '',
    // FIXME: тут можно сделать замену i регулярную. Поскольку много слов на i. Но тогда много лишних на i
    'नास्त': 'नास्ति',
    '': '',
    '': '',
    // A - var A в словаре заменить на var a ? - сейчас проверяю А, нужно систематич. обрабатывать суффикс
    'इच्छ': 'इच्छा',
    '': '',
    '': '',
    // A (dhatu) - a (form) - в метод ?
    'अत्मीय': 'आत्मीय',
    '': '',

    // namas from /test/noun_xxx
    'गी': 'गि',
    '': '',
    '': ''
}



Const.reversedA = { // это нужно, если в g.1 искать dhatu, то есть пока не нужно
    'य': 'ि-ी',
}

// если form оканчивается на avam, а флексия равна Am, то avam->oAm, и Am можно будет отбросить. form = atan-avam -> atanoAm
// если form -k, а flex -ti, то варианты -kti, -cti. -kti исходный, а здесь лишь добавочный -cti. FIXME: Нет ли еще вариантов -jti, например?
// пока что все окончания вынесены в отдельный flex

// на что начинается флексия // here
Const.T = ['त', 'थ', 'ठ', 'ट']; // dental, cerebral
Const.D = ['द', 'ध', 'ढ', 'ड'];
Const.S = ['स', 'ष'];
Const.N = ['न', 'ण', 'ञ'];
Const.V = ['व'];

Const.lets = {
    'त': Const.T,
    'द': Const.D,
    'स': Const.S,
    'न': Const.N,
    'व': Const.V,
    //'ट': Const.T,
}

Const.sandhi_t = {
    'ीर्': ['ॄ', 'ृ'],
    'ूर्': ['ॄ'],
    'त्': ['द्'],
    'क्': ['ज्', 'च्'],
    'ट्': ['द्'],
    '': ['', ''],
    '': ['', ''],
}

Const.sandhi_w = {
    'ष्': ['ज्', 'श्', 'च्'],
    '': ['', ''],
    '': ['', '']
}

Const.sandhi_D = {
    'घ्': ['ह्'],
    'ध्': ['ह्'],
    'ग्': ['ह्'],
    'द्': ['ह्'],
    '': ['', '']
}

Const.sandhi_v = {
    'क्': ['ज्', 'च्'],
    '': ['', ''],
    '': ['', '']
}



// на что заканчивается вариант стема -> другие варианты
Const.reversedT = {
    'क': 'च-ज',
    'त': 'द',
    'ष': 'स-च',
}

Const.reversedD = {
    'ग': 'ज-ह',
    'ड': 'च',
    // h-sandhi
    'े': 'िह्',
}

Const.reversedS = {
    'त': 'द',
    'क': 'ज-ष-च-ह',
}

Const.reversedSandhi_ = {
    //'flex' {'from': 'to+flex', etc},
    // FIXME: очевидно, можно упростить по одинаковым согласным, иначе слишком много вариантов
    // FIXME: м.б., это можно вынести в файл флексии?
    'ति': ['क-च', 'क-ज', 'त-द'], // 2. lat_par_yuj_sg.3_yunakti, 3. Bid_sg.3_Binatti
    'धु': ['द-ध'], // 1. seven_lot_par_ruD_sg.3_ruRadDu
    'तु': ['क-ज'], // 1. seven_lot_par_yuj_sg.3_yunaktu
    'षि': ['क-च', 'क-ज', 'क-ष'], // 3.
    'सि': ['त-ध', 'त-द'], // 1. par_ruD_sg.2_ruRatsi; 2. Bid_sg.2_Binatsi
    'ताम्': ['क-ज'], // 1. seven_lot_par_yuj_du.3_yuNktAm
    'तम्': ['क-ज'], // 1. seven_lot_par_yuj_du.2_yuNktAm
    'त': ['क-ज'], // 1. seven_lot_par_yuj_pl.2_yuNkta

    'ते': ['क-ज'],
    'से': ['त-ध'], // lat_atm_ruD_sg.2_runtse
    'षे': ['क-ज'], // atm_yuj_sg.2_yuNkze
    'तः': ['क-च', 'क-ज', 'त-द'], // 3. Bid_du.3_BinttaH
    'थः': ['क-च', 'क-ज', 'त-द'],
    'थ': ['क-च', 'न-म', 'क-ज', 'त-द'], // 2. lit_par_gam_sg.2_jaganTa; 3. lat_par_yuj_pl.2_yuNkTa
    'ठ': ['ष-ज'], // 1. lit_par_yaj_sg.2_iyazWa
    'धि': ['द-ध', 'ग-ज'], // g.7 sg.1 lat_par_ruD_sg.3_ruRadDi, 2. seven_lot_par_yuj_sg.2_yuNgDi
    'ध्वे': ['ग-ज'], // atm_yuj_pl.2_yuNgDve
}

Const.reversedSandhi_ = {
    //'flex' {'from': 'to+flex', etc},
    // FIXME: очевидно, можно упростить по одинаковым согласным, иначе слишком много вариантов
    // FIXME: м.б., это можно вынести в файл флексии?
    'ति': {'क्ति': 'च्ति'},
    'षि': {'क्षि': 'च्षि'},
    'तः': {'क्तः': 'च्तः'},
    'थः': {'क्थः': 'च्थः'},
    'थ': {'क्थ': 'च्थ'},
    'ठ': {'ष्ठ': 'ज्ठ'}, // 2. lit_par_yaj_sg.2_iyazWa
}

//
Const.stemsOneEndsWithY = [ 'पय', 'लय', 'डय', 'मय', 'नय', 'जय', 'ज्रय'];
Const.stemsOneEndsWithE = [ 'गाय'];
Const.stemsOneWithGuna = ['एष',];

Const.secondGanaSandhi = {
    'क':'च-ह', // ज
    'त':'द',
    'ग':'ह',
    // 'ग्ध':'ह', // duh-atm-dugDe - неверно, это не sg.1, а sg.3, т.е. нужно вычесть -te
    //'क्ष':'च', // vac atm - vakze непонятно, есть ли такая форма
}

Const.weakClassEnds_ = {
    //"अ": 1,
    //"य": 4,
    "नु": 5,
    "न्": 5, // opts, before flex on -v,m
    "नुव": 5, // stem ends on cont
    "न्व": 5, // stem ends on vowel
    "णु": 5,
    "ण्": 5, // opts, before flex on -v,m
    "णुव": 5, // stem ends on cont
    "ण्व": 5, // stem ends on vowel
    //"अ": 6,
    //"ं": 7,
    //"-न-": 7,
    "ु": 8,
    "नी": 9,
    "न": 9,
    "णी": 9,
    "ण": 9,
    //"अय": 10
}

Const.dhatuStemCorr_ = {
    'पु': 'पू',
}

Const.strongClassEnds_ = {
    "नो": 5,
    "णो": 5,
    //"-न-": 7,
    ///"ु": 8, WTF
    "ो": 8,
    "ना": 9,
    "णा": 9
}

// ends : c,d,h,s(MS), D,z,j,t == готово D, j, d, z, Ms, c
Const.canBeSeven= ['न', 'ण', 'ङ', 'ञ', 'ं']; // 'द',
Const.seventhDhatus = ['ध', 'ज', 'द', 'ष', 'ंस', 'च'];
Const.seventhStemDhatus_ = {
    strong: {
        'द': 'द-ध', // द - cause of it IS here as a key
        'त': 'द',
        'क': 'ज-च-ष',
        'स': 'ंस', // anusvara
        'ः': 'ंस', //
    },
    weak: {
        'द': 'द-ध',
        'त': 'द',
        'क': 'ज-च',
        'ष': 'स', // anusvara in stem
    }
}

Const.seventhStemEnds_ = {
    'sg.3': ['णद', 'नक', 'नत', 'नष', 'नस', 'णक'],
    'sg.2': ['णत', 'नक', 'नत', 'नक', 'नः', 'णक'],
    'sg.1': ['णध', 'नज', 'नद', 'नष', 'नस', 'णच'],
    'du.3': ['न्द', 'ङ्क', 'न्त', 'ंष', 'ंष', 'ङ्क'],
    'du.2': ['न्द', 'ङ्क', 'न्त', 'ंष', 'ंष', 'ङ्क'],
    'du.1': ['न्ध', 'ञ्ज', 'न्द', 'ंष', 'ंष', 'ञ्च'],
    'pl.3': ['न्ध', 'ञ्ज', 'न्द', 'ंष', 'ंस', 'ञ्च'],
    'pl.2': ['न्द', 'ङ्क', 'न्त', 'ंष', 'ंष', 'ङ्क'],
    'pl.1': ['न्ध', 'ञ्ज', 'न्द', 'ंष', 'ंष', 'ञ्च']
}

Const.namanEnds = {
    'masc': {
        'sg' : {
            'a': {
                'dict': '',
                'sg.nom': 'ः',
                'sg.acc': 'म्',
                'sg.ins': 'ेन-ेण-ञ',
                'sg.dat': 'ाय',
                'sg.abl': 'ात्',
                'sg.gen': 'स्य',
                'sg.loc': 'े',
                'sg.voc': '',
            } ,

            'E': {
                'dict': 'ै',
                'sg.nom': 'ाः',
                'sg.acc': 'ायम्',
                'sg.ins': 'ाया',
                'sg.dat': 'ाये',
                'sg.abl': 'ायः',
                'sg.gen': 'ायः',
                'sg.loc': 'ायि',
                'sg.voc': 'ाः',
            } ,

            'an': {
                'dict': 'न्',
                'sg.nom': 'ा',
                'sg.acc': 'ानम्',
                'sg.ins': 'ना-्ञा-णा', // Y+varama, why?
                'sg.dat': 'ने-णे-्ञे',
                'sg.abl': 'नः-णः-्ञः',
                'sg.gen': 'नः-णः-्ञः',
                'sg.loc': 'नि-णि-्ञि',
                'sg.voc': 'न्',
            } ,

            'at': {
                'dict': 'त्',
                'sg.nom': 'ान्-त्', // -t for dyumat - adj = make naman g=masc_at_.+_sg.acc
                'sg.acc': 'न्तम्-त्',
                'sg.ins': 'ता',
                'sg.dat': 'ते',
                'sg.abl': 'तः',
                'sg.gen': 'तः',
                'sg.loc': 'ति',
                'sg.voc': 'न्-त्',
            } ,

            'i': {
                'dict': 'ि',
                'sg.nom': 'िः',
                'sg.acc': 'िम्',
                'sg.ins': 'िना',
                'sg.dat': 'ये',
                'sg.abl': 'ेः',
                'sg.gen': 'ेः',
                'sg.loc': 'ौ',
                'sg.voc': 'े',
            } ,

            'f': {
                'dict': 'ृ',
                'sg.nom': 'ा',
                'sg.acc': 'रम्-ारम्',
                'sg.ins': '्रा',
                'sg.dat': '्रे',
                'sg.abl': 'ुः',
                'sg.gen': 'ुः',
                'sg.loc': 'रि',
                'sg.voc': 'ः',
            } ,

            'u': {
                'dict': 'ु',
                'sg.nom': 'ुः',
                'sg.acc': 'ुम्',
                'sg.ins': 'ुना-ुणा',
                'sg.dat': 'वे',
                'sg.abl': 'ोः',
                'sg.gen': 'ोः',
                'sg.loc': 'ौ',
                'sg.voc': 'ो',
            } ,

            'us': {
                'dict': 'ुस्',
                'sg.nom': 'ुः',
                'sg.acc': 'ुषम्',
                'sg.ins': 'ुषा',
                'sg.dat': 'ुषे',
                'sg.abl': 'ुषः',
                'sg.gen': 'ुषः',
                'sg.loc': 'ुषि',
                'sg.voc': 'ुः',
            } ,

            // ==== consonants ===
            'd': {
                'dict': 'द्',
                'sg.nom': 'त्',
                'sg.acc': 'दम्',
                'sg.ins': 'दा',
                'sg.dat': 'दे',
                'sg.abl': 'दः',
                'sg.gen': 'दः',
                'sg.loc': 'दि',
                'sg.voc': 'त्',
            } ,

            't': { // cons
                'dict': 'त्',
                'sg.nom': 'त्',
                'sg.acc': 'तम्',
                'sg.ins': 'ता',
                'sg.dat': 'ते',
                'sg.abl': 'तः',
                'sg.gen': 'तः',
                'sg.loc': 'त',
                'sg.voc': 'त्',
            } ,

            'm': { // cons masc
                'dict': 'म्',
                'sg.nom': 'म्',
                'sg.acc': 'मम्',
                'sg.ins': 'मा',
                'sg.dat': 'मे',
                'sg.abl': 'मः',
                'sg.gen': 'मः',
                'sg.loc': 'मि',
                'sg.voc': 'म्',
            } ,

            'B': { // cons masc
                'dict': 'भ्',
                'sg.nom': 'प्',
                'sg.acc': 'भम्',
                'sg.ins': 'भा',
                'sg.dat': 'भे',
                'sg.abl': 'भः',
                'sg.gen': 'भः',
                'sg.loc': 'भि',
                'sg.voc': 'प्',
            } ,

            'S': { // cons
                'dict': 'श्',
                'sg.nom': 'ट्',
                'sg.acc': 'शम्',
                'sg.ins': 'शा',
                'sg.dat': 'शे',
                'sg.abl': 'शः',
                'sg.gen': 'शः',
                'sg.loc': 'शि',
                'sg.voc': 'ट्',
            } ,

            's': {
                'dict': 'स्',
                'sg.nom': 'ः',
                'sg.acc': 'सम्',
                'sg.ins': 'सा',
                'sg.dat': 'से',
                'sg.abl': 'सः',
                'sg.gen': 'सः',
                'sg.loc': 'सि',
                'sg.voc': 'ः',
            } ,


            // === palatal ===
            'j': {
                'dict': 'ज्',
                'sg.nom': 'ट्-ङ्',
                'sg.acc': 'जम्-ञ्जम्',
                'sg.ins': 'जा',
                'sg.dat': 'जे',
                'sg.abl': 'जः',
                'sg.gen': 'जः',
                'sg.loc': 'जि',
                'sg.voc': 'ट्-ङ्',
            } ,

            'c': {
                'dict': 'च्',
                'sg.nom': 'क्',
                'sg.acc': 'चम्',
                'sg.ins': 'चा',
                'sg.dat': 'चे',
                'sg.abl': 'चः',
                'sg.gen': 'चः',
                'sg.loc': 'चि',
                'sg.voc': 'क्',
            } ,

            'h': {
                'dict': 'ह्',
                'sg.nom': 'ट्',
                'sg.acc': 'हम्',
                'sg.ins': 'हा',
                'sg.dat': 'हे',
                'sg.abl': 'हः',
                'sg.gen': 'हः',
                'sg.loc': 'हि',
                'sg.voc': 'ट्',
            } ,


            'T': { // sg
                'dict': '',
                'sg.nom': '',
                'sg.acc': '',
                'sg.ins': '',
                'sg.dat': '',
                'sg.abl': '',
                'sg.gen': '',
                'sg.loc': '',
                'sg.voc': '',
            } ,

        },

        // === DU === masc
        'du' : {
            'a': {
                'dict': '',
                'du.nom': 'ौ',
                'du.acc': 'ौ',
                'du.ins': 'ाभ्याम्',
                'du.dat': 'ाभ्याम्',
                'du.abl': 'ाभ्याम्',
                'du.gen': 'योः',
                'du.loc': 'योः',
                'du.voc': 'ौ',
            } ,

            'E': {
                'dict': 'ै',
                'du.nom': 'ायौ',
                'du.acc': 'ायौ',
                'du.ins': 'ाभ्याम्',
                'du.dat': 'ाभ्याम्',
                'du.abl': 'ाभ्याम्',
                'du.gen': 'ायोः',
                'du.loc': 'ायोः',
                'du.voc': 'ायौ',
            } ,

            'an': {
                'dict': 'न्',
                'du.nom': 'ानौ',
                'du.acc': 'ानौ',
                'du.ins': 'भ्याम्',
                'du.dat': 'भ्याम्',
                'du.abl': 'भ्याम्',
                'du.gen': '्ञोः-नोः',
                'du.loc': '्ञोः-नोः',
                'du.voc': 'ानौ',
            } ,

            'at': {
                'dict': 'त्',
                'du.nom': 'न्तौ-ती',
                'du.acc': 'न्तौ-ती',
                'du.ins': 'द्भ्याम्',
                'du.dat': 'द्भ्याम्',
                'du.abl': 'द्भ्याम्',
                'du.gen': 'तोः',
                'du.loc': 'तोः',
                'du.voc': 'न्तौ-ती',
            } ,

            'T': { // cons
                'dict': '',
                'du.nom': '',
                'du.acc': '',
                'du.ins': '',
                'du.dat': '',
                'du.abl': '',
                'du.gen': '',
                'du.loc': '',
                'du.voc': '',
            } ,

            'i': {
                'dict': 'ि',
                'du.nom': 'ी',
                'du.acc': 'ी',
                'du.ins': 'िभ्याम्',
                'du.dat': 'िभ्याम्',
                'du.abl': 'िभ्याम्',
                'du.gen': '्योः',
                'du.loc': '्योः',
                'du.voc': 'ी',
            } ,

            'u': {
                'dict': 'ु',
                'du.nom': 'ू',
                'du.acc': 'ू',
                'du.ins': 'ुभ्याम्',
                'du.dat': 'ुभ्याम्',
                'du.abl': 'ुभ्याम्',
                'du.gen': '्वोः',
                'du.loc': '्वोः',
                'du.voc': 'ू',
            } ,

            'f': {
                'dict': 'ृ',
                'du.nom': 'ारौ-रौ',
                'du.acc': 'ारौ-रौ',
                'du.ins': 'ृभ्याम्',
                'du.dat': 'ृभ्याम्',
                'du.abl': 'ृभ्याम्',
                'du.gen': '्रोः',
                'du.loc': '्रोः',
                'du.voc': 'ारौ-रौ',
            } ,

            's': {
                'dict': 'स्',
                'du.nom': 'सौ',
                'du.acc': 'सौ',
                'du.ins': 'र्भ्याम्',
                'du.dat': 'र्भ्याम्',
                'du.abl': 'र्भ्याम्',
                'du.gen': 'सोः',
                'du.loc': 'सोः',
                'du.voc': 'सौ',
            } ,

            'us': {
                'dict': 'ुस्',
                'du.nom': 'ुषौ',
                'du.acc': 'ुषौ',
                'du.ins': 'ुर्भ्याम्',
                'du.dat': 'ुर्भ्याम्',
                'du.abl': 'ुर्भ्याम्',
                'du.gen': 'ुषोः',
                'du.loc': 'ुषोः',
                'du.voc': 'ुषौ',
            } ,

            // ==== palatal ====

            'j': {
                'dict': 'ज्',
                'du.nom': 'जौ-ञ्जौ',
                'du.acc': 'जौ-ञ्जौ',
                'du.ins': 'ड्भ्याम्-ग्भ्याम्',
                'du.dat': 'ड्भ्याम्-ग्भ्याम्',
                'du.abl': 'ड्भ्याम्-ग्भ्याम्',
                'du.gen': 'जोः',
                'du.loc': 'जोः',
                'du.voc': 'जौ-ञ्जौ',
            } ,

            'c': {
                'dict': 'च्',
                'du.nom': 'चौ',
                'du.acc': 'चौ',
                'du.ins': 'ग्भ्याम्',
                'du.dat': 'ग्भ्याम्',
                'du.abl': 'ग्भ्याम्',
                'du.gen': 'चोः',
                'du.loc': 'चोः',
                'du.voc': 'चौ',
            } ,

            'h': {
                'dict': 'ह्',
                'du.nom': 'हौ',
                'du.acc': 'हौ',
                'du.ins': 'ड्भ्याम्',
                'du.dat': 'ड्भ्याम्',
                'du.abl': 'ड्भ्याम्',
                'du.gen': 'होः',
                'du.loc': 'होः',
                'du.voc': 'हौ',
            } ,

            // === conconants ===

            'd': {
                'dict': 'द्',
                'du.nom': 'दौ',
                'du.acc': 'दौ',
                'du.ins': 'द्भ्याम्',
                'du.dat': 'द्भ्याम्',
                'du.abl': 'द्भ्याम्',
                'du.gen': 'दोः',
                'du.loc': 'दोः',
                'du.voc': 'दौ',
            } ,

            't': {
                'dict': 'त्',
                'du.nom': 'तौ',
                'du.acc': 'तौ',
                'du.ins': 'द्भ्याम्',
                'du.dat': 'द्भ्याम्',
                'du.abl': 'द्भ्याम्',
                'du.gen': 'तोः',
                'du.loc': 'तोः',
                'du.voc': 'तौ',
            } ,

            'm': {
                'dict': 'म्',
                'du.nom': 'मौ',
                'du.acc': 'मौ',
                'du.ins': 'ंभ्याम्', // M
                'du.dat': 'ंभ्याम्',
                'du.abl': 'ंभ्याम्',
                'du.gen': 'मोः',
                'du.loc': 'मोः',
                'du.voc': 'मौ',
            } ,

            'B': {
                'dict': 'भ्',
                'du.nom': 'भौ',
                'du.acc': 'भौ',
                'du.ins': 'ब्भ्याम्',
                'du.dat': 'ब्भ्याम्',
                'du.abl': 'ब्भ्याम्',
                'du.gen': 'भोः',
                'du.loc': 'भोः',
                'du.voc': 'भौ',
            } ,

            'S': {
                'dict': 'श्',
                'du.nom': 'शौ',
                'du.acc': 'शौ',
                'du.ins': 'ड्भ्याम्',
                'du.dat': 'ड्भ्याम्',
                'du.abl': 'ड्भ्याम्',
                'du.gen': 'शोः',
                'du.loc': 'शोः',
                'du.voc': 'शौ',
            } ,

            'T': {
                'dict': '',
                'du.nom': '',
                'du.acc': '',
                'du.ins': '',
                'du.dat': '',
                'du.abl': '',
                'du.gen': '',
                'du.loc': '',
                'du.voc': '',
            } ,

        },
        'pl' : {
            // === PL ===

            'a': {
                'dict': '',
                'pl.nom': 'ाः',
                'pl.acc': 'ान्',
                'pl.ins': 'ैः',
                'pl.dat': 'ेभ्यः',
                'pl.abl': 'ेभ्यः',
                'pl.gen': 'ानाम्-ाणाम्',
                'pl.loc': 'ेषु',
                'pl.voc': 'ाः',
            } ,

            'E': {
                'dict': 'ै',
                'pl.nom': 'ायः',
                'pl.acc': 'ायः',
                'pl.ins': 'ाभिः',
                'pl.dat': 'ाभ्यः',
                'pl.abl': 'ाभ्यः',
                'pl.gen': 'ायाम्',
                'pl.loc': 'ासु',
                'pl.voc': 'ायः',
            } ,

            'an': {
                'dict': 'न्',
                'pl.nom': 'ानः',
                'pl.acc': '्ञः-नः',
                'pl.ins': 'भिः',
                'pl.dat': 'भ्यः',
                'pl.abl': 'भ्यः',
                'pl.gen': '्ञाम्-नाम्',
                'pl.loc': 'सु',
                'pl.voc': 'ानः',
            } ,

            'at': {
                'dict': 'त्',
                'pl.nom': 'न्तः-न्ति',
                'pl.acc': 'तः-न्ति',
                'pl.ins': 'द्भिः',
                'pl.dat': 'द्भ्यः',
                'pl.abl': 'द्भ्यः',
                'pl.gen': 'ताम्',
                'pl.loc': 'त्सु',
                'pl.voc': 'न्तः-न्ति',
            } ,

            'i': {
                'dict': 'ि',
                'pl.nom': 'यः',
                'pl.acc': 'ीन्',
                'pl.ins': 'िभिः',
                'pl.dat': 'िभ्यः',
                'pl.abl': 'िभ्यः',
                'pl.gen': 'ीनाम्',
                'pl.loc': 'िषु',
                'pl.voc': 'यः',
            } ,

            'f': {
                'dict': 'ृ',
                'pl.nom': 'रः-ारः',
                'pl.acc': 'ॄन्',
                'pl.ins': 'ृभिः',
                'pl.dat': 'ृभ्यः',
                'pl.abl': 'ृभ्यः',
                'pl.gen': 'ॄणाम्',
                'pl.loc': 'ृषु',
                'pl.voc': 'रः-ारः',
            } ,

            'u': {
                'dict': 'ु',
                'pl.nom': 'वः',
                'pl.acc': 'ून्',
                'pl.ins': 'ुभिः',
                'pl.dat': 'ुभ्यः',
                'pl.abl': 'ुभ्यः',
                'pl.gen': 'ूणाम्-ूनाम्',
                'pl.loc': 'ुषु',
                'pl.voc': 'वः',
            } ,

            'us': {
                'dict': 'ुस्',
                'pl.nom': 'ुषः',
                'pl.acc': 'ुषः',
                'pl.ins': 'ुर्भिः',
                'pl.dat': 'ुर्भ्यः',
                'pl.abl': 'ुर्भ्यः',
                'pl.gen': 'ुषाम्',
                'pl.loc': 'ुःषु',
                'pl.voc': 'ुषः',
            } ,

            'j': { // palatal
                'dict': 'ज्',
                'pl.nom': 'जः-ञ्जः',
                'pl.acc': 'जः',
                'pl.ins': 'ड्भिः-ग्भिः',
                'pl.dat': 'ड्भ्यः-ग्भ्यः',
                'pl.abl': 'ड्भ्यः-ग्भ्यः',
                'pl.gen': 'जाम्',
                'pl.loc': 'ट्सु-क्षु',
                'pl.voc': 'जः-ञ्जः',
            } ,

            'c': { // palatal
                'dict': 'च्',
                'pl.nom': 'चः',
                'pl.acc': 'चः',
                'pl.ins': 'ग्भिः',
                'pl.dat': 'ग्भ्यः',
                'pl.abl': 'ग्भ्यः',
                'pl.gen': 'चाम्',
                'pl.loc': 'क्षु',
                'pl.voc': 'चः',
            } ,

            'h': { // palatal
                'dict': 'ह्',
                'pl.nom': 'हः',
                'pl.acc': 'हः',
                'pl.ins': 'ड्भिः',
                'pl.dat': 'ड्भ्यः',
                'pl.abl': 'ड्भ्यः',
                'pl.gen': 'हाम्',
                'pl.loc': 'ट्सु',
                'pl.voc': 'हः',
            } ,

            'd': { // cons
                'dict': 'द्',
                'pl.nom': 'दः',
                'pl.acc': 'दः',
                'pl.ins': 'द्भिः',
                'pl.dat': 'द्भ्यः',
                'pl.abl': 'द्भ्यः',
                'pl.gen': 'दाम्',
                'pl.loc': 'त्सु',
                'pl.voc': 'दः',
            } ,

            't': {
                'dict': 'त्',
                'pl.nom': 'तः',
                'pl.acc': 'तः',
                'pl.ins': 'द्भिः',
                'pl.dat': 'द्भ्यः',
                'pl.abl': 'द्भ्यः',
                'pl.gen': 'ताम्',
                'pl.loc': 'त्सु',
                'pl.voc': 'तः',
            } ,

            'm': { // cons
                'dict': 'म्',
                'pl.nom': 'मः',
                'pl.acc': 'मः',
                'pl.ins': 'ंभिः', // M
                'pl.dat': 'ंभ्यः',
                'pl.abl': 'ंभ्यः',
                'pl.gen': 'माम्',
                'pl.loc': 'ंसु',
                'pl.voc': 'मः',
            } ,

            'B': {
                'dict': 'भ्',
                'pl.nom': 'भः',
                'pl.acc': 'भः',
                'pl.ins': 'ब्भिः',
                'pl.dat': 'ब्भ्यः',
                'pl.abl': 'ब्भ्यः',
                'pl.gen': 'भाम्',
                'pl.loc': 'प्सु',
                'pl.voc': 'भः',
            } ,

            'S': {
                'dict': 'श्',
                'pl.nom': 'शः',
                'pl.acc': 'शः',
                'pl.ins': 'ड्भिः',
                'pl.dat': 'ड्भ्यः',
                'pl.abl': 'ड्भ्यः',
                'pl.gen': 'शाम्',
                'pl.loc': 'ट्सु',
                'pl.voc': 'शः',
            } ,

            's': {
                'dict': 'स्',
                'pl.nom': 'सः',
                'pl.acc': 'सः',
                'pl.ins': 'र्भिः',
                'pl.dat': 'र्भ्यः',
                'pl.abl': 'र्भ्यः',
                'pl.gen': 'साम्',
                'pl.loc': 'ःसु',
                'pl.voc': 'सः',
            } ,


            'T': {
                'dict': '',
                'pl.nom': '',
                'pl.acc': '',
                'pl.ins': '',
                'pl.dat': '',
                'pl.abl': '',
                'pl.gen': '',
                'pl.loc': '',
                'pl.voc': '',
            } ,

        },

    },

    'fem': {
        'sg' : {

            'A': {
                'dict': 'ा',
                'sg.nom': 'ा',
                'sg.acc': 'ाम्',
                'sg.ins': 'या',
                'sg.dat': 'ायै',
                'sg.abl': 'ायाः',
                'sg.gen': 'ायाः',
                'sg.loc': 'ायाम्',
                'sg.voc': 'े',
            } ,

            'O': {
                'dict': 'ौ',
                'sg.nom': 'ौः',
                'sg.acc': 'ावम्',
                'sg.ins': 'ावा',
                'sg.dat': 'ावे',
                'sg.abl': 'ावः',
                'sg.gen': 'ावः',
                'sg.loc': 'ावि',
                'sg.voc': 'ौः',
            } ,

            'i': {
                'dict': 'ि',
                'sg.nom': 'िः',
                'sg.acc': 'िम्',
                'sg.ins': '्या',
                'sg.dat': 'ये-्यै',
                'sg.abl': 'ेः-्याः',
                'sg.gen': 'ेः-्याः',
                'sg.loc': 'ौ-्याम्',
                'sg.voc': 'े',
            } ,

            'I': {
                'dict': 'ी',
                'sg.nom': 'ीः',
                'sg.acc': 'ियम्-ीम्',
                'sg.ins': 'िया-्या',
                'sg.dat': 'िये-ियै-्यै',
                'sg.abl': 'ियः-ियाः-्याः',
                'sg.gen': 'ियः-ियाः-्याः',
                'sg.loc': 'ियि-ियाम्-्याम्',
                'sg.voc': 'ीः-ि',
            } ,

            'r': {
                'dict': 'िर्',
                'sg.nom': 'ीः',
                'sg.acc': 'िरम्',
                'sg.ins': 'िरा',
                'sg.dat': 'िरे',
                'sg.abl': 'िरः',
                'sg.gen': 'िरः',
                'sg.loc': 'िरि',
                'sg.voc': 'ीः',
            } ,

            'u': {
                'dict': 'ु',
                'sg.nom': 'ुः',
                'sg.acc': 'ुम्',
                'sg.ins': '्वा',
                'sg.dat': 'वे-्वै',
                'sg.abl': 'ोः-्वाः',
                'sg.gen': 'ोः-्वाः',
                'sg.loc': 'ौ-्वाम्',
                'sg.voc': 'ो',
            } ,

            'U': {
                'dict': 'ू',
                'sg.nom': 'ूः',
                'sg.acc': 'ुवम्-ूम्',
                'sg.ins': 'ुवा-्वा',
                'sg.dat': 'ुवै-ुवे-्वै',
                'sg.abl': 'ुवः-ुवाः-्वाः',
                'sg.gen': 'ुवः-ुवाः-्वाः',
                'sg.loc': 'ुवि-ुवाम्-्वाम्',
                'sg.voc': 'ूः-ु',
            } ,

            // === fem sg consonants ===
            'c': {
                'dict': 'च्',
                'sg.nom': 'क्',
                'sg.acc': 'चम्',
                'sg.ins': 'चा',
                'sg.dat': 'चे',
                'sg.abl': 'चः',
                'sg.gen': 'चः',
                'sg.loc': 'चि',
                'sg.voc': 'क्',
            } ,

            'S': {
                'dict': 'श्',
                'sg.nom': 'क्',
                'sg.acc': 'शम्',
                'sg.ins': 'शा',
                'sg.dat': 'शे',
                'sg.abl': 'शः',
                'sg.gen': 'शः',
                'sg.loc': 'शि',
                'sg.voc': 'क्',
            } ,

            'p': {
                'dict': 'प्',
                'sg.nom': 'प्',
                'sg.acc': 'पम्',
                'sg.ins': 'पा',
                'sg.dat': 'पे',
                'sg.abl': 'पः',
                'sg.gen': 'पः',
                'sg.loc': 'पि',
                'sg.voc': 'प्',
            } ,

            'B': {
                'dict': 'भ्',
                'sg.nom': 'प्',
                'sg.acc': 'भम्',
                'sg.ins': 'भा',
                'sg.dat': 'भे',
                'sg.abl': 'भः',
                'sg.gen': 'भः',
                'sg.loc': 'भि',
                'sg.voc': 'प्',
            } ,

            'h': {
                'dict': 'ह्',
                'sg.nom': 'ट्-क्',
                'sg.acc': 'हम्',
                'sg.ins': 'हा',
                'sg.dat': 'हे',
                'sg.abl': 'हः',
                'sg.gen': 'हः',
                'sg.loc': 'हि',
                'sg.voc': 'ट्-क्',
            } ,

            'T': {
                'dict': '',
                'sg.nom': '',
                'sg.acc': '',
                'sg.ins': '',
                'sg.dat': '',
                'sg.abl': '',
                'sg.gen': '',
                'sg.loc': '',
                'sg.voc': '',
            } ,

        }, // num

        'du' : { // fem

            'A': {
                'dict': 'ा',
                'du.nom': 'े',
                'du.acc': 'े',
                'du.ins': 'ाभ्याम्',
                'du.dat': 'ाभ्याम्',
                'du.abl': 'ाभ्याम्',
                'du.gen': 'योः',
                'du.loc': 'योः',
                'du.voc': 'े',
            } ,

            'O': {
                'dict': 'ौ',
                'du.nom': 'ावौ',
                'du.acc': 'ावौ',
                'du.ins': 'ौभ्याम्',
                'du.dat': 'ौभ्याम्',
                'du.abl': 'ौभ्याम्',
                'du.gen': 'ावोः',
                'du.loc': 'ावोः',
                'du.voc': 'ावौ',
            } ,

            'i': {
                'dict': 'ि',
                'du.nom': 'ी',
                'du.acc': 'ी',
                'du.ins': 'िभ्याम्',
                'du.dat': 'िभ्याम्',
                'du.abl': 'िभ्याम्',
                'du.gen': '्योः',
                'du.loc': '्योः',
                'du.voc': 'ी',
            } ,

            'I': {
                'dict': 'ी',
                'du.nom': 'ियौ-्यौ',
                'du.acc': 'ियौ-्यौ',
                'du.ins': 'ीभ्याम्',
                'du.dat': 'ीभ्याम्',
                'du.abl': 'ीभ्याम्',
                'du.gen': 'ियोः-्योः',
                'du.loc': 'ियोः-्योः',
                'du.voc': 'ियौ-्यौ',
            } ,

            'u': {
                'dict': 'ु',
                'du.nom': 'ू',
                'du.acc': 'ू',
                'du.ins': 'ुभ्याम्',
                'du.dat': 'ुभ्याम्',
                'du.abl': 'ुभ्याम्',
                'du.gen': '्वोः',
                'du.loc': '्वोः',
                'du.voc': 'ू',
            } ,

            'U': {
                'dict': 'ू',
                'du.nom': 'ुवौ-्वौ',
                'du.acc': 'ुवौ-्वौ',
                'du.ins': 'ूभ्याम्',
                'du.dat': 'ूभ्याम्',
                'du.abl': 'ूभ्याम्',
                'du.gen': 'ुवोः-्वोः',
                'du.loc': 'ुवोः-्वोः',
                'du.voc': 'ुवौ-्वौ',
            } ,


            // === consonants du fem ===
            'c': {
                'dict': 'च्',
                'du.nom': 'चौ',
                'du.acc': 'चौ',
                'du.ins': 'ग्भ्याम्',
                'du.dat': 'ग्भ्याम्',
                'du.abl': 'ग्भ्याम्',
                'du.gen': 'चोः',
                'du.loc': 'चोः',
                'du.voc': 'चौ',
            } ,

            'S': {
                'dict': 'श्',
                'du.nom': 'शौ',
                'du.acc': 'शौ',
                'du.ins': 'ग्भ्याम्',
                'du.dat': 'ग्भ्याम्',
                'du.abl': 'ग्भ्याम्',
                'du.gen': 'शोः',
                'du.loc': 'शोः',
                'du.voc': 'शौ',
            } ,

            'p': {
                'dict': 'प्',
                'du.nom': 'पौ',
                'du.acc': 'पौ',
                'du.ins': 'ब्भ्याम्',
                'du.dat': 'ब्भ्याम्',
                'du.abl': 'ब्भ्याम्',
                'du.gen': 'पोः',
                'du.loc': 'पोः',
                'du.voc': 'पौ',
            } ,

            'B': {
                'dict': 'भ्',
                'du.nom': 'भौ',
                'du.acc': 'भौ',
                'du.ins': 'ब्भ्याम्',
                'du.dat': 'ब्भ्याम्',
                'du.abl': 'ब्भ्याम्',
                'du.gen': 'भोः',
                'du.loc': 'भोः',
                'du.voc': 'भौ',
            } ,

            'h': {
                'dict': 'ह्',
                'du.nom': 'हौ',
                'du.acc': 'हौ',
                'du.ins': 'ड्भ्याम्-ग्भ्याम्',
                'du.dat': 'ड्भ्याम्-ग्भ्याम्',
                'du.abl': 'ड्भ्याम्-ग्भ्याम्',
                'du.gen': 'होः',
                'du.loc': 'होः',
                'du.voc': 'हौ',
            } ,

            'ir': {
                'dict': 'िर्',
                'du.nom': 'िरौ',
                'du.acc': 'िरौ',
                'du.ins': 'ीर्भ्याम्',
                'du.dat': 'ीर्भ्याम्',
                'du.abl': 'ीर्भ्याम्',
                'du.gen': 'िरोः',
                'du.loc': 'िरोः',
                'du.voc': 'िरौ',
            } ,

            'T': {
                'dict': '',
                'du.nom': '',
                'du.acc': '',
                'du.ins': '',
                'du.dat': '',
                'du.abl': '',
                'du.gen': '',
                'du.loc': '',
                'du.voc': '',
            } ,
        },

        'pl' : { // fem

            'A': {
                'dict': 'ा',
                'pl.nom': 'ाः',
                'pl.acc': 'ाः',
                'pl.ins': 'ाभिः',
                'pl.dat': 'ाभ्यः',
                'pl.abl': 'ाभ्यः',
                'pl.gen': 'ानाम्',
                'pl.loc': 'ासु',
                'pl.voc': 'ाः',
            } ,

            'O': {
                'dict': 'ौ',
                'pl.nom': 'ावः',
                'pl.acc': 'ावः',
                'pl.ins': 'ौभिः',
                'pl.dat': 'ौभ्यः',
                'pl.abl': 'ौभ्यः',
                'pl.gen': 'ावाम्',
                'pl.loc': 'ौषु',
                'pl.voc': 'ावः',
            } ,

            'i': {
                'dict': 'ि',
                'pl.nom': 'यः',
                'pl.acc': 'ीः',
                'pl.ins': 'िभिः',
                'pl.dat': 'िभ्यः',
                'pl.abl': 'िभ्यः',
                'pl.gen': 'ीनाम्',
                'pl.loc': 'िषु',
                'pl.voc': 'यः',
            } ,

            'I': {
                'dict': 'ी',
                'pl.nom': 'ियः-्यः',
                'pl.acc': 'ियः-ीः',
                'pl.ins': 'ीभिः',
                'pl.dat': 'ीभ्यः',
                'pl.abl': 'ीभ्यः',
                'pl.gen': 'ियाम्-ीनाम्',
                'pl.loc': 'ीषु',
                'pl.voc': 'ियः-्यः',
            } ,

            'ir': {
                'dict': 'िर्',
                'pl.nom': 'िरः',
                'pl.acc': 'िरः',
                'pl.ins': 'ीर्भिः',
                'pl.dat': 'ीर्भ्यः',
                'pl.abl': 'ीर्भ्यः',
                'pl.gen': 'िराम्',
                'pl.loc': 'ीर्षु',
                'pl.voc': 'िरः',
            } ,

            'u': {
                'dict': 'ु',
                'pl.nom': 'वः',
                'pl.acc': 'ूः',
                'pl.ins': 'ुभिः',
                'pl.dat': 'ुभ्यः',
                'pl.abl': 'ुभ्यः',
                'pl.gen': 'ूनाम्',
                'pl.loc': 'ुषु',
                'pl.voc': 'वः',
            } ,

            'U': {
                'dict': 'ू',
                'pl.nom': 'ुवः-्वः',
                'pl.acc': 'ुवः-ूः',
                'pl.ins': 'ूभिः',
                'pl.dat': 'ूभ्यः',
                'pl.abl': 'ूभ्यः',
                'pl.gen': 'ूनाम्-ुवाम्',
                'pl.loc': 'ूषु',
                'pl.voc': 'ुवः-्वः',
            } ,

            // cons fem pl
            'c': {
                'dict': 'च्',
                'pl.nom': 'चः',
                'pl.acc': 'चः',
                'pl.ins': 'ग्भिः',
                'pl.dat': 'ग्भ्यः',
                'pl.abl': 'ग्भ्यः',
                'pl.gen': 'चाम्',
                'pl.loc': 'क्षु',
                'pl.voc': 'चः',
            } ,

            'S': {
                'dict': 'श्',
                'pl.nom': 'शः',
                'pl.acc': 'शः',
                'pl.ins': 'ग्भिः',
                'pl.dat': 'ग्भ्यः',
                'pl.abl': 'ग्भ्यः',
                'pl.gen': 'शाम्',
                'pl.loc': 'क्षु',
                'pl.voc': 'शः',
            } ,

            'p': {
                'dict': 'प्',
                'pl.nom': 'पः',
                'pl.acc': 'पः',
                'pl.ins': 'ब्भिः',
                'pl.dat': 'ब्भ्यः',
                'pl.abl': 'ब्भ्यः',
                'pl.gen': 'पाम्',
                'pl.loc': 'प्सु',
                'pl.voc': 'पः',
            } ,

            'B': {
                'dict': 'भ्',
                'pl.nom': 'भः',
                'pl.acc': 'भः',
                'pl.ins': 'ब्भिः',
                'pl.dat': 'ब्भ्यः',
                'pl.abl': 'ब्भ्यः',
                'pl.gen': 'भाम्',
                'pl.loc': 'प्सु',
                'pl.voc': 'भः',
            } ,

            'h': {
                'dict': 'ह्',
                'pl.nom': 'हः',
                'pl.acc': 'हः',
                'pl.ins': 'ड्भिः-ग्भिः',
                'pl.dat': 'ड्भ्यः-ग्भ्यः',
                'pl.abl': 'ड्भ्यः-ग्भ्यः',
                'pl.gen': 'हाम्',
                'pl.loc': 'ट्सु-क्षु',
                'pl.voc': 'हः',
            } ,

            'T': {
                'dict': '',
                'pl.nom': '',
                'pl.acc': '',
                'pl.ins': '',
                'pl.dat': '',
                'pl.abl': '',
                'pl.gen': '',
                'pl.loc': '',
                'pl.voc': '',
            } ,

        },
    },

    'neut': {
        'sg' : {

            'a': {
                'dict': '',
                'sg.nom': 'म्',
                'sg.acc': 'म्',
                'sg.ins': 'ेन',
                'sg.dat': 'ाय',
                'sg.abl': 'ात्',
                'sg.gen': 'स्य',
                'sg.loc': 'े',
                'sg.voc': '',
            } ,

            'an': {
                'dict': 'न्',
                'sg.nom': '',
                'sg.acc': '',
                'sg.ins': '्ना',
                'sg.dat': '्ने',
                'sg.abl': '्नः',
                'sg.gen': '्नः',
                'sg.loc': 'नि-्नि',
                'sg.voc': 'न्-',
            } ,

            'as': {
                'dict': 'स्',
                'sg.nom': 'ः-ाः',
                'sg.acc': 'ः',
                'sg.ins': 'सा',
                'sg.dat': 'से',
                'sg.abl': 'सः',
                'sg.gen': 'सः',
                'sg.loc': 'सि',
                'sg.voc': 'ः',
            } ,

            'at': {
                'dict': 'त्',
                'sg.nom': 'त्',
                'sg.acc': 'त्',
                'sg.ins': 'ता',
                'sg.dat': 'ते',
                'sg.abl': 'तः',
                'sg.gen': 'तः',
                'sg.loc': 'ति',
                'sg.voc': 'त्',
            } ,

            'i': {
                'dict': '',
                'sg.nom': '',
                'sg.acc': '',
                'sg.ins': 'णा',
                'sg.dat': 'णे',
                'sg.abl': 'णः',
                'sg.gen': 'णः',
                'sg.loc': 'णि',
                'sg.voc': 'े',
            } ,

            'is': {
                'dict': 'िस्',
                'sg.nom': 'िः',
                'sg.acc': 'िः',
                'sg.ins': 'िषा',
                'sg.dat': 'िषे',
                'sg.abl': 'िषः',
                'sg.gen': 'िषः',
                'sg.loc': 'िषि',
                'sg.voc': 'िः',
            } ,

            'r': {
                'dict': 'र्',
                'sg.nom': 'ः',
                'sg.acc': 'ः',
                'sg.ins': 'रा',
                'sg.dat': 'रे',
                'sg.abl': 'रः',
                'sg.gen': 'रः',
                'sg.loc': 'रि',
                'sg.voc': 'ः',
            } ,

            'u': {
                'dict': 'ु',
                'sg.nom': 'ु',
                'sg.acc': 'ु',
                'sg.ins': 'ुना',
                'sg.dat': 'ुने',
                'sg.abl': 'ुनः',
                'sg.gen': 'ुनः',
                'sg.loc': 'ुनि',
                'sg.voc': 'ो',
            } ,

            // === cons == neut.sg ===
            'fd': {
                'dict': 'ृद्',
                'sg.nom': 'ृद्',
                'sg.acc': 'ृद्',
                'sg.ins': 'ृदा',
                'sg.dat': '्र्दे',
                'sg.abl': '्र्दः',
                'sg.gen': '्र्दः',
                'sg.loc': '्र्दि',
                'sg.voc': 'ृद्',
            } ,

            'T': {
                'dict': '',
                'sg.nom': '',
                'sg.acc': '',
                'sg.ins': '',
                'sg.dat': '',
                'sg.abl': '',
                'sg.gen': '',
                'sg.loc': '',
                'sg.voc': '',
            } ,

        }, // num

        'du' : { // neut

            'a': {
                'dict': '',
                'du.nom': 'े',
                'du.acc': 'े',
                'du.ins': 'ाभ्याम्',
                'du.dat': 'ाभ्याम्',
                'du.abl': 'ाभ्याम्',
                'du.gen': 'योः',
                'du.loc': 'योः',
                'du.voc': 'े',
            } ,

            'an': {
                'dict': 'न्',
                'du.nom': 'नी-्नी',
                'du.acc': 'नी-्नी',
                'du.ins': 'भ्याम्',
                'du.dat': 'भ्याम्',
                'du.abl': 'भ्याम्',
                'du.gen': '्नोः',
                'du.loc': '्नोः',
                'du.voc': 'नी-्नी',
            } ,

            'as': {
                'dict': 'स्',
                'du.nom': 'सी-सौ',
                'du.acc': 'सी-सौ',
                'du.ins': 'ोभ्याम्',
                'du.dat': 'ोभ्याम्',
                'du.abl': 'ोभ्याम्',
                'du.gen': 'सोः',
                'du.loc': 'सोः',
                'du.voc': 'सी-सौ',
            } ,

            'at': {
                'dict': 'त्',
                'du.nom': 'ती',
                'du.acc': 'ती',
                'du.ins': 'द्भ्याम्',
                'du.dat': 'द्भ्याम्',
                'du.abl': 'द्भ्याम्',
                'du.gen': 'तोः',
                'du.loc': 'तोः',
                'du.voc': 'ती',
            } ,

            'i': {
                'dict': 'ि',
                'du.nom': 'िणी',
                'du.acc': 'िणी',
                'du.ins': 'िभ्याम्',
                'du.dat': 'िभ्याम्',
                'du.abl': 'िभ्याम्',
                'du.gen': 'िणोः',
                'du.loc': 'िणोः',
                'du.voc': 'िणी',
            } ,

            'is': {
                'dict': 'िस्',
                'du.nom': 'िषी',
                'du.acc': 'िषी',
                'du.ins': 'िर्भ्याम्',
                'du.dat': 'िर्भ्याम्',
                'du.abl': 'िर्भ्याम्',
                'du.gen': 'िषोः',
                'du.loc': 'िषोः',
                'du.voc': 'िषी',
            } ,

            'r': {
                'dict': 'र्',
                'du.nom': 'री',
                'du.acc': 'री',
                'du.ins': 'र्भ्याम्',
                'du.dat': 'र्भ्याम्',
                'du.abl': 'र्भ्याम्',
                'du.gen': 'रोः',
                'du.loc': 'रोः',
                'du.voc': 'री',
            } ,

            'u': {
                'dict': 'ु',
                'du.nom': 'ुनी',
                'du.acc': 'ुनी',
                'du.ins': 'ुभ्याम्',
                'du.dat': 'ुभ्याम्',
                'du.abl': 'ुभ्याम्',
                'du.gen': 'ुनोः',
                'du.loc': 'ुनोः',
                'du.voc': 'ुनी',
            } ,

            // === cons == du  neut ==
            'fd': {
                'dict': 'ृद्',
                'du.nom': 'ृद्',
                'du.acc': 'ृद्',
                'du.ins': 'ृद्भ्याम्',
                'du.dat': '्र्द्भ्याम्',
                'du.abl': '्र्द्भ्याम्',
                'du.gen': '्र्दोः',
                'du.loc': '्र्दोः',
                'du.voc': 'ृद्',
            } ,

            'T': {
                'dict': '',
                'du.nom': '',
                'du.acc': '',
                'du.ins': '',
                'du.dat': '',
                'du.abl': '',
                'du.gen': '',
                'du.loc': '',
                'du.voc': '',
            } ,

        }, // num
        'pl' : { // neut

            'a': {
                'dict': '',
                'pl.nom': 'ानि',
                'pl.acc': 'ानि',
                'pl.ins': 'ैः',
                'pl.dat': 'ेभ्यः',
                'pl.abl': 'ेभ्यः',
                'pl.gen': 'ानाम्',
                'pl.loc': 'ेषु',
                'pl.voc': 'ानि',
            } ,

            'an': {
                'dict': 'न्',
                'pl.nom': 'ानि',
                'pl.acc': 'ानि',
                'pl.ins': 'भिः',
                'pl.dat': 'भ्यः',
                'pl.abl': 'भ्यः',
                'pl.gen': '्नाम्',
                'pl.loc': 'सु',
                'pl.voc': 'ानि',
            } ,

            'as': {
                'dict': 'स्',
                'pl.nom': 'ांसि-सः',
                'pl.acc': 'ांसि-सः',
                'pl.ins': 'ोभिः',
                'pl.dat': 'ोभ्यः',
                'pl.abl': 'ोभ्यः',
                'pl.gen': 'साम्',
                'pl.loc': 'ःसु',
                'pl.voc': 'ांसि-सः',
            } ,

            'at': {
                'dict': 'त्',
                'pl.nom': 'न्ति',
                'pl.acc': 'न्ति',
                'pl.ins': 'द्भिः',
                'pl.dat': 'द्भ्यः',
                'pl.abl': 'द्भ्यः',
                'pl.gen': 'ताम्',
                'pl.loc': 'त्सु',
                'pl.voc': 'न्ति',
            } ,

            'i': {
                'dict': 'ि',
                'pl.nom': 'ीणि',
                'pl.acc': 'ीणि',
                'pl.ins': 'िभिः',
                'pl.dat': 'िभ्यः',
                'pl.abl': 'िभ्यः',
                'pl.gen': 'ीणाम्',
                'pl.loc': 'िषु',
                'pl.voc': 'ीणि',
            } ,

            'is': {
                'dict': 'िस्',
                'pl.nom': 'ींषि',
                'pl.acc': 'ींषि',
                'pl.ins': 'िर्भिः',
                'pl.dat': 'िर्भ्यः',
                'pl.abl': 'िर्भ्यः',
                'pl.gen': 'िषाम्',
                'pl.loc': 'िःषु',
                'pl.voc': 'ींषि',
            } ,

            'r': {
                'dict': 'र्',
                'pl.nom': 'रि',
                'pl.acc': 'रि',
                'pl.ins': 'र्भिः',
                'pl.dat': 'र्भ्यः',
                'pl.abl': 'र्भ्यः',
                'pl.gen': 'राम्',
                'pl.loc': 'र्षु',
                'pl.voc': 'रि',
            } ,

            'u': {
                'dict': 'ु',
                'pl.nom': 'ूनि',
                'pl.acc': 'ूनि',
                'pl.ins': 'ुभिः',
                'pl.dat': 'ुभ्यः',
                'pl.abl': 'ुभ्यः',
                'pl.gen': 'ूनाम्',
                'pl.loc': 'ुषु',
                'pl.voc': 'ूनि',
            } ,

            // cons neut
            'fd': {
                'dict': 'ृद्',
                'pl.nom': 'ृद्',
                'pl.acc': 'ृदः',
                'pl.ins': '्र्द्भिः',
                'pl.dat': '्र्द्भ्यः',
                'pl.abl': '्र्द्भ्यः',
                'pl.gen': '्र्दाम्',
                'pl.loc': '्र्त्सु',
                'pl.voc': 'ृद्',
            } ,

            'T': {
                'dict': '',
                'pl.nom': '',
                'pl.acc': '',
                'pl.ins': '',
                'pl.dat': '',
                'pl.abl': '',
                'pl.gen': '',
                'pl.loc': '',
                'pl.voc': '',
            } ,


        }, // num
    }, // gend
}


module.exports = Const;

function log() { console.log.apply(console, arguments) }
