// наборы tins для /bin/jnu2stem

// перенести в utils
var c = {};
c.laN = 'लङ्';

// var tipnames = ['तिप्', 'तस्', 'झि', 'सिप्', 'थस्', 'थ', 'मिप्', 'वस्', 'मस्', 'त', 'आताम्', 'झ', 'थास्', 'आथाम्', 'ध्वम्', 'इट्', 'वहि', 'महिङ्'];
// '{"0":["ति"],"1":["तः"],"2":["न्ति"],"3":["सि"],"4":["थः"],"5":["थ"],"6":["ामि"],"7":["ावः"],"8":["ामः"]}'
var tins = {
    'लट्': {
        'परस्मै': ['["ति","तः","न्ति","सि","थः","थ","ामि","ावः","ामः"]'],
        'आत्मने': ['["ते","ेते","न्ते","से","ेथे","ध्वे","े","ावहे","ामहे"]']},
    'लङ्': {
        'परस्मै': [],
        'आत्मने': []},
    'लिट्': {
        'परस्मै': [],
        'आत्मने': []},
    'लुङ्': {
        'परस्मै': [],
        'आत्मने': []}
    // 'templ': {
    // 'परस्मै': [],
    // 'आत्मने': []},
}

exports = module.exports = tins;
