//

var vriksha =
    { 'भ्वादिगण':
      {  'लट्':
         { 'परस्मै':
           { 'sg.3': [ 2, 'ति' ],
             'sg.2': [ 2, 'सि' ],
             'sg.1': [ 3, 'ामि' ],
             'du.3': [ 2, 'तः' ],
             'du.2': [ 2, 'थः' ],
             'du.1': [ 3, 'ावः' ],
             'pl.3': [ 4, 'न्ति' ],
             'pl.2': [ 1, 'थ' ],
             'pl.1': [ 3, 'ामः' ] },
           'आत्मने':
           { 'sg.3': [ 2, 'ते' ],
             'sg.2': [ 2, 'से' ],
             'sg.1': [ 1, 'े' ],
             'du.3': [ 3, 'ेते' ],
             'du.2': [ 3, 'ेथे' ],
             'du.1': [ 4, 'ावहे' ],
             'pl.3': [ 4, 'न्ते' ],
             'pl.2': [ 4, 'ध्वे' ],
             'pl.1': [ 4, 'ामहे' ] }
         }
      },
      'अदादिगण':
      {  'लट्':
         { 'परस्मै':
           { 'sg.3': [ 2, 'धि', 'ति'  ],
             'sg.2': [ 2, 'षि', 'सि' ],
             'sg.1': [ 2, 'मि' ],
             'du.3': [ 2, 'धः', 'तः'],
             'du.2': [ 2,  'धः', 'थः'],
             'du.1': [ 2, 'वः' ],
             'pl.3': [ 4, 'न्ति' ],
             'pl.2': [ 1, 'ध', 'थ' ],
             'pl.1': [ 2, 'मः' ] },
           'आत्मने':
           { 'sg.3': [ 2, 'धे', 'ते', 'टे' ],
             'sg.2': [ 2, 'षे', 'से' ],
             'sg.1': [ 1, 'े' ],
             'du.3': [ 3, 'ाते' ],
             'du.2': [ 3, 'ाथे' ],
             'du.1': [ 3, 'वहे' ],
             'pl.3': [ 2, 'ते' ],
             'pl.2': [ 4, 'ध्वे' ],
             'pl.1': [ 3, 'महे' ] }
         }
      },

    }


exports = module.exports = vriksha;
