//

var vriksha =
    { 'भ्वादिगण':
      {  'लट्':
         { 'परस्मै':
           { 'sg.3': [ 2, 'ति' ],
             'sg.2': [ 2, 'सि' ],
             'sg.1': [ 3, 'ामि' ],
             'du.3': [ 2, 'तः' ],
             'du.2': [ 2, 'थः' ],
             'du.1': [ 3, 'ावः' ],
             'pl.3': [ 4, 'न्ति' ],
             'pl.2': [ 1, 'थ' ],
             'pl.1': [ 3, 'ामः' ] },
           'आत्मने':
           { 'sg.3': [ 2, 'ते' ],
             'sg.2': [ 2, 'से' ],
             'sg.1': [ 1, 'े' ],
             'du.3': [ 3, 'ेते' ],
             'du.2': [ 3, 'ेथे' ],
             'du.1': [ 4, 'ावहे' ],
             'pl.3': [ 4, 'न्ते' ],
             'pl.2': [ 4, 'ध्वे' ],
             'pl.1': [ 4, 'ामहे' ] }
         },
         'लोट्': // low 1
         { 'परस्मै':
           { 'sg.3': [ 2, 'तु' ],
             'sg.2': [ 0, '' ],
             'sg.1': [ 3, 'ानि', 'ाणि' ],
             'du.3': [ 4, 'ताम्' ],
             'du.2': [ 3, 'तम्' ],
             'du.1': [ 2, 'ाव' ],
             'pl.3': [ 4, 'न्तु' ],
             'pl.2': [ 1, 'त' ],
             'pl.1': [ 2, 'ाम' ] },
           'आत्मने':
           { 'sg.3': [ 4, 'ताम्' ],
             'sg.2': [ 3, 'स्व' ],
             'sg.1': [ 1, 'ै' ],
             'du.3': [ 5, 'ेताम्', 'ाताम्' ],
             'du.2': [ 5, 'ेथाम्', 'ाथाम्' ],
             'du.1': [ 4, 'ावहै' ],
             'pl.3': [ 6, 'न्ताम्' ],
             'pl.2': [ 5, 'ध्वम्' ],
             'pl.1': [ 4, 'ामहै' ] }
         },
         'लङ्': // laN 1
         { 'परस्मै':
           { 'sg.3': [ 2, 'त्' ],
             'sg.2': [ 1, 'ः' ],
             'sg.1': [ 2, 'म्' ],
             'du.3': [ 4, 'ताम्' ],
             'du.2': [ 3, 'तम्' ],
             'du.1': [ 2, 'ाव' ],
             'pl.3': [ 2, 'न्' ],
             'pl.2': [ 1, 'त' ],
             'pl.1': [ 2, 'ाम' ] },
           'आत्मने':
           { 'sg.3': [ 1, 'त' ],
             'sg.2': [ 3, 'थाः' ],
             'sg.1': [ 1, 'े' ],
             'du.3': [ 4, 'ताम्' ], // всего 3 значения если 5
             'du.2': [ 5, 'ेथाम्' ],
             'du.1': [ 4, 'ावहि' ],
             'pl.3': [ 3, 'न्त' ],
             'pl.2': [ 5, 'ध्वम्' ],
             'pl.1': [ 4, 'ामहि' ] }
         },

         'विधिलिङ्': // viDiliN 1
         { 'परस्मै':
           { 'sg.3': [ 3, 'ेत्', 'ात्' ], //
             'sg.2': [ 2,  'ेः', 'ाः' ],
             'sg.1': [ 3, 'यम्', 'ाम्' ],
             'du.3': [ 5, 'ेताम्', 'ाताम्' ],
             'du.2': [ 4, 'ेतम्', 'ातम्' ],
             'du.1': [ 2, 'ेव', 'ाव' ],
             'pl.3': [ 4, 'ेयुः', '्युः', 'ुयुः' ],
             'pl.2': [ 2, 'ेत', 'ात' ],
             'pl.1': [ 2,  'ेम', 'ाम'  ] }, // два исключения, pA и डुपचष् - qupacaz - पचति, etc
           'आत्मने':
           { 'sg.3': [ 2, 'ेत' ], // здесь e есть всегда, прокладка внутри
             'sg.2': [ 4, 'ेथाः' ],
             'sg.1': [ 2, 'ेय' ],
             // разные длины: e----taam
             'du.3': [ 7, 'ेयाताम्', 'एजेताम्', 'नयेताम्', '्पेताम्' ], // прокладка yaa -  'ेयाताम्', 'एजेताम्', 'नयेताम्', '्पेताम्' == разные длины, в зависимости от e-yaa-taam
             'du.2': [ 7, 'ेयाथाम्', 'हेयथाम्', '्पेथाम्' ], //  'ेयाथाम्', 'हेयथाम्', '्पेथाम्' - то же
             'du.1': [ 4, 'ेवहि' ],
             'pl.3': [ 4, 'ेरन्' ],
             'pl.2': [ 5, 'ध्वम्' ], // 'यध्वम्', 'ेध्वम्' // прокл. только ya и e
             'pl.1': [ 4, 'ेमहि' ] }
         },

         'लिट्': // liw 1
         { 'परस्मै':
           { 'sg.3': [ 0, '' ],
             'sg.2': [ 1, 'थ' ], // прокладка в зависимости от гласной корня, всего 5 вариантов
             'sg.1': [ 0, '' ],
             'du.3': [ 3, 'तुः' ],
             'du.2': [ 3, 'थुः' ],
             'du.1': [ 1, 'व' ], // ==
             'pl.3': [ 2, 'ुः' ],
             'pl.2': [ 0, '' ],
             'pl.1': [ 1, 'म' ] }, // ==
           'आत्मने':
           { 'sg.3': [ 1, 'े' ],
             'sg.2': [ 2, 'षे' ], // ==
             'sg.1': [ 1, 'े' ],
             'du.3': [ 2, 'ते' ], // ==
             'du.2': [ 3, 'ाथे' ],
             'du.1': [ 3, 'वहे' ],
             'pl.3': [ 2, 'रे' ],
             'pl.2': [ 4, 'ढ्वे', 'ध्वे' ],
             'pl.1': [ 3, 'महे' ] }
         },

         'लुट्': // luw 1
         { 'परस्मै':
           { 'sg.3': [ 2, 'ता', 'ढा', 'टा', 'धा' ],
             'sg.2': [ 4, 'तासि', 'ढासि', 'टासि', 'धासि' ],
             'sg.1': [ 6, 'तास्मि', 'ढास्मि', 'टास्मि', 'धास्मि' ],
             'du.3': [ 4, 'तारौ', 'ढारौ', 'टारौ', 'धारौ' ],
             'du.2': [ 6, 'तास्थः', 'मिस्थः', 'ढास्थः', 'टास्थः', 'धास्थः' ],
             'du.1': [ 6, 'तास्वः', 'ढास्वः', 'टास्वः', 'धास्वः' ],
             'pl.3': [ 4, 'तारः', 'ढारः', 'टारः', 'धारः' ],
             'pl.2': [ 5, 'तास्थ', 'ढास्थ', 'टास्थ', 'धास्थ' ],
             'pl.1': [ 6, 'तास्मः', 'ढास्मः', 'टास्मः', 'धास्मः' ] },
           'आत्मने':
           { 'sg.3': [ 2, 'ता', 'ढा', 'टा', 'धा' ],
             'sg.2': [ 4, 'तासे', 'ढासे', 'टासे', 'धासे' ],
             'sg.1': [ 4, 'ताहे', 'राहे', 'ढाहे', 'टाहे', 'धाहे', 'तासे' ],
             'du.3': [ 4, 'तारौ', 'ढारौ', 'टारौ', 'धारौ' ],
             'du.2': [ 6, 'तासाथे', 'ढासाथे', 'टासाथे', 'धासाथे' ],
             'du.1': [ 7, 'तास्वहे', 'ढास्वहे', 'टास्वहे', 'धास्वहे' ],
             'pl.3': [ 4, 'तारः', 'ढारः', 'टारः', 'धारः' ],
             'pl.2': [ 6, 'ताध्वे', 'ढाध्वे', 'टाध्वे', 'धाध्वे' ],
             'pl.1': [ 7, 'तास्महे', 'ढास्महे', 'टास्महे', 'धास्महे' ] }
         },

         'ऌट्': // xw 1
         { 'परस्मै':
           { 'sg.3': [ 5, 'ष्यति', 'स्यति' ],
             'sg.2': [ 5, 'ष्यसि', 'स्यसि' ],
             'sg.1': [ 6, 'ष्यामि', 'स्यामि' ],
             'du.3': [ 5, 'ष्यतः', 'स्यतः' ],
             'du.2': [ 5, 'ष्यथः', 'स्यथः' ],
             'du.1': [ 6, 'ष्यावः', 'स्यावः' ],
             'pl.3': [ 7, 'ष्यन्ति', 'स्यन्ति' ],
             'pl.2': [ 4, 'ष्यथ', 'स्यथ' ],
             'pl.1': [ 6, 'ष्यामः', 'स्यामः' ] },
           'आत्मने':
           { 'sg.3': [ 5, 'ष्यते', 'स्यते' ],
             'sg.2': [ 5, 'ष्यसे', 'स्यसे' ],
             'sg.1': [ 4, 'ष्ये', 'स्ये' ],
             'du.3': [ 6, 'ष्येते', 'स्येते' ],
             'du.2': [ 6, 'ष्येथे', 'स्येथे' ],
             'du.1': [ 7, 'ष्यावहे', 'स्यावहे' ],
             'pl.3': [ 7, 'ष्यन्ते', 'स्यन्ते' ],
             'pl.2': [ 7, 'ष्यध्वे', 'स्यध्वे' ],
             'pl.1': [ 7, 'ष्यामहे', 'स्यामहे' ] }
         },

      },

      // gana 2
      'अदादिगण':
      {  'लट्':
         { 'परस्मै':
           { 'sg.3': [ 2, 'धि', 'ति'  ],
             'sg.2': [ 2, 'षि', 'सि' ],
             'sg.1': [ 2, 'मि' ],
             'du.3': [ 2, 'धः', 'तः'],
             'du.2': [ 2,  'धः', 'थः'],
             'du.1': [ 2, 'वः' ],
             'pl.3': [ 4, 'न्ति' ],
             'pl.2': [ 1, 'ध', 'थ' ],
             'pl.1': [ 2, 'मः' ] },
           'आत्मने':
           { 'sg.3': [ 2, 'धे', 'ते', 'टे' ],
             'sg.2': [ 2, 'षे', 'से' ],
             'sg.1': [ 1, 'े' ],
             'du.3': [ 3, 'ाते' ],
             'du.2': [ 3, 'ाथे' ],
             'du.1': [ 3, 'वहे' ],
             'pl.3': [ 2, 'ते' ],
             'pl.2': [ 4, 'ध्वे' ],
             'pl.1': [ 3, 'महे' ] }
         }
      },

    }


exports = module.exports = vriksha;
