//

var vriksha =
    { 'भ्वादिगण':
      {  'लट्':
         { 'परस्मै':
           { 'sg.3': [ 2, 'ति' ],
             'sg.2': [ 2, 'सि' ],
             'sg.1': [ 3, 'ामि' ],
             'du.3': [ 2, 'तः' ],
             'du.2': [ 2, 'थः' ],
             'du.1': [ 3, 'ावः' ],
             'pl.3': [ 4, 'न्ति' ],
             'pl.2': [ 1, 'थ' ],
             'pl.1': [ 3, 'ामः' ] },
           'आत्मने':
           { 'sg.3': [ 2, 'ते' ],
             'sg.2': [ 2, 'से' ],
             'sg.1': [ 1, 'े' ],
             'du.3': [ 3, 'ेते' ],
             'du.2': [ 3, 'ेथे' ],
             'du.1': [ 4, 'ावहे' ],
             'pl.3': [ 4, 'न्ते' ],
             'pl.2': [ 4, 'ध्वे' ],
             'pl.1': [ 4, 'ामहे' ] }
         },
         'लोट्': // low 1
         { 'परस्मै':
           { 'sg.3': [ 2, 'तु' ],
             'sg.2': [ 0, '' ],
             'sg.1': [ 3, 'ानि', 'ाणि' ],
             'du.3': [ 4, 'ताम्' ],
             'du.2': [ 3, 'तम्' ],
             'du.1': [ 2, 'ाव' ],
             'pl.3': [ 4, 'न्तु' ],
             'pl.2': [ 1, 'त' ],
             'pl.1': [ 2, 'ाम' ] },
           'आत्मने':
           { 'sg.3': [ 4, 'ताम्' ],
             'sg.2': [ 3, 'स्व' ],
             'sg.1': [ 1, 'ै' ],
             'du.3': [ 5, 'ेताम्', 'ाताम्' ],
             'du.2': [ 5, 'ेथाम्', 'ाथाम्' ],
             'du.1': [ 4, 'ावहै' ],
             'pl.3': [ 6, 'न्ताम्' ],
             'pl.2': [ 5, 'ध्वम्' ],
             'pl.1': [ 4, 'ामहै' ] }
         },
         'लङ्': // laN 1
         { 'परस्मै':
           { 'sg.3': [ 2, 'तु' ],
             'sg.2': [ 0, '' ],
             'sg.1': [ 3, 'ानि', 'ाणि' ],
             'du.3': [ 4, 'ताम्' ],
             'du.2': [ 3, 'तम्' ],
             'du.1': [ 2, 'ाव' ],
             'pl.3': [ 4, 'न्तु' ],
             'pl.2': [ 1, 'त' ],
             'pl.1': [ 2, 'ाम' ] },
           'आत्मने':
           { 'sg.3': [ 4, 'ताम्' ],
             'sg.2': [ 3, 'स्व' ],
             'sg.1': [ 1, 'ै' ],
             'du.3': [ 5, 'ेताम्', 'ाताम्' ],
             'du.2': [ 5, 'ेथाम्', 'ाथाम्' ],
             'du.1': [ 4, 'ावहै' ],
             'pl.3': [ 6, 'न्ताम्' ],
             'pl.2': [ 5, 'ध्वम्' ],
             'pl.1': [ 4, 'ामहै' ] }
         },

      },
      'अदादिगण':
      {  'लट्':
         { 'परस्मै':
           { 'sg.3': [ 2, 'धि', 'ति'  ],
             'sg.2': [ 2, 'षि', 'सि' ],
             'sg.1': [ 2, 'मि' ],
             'du.3': [ 2, 'धः', 'तः'],
             'du.2': [ 2,  'धः', 'थः'],
             'du.1': [ 2, 'वः' ],
             'pl.3': [ 4, 'न्ति' ],
             'pl.2': [ 1, 'ध', 'थ' ],
             'pl.1': [ 2, 'मः' ] },
           'आत्मने':
           { 'sg.3': [ 2, 'धे', 'ते', 'टे' ],
             'sg.2': [ 2, 'षे', 'से' ],
             'sg.1': [ 1, 'े' ],
             'du.3': [ 3, 'ाते' ],
             'du.2': [ 3, 'ाथे' ],
             'du.1': [ 3, 'वहे' ],
             'pl.3': [ 2, 'ते' ],
             'pl.2': [ 4, 'ध्वे' ],
             'pl.1': [ 3, 'महे' ] }
         }
      },

    }


exports = module.exports = vriksha;
