// sg3, du3, pl3, sg2, du2, pl2, sg1, du1, pl1
// first - 14610, second - 235789

// перенести в utils
var c = {};
c.laN = 'लङ्';

// правила для фильтров в comm: A-14610, B-235789

var tins = {
    'लट्': {
        par: ['ति', 'तः', 'न्ति_अन्ति-अति', 'सि', 'थः', 'थ', 'मि', 'वः', 'मः'],
        atm: ['ते', 'एते', 'अन्ते', 'से', 'एथे', 'ध्वे', 'ए', 'वहे', 'महे'] // du.3=इते-अते  ; pl.2=अते- ; du.2=इथे-अथे ; sg.1=इ- ;
    }, // शृणोषि
    'लङ्': {
        par: ['त्-द्', 'ताम्', 'अन्-उः', 'ः_स्', 'तम्', 'त', 'अम्', 'व', 'म'],
        atm: ['त', 'एताम्_इताम्', 'अन्त', 'थाः', 'एथाम्_इथाम्', 'ध्वम्', 'ए_इ', 'वहि', 'महि']
    },
    la: {
        par: ['', '', '', '', '', '', '', '', ''], //
        atm: ['', '', '', '', '', '', '', '', '']
    },
}

// м.б., A:-B: ? не хочется разбирать каждый раз. А, ставить пометку при записи в кеш?
// и, скажем, _ при A-B; и - при вариантах сандхи?
// а, и можно записывать с полной гласной, ее видно, а при записи в кеш - ставить флаг?
// есть! ite-Ate ; => две записи, уже с лигами, и пометка gana: A, gana:B для gana


exports = module.exports = tins;

/*
  thema - совсем убрать, преверять отличия в фильтрах
  law: {}
  laN: {}

  а затем, спец. скпиптом - преобразовать в форму
  [
  {'त्': { gana, pada, thema, } }
  ]

*/

// 1. लट् (law): वर्तमानः Present Tense =
//     2. लोट् (low): आज्ञार्थः Imperative (exclusively for giving blessings or benedictions)
// 3. लङ् (laN): अनद्यतनभूतः Imperfect (past tense) =
//     4. लिङ् (liN): विध्यर्थः Potential Mood -  विधिलिङ् -- Potential mood
// 5. लिट् (liw): परोक्षभूतः Perfect (past tense) =
//     6. लुट् (luw): अनद्यतनभविष्यन् 1st Future = (likely)
// 7. लृट् (xw): भविष्यन् 2nd Future = (certain)
// 8. आशीर्लिङ् (ASIrliN): आशीरर्थः Benedictive Mood
// 9. लुङ् (luN): भूतः Aorist (past tense) =
//     10. लृङ् (XN): संकेतार्थः Conditional Mood
// 11. One more Lakara is known to be seen in Vedic texts. It is known as लेट् - imperative
