// sg3, du3, pl3, sg2, du2, pl2, sg1, du1, pl1
// first - 14610, second - 235789

// перенести в utils
var c = {};
c.laN = 'लङ्';

// правила для фильтров в comm: A-14610, B-235789

// var tipnames = ['तिप्', 'तस्', 'झि', 'सिप्', 'थस्', 'थ', 'मिप्', 'वस्', 'मस्', 'त', 'आताम्', 'झ', 'थास्', 'आथाम्', 'ध्वम्', 'इट्', 'वहि', 'महिङ्'];
var tins = {
    'लट्': {'तिप्': 'ति', 'तस्': 'तः', 'झि': 'न्ति_अन्ति-अति', 'सिप्': 'सि-षि', 'थस्': 'थः', 'थ': 'थ', 'मिप्': 'मि', 'वस्': 'वः', 'मस्': 'मः', 'त': 'ते', 'आताम्': 'एते', 'झ': 'अन्ते', 'थास्': 'से', 'आथाम्': 'एथे', 'ध्वम्': 'ध्वे', 'इट्': 'ए', 'वहि': 'वहे', 'महिङ्': 'महे'},
    'लङ्': {'तिप्': 'त्-द्', 'तस्': 'ताम्', 'झि': 'अन्-उः', 'सिप्': 'ः', 'थस्': 'तम्', 'थ': 'त', 'मिप्': 'अम्', 'वस्': 'व', 'मस्': 'म', 'त': 'त', 'आताम्': 'एताम्_इताम्', 'झ': 'अन्त', 'थास्': 'थाः', 'आथाम्': 'एथाम्_इथाम्', 'ध्वम्': 'ध्वम्', 'इट्': 'ए_इ', 'वहि': 'वहि-वहे', 'महिङ्': 'महि-महे'},
    // 'लिट्': {'तिप्': 'अ', 'तस्': 'अतुः', 'झि': 'उः', 'सिप्': 'थ', 'थस्': 'अथुः', 'थ': 'अ', 'मिप्': 'अ', 'वस्': 'इव', 'मस्': 'इम', 'त': 'ए', 'आताम्': 'आते', 'झ': 'इरे', 'थास्': 'इसे-इषे', 'आथाम्': 'आथे', 'ध्वम्': 'इध्वे-इढ्वे', 'इट्': 'ए', 'वहि': 'इवहे', 'महिङ्': 'इमहे'}
    // без i в окончаниях
    'लिट्': {'तिप्': 'अ', 'तस्': 'अतुः', 'झि': 'उः', 'सिप्': 'थ', 'थस्': 'अथुः', 'थ': 'अ', 'मिप्': 'अ', 'वस्': 'व', 'मस्': 'म', 'त': 'ए', 'आताम्': 'आते', 'झ': 'इरे', 'थास्': 'से-षे', 'आथाम्': 'आथे', 'ध्वम्': 'ध्वे-ढ्वे', 'इट्': 'ए', 'वहि': 'वहे', 'महिङ्': 'महे'},
    'लुङ्': {'तिप्': 'त्', 'तस्': 'ताम्-इष्टाम्', 'झि': 'अन्-सुः-इषुः-सिषुः', 'सिप्': 'ः-षः', 'थस्': 'तम्-ष्टम्', 'थ': 'त-ष्ट', 'मिप्': 'अम्-षम्', 'वस्': 'व', 'मस्': 'म', 'त': 'त-स्त-इष्ट-सत', 'आताम्': 'इताम्-साताम्-इषाताम्-साताम्', 'झ': 'अन्त-सत-इषत-सन्त', 'थास्': 'थाः-स्थाः-इष्ठाः-सथाः', 'आथाम्': 'इथाम्-साथाम्-इषाथाम्', 'ध्वम्': 'ध्वम्', 'इट्': 'इ-इष', 'वहि': 'वहि', 'महिङ्': 'महि'}
    // 'lala': {'तिप्': '', 'तस्': '', 'झि': '', 'सिप्': '', 'थस्': '', 'थ': '', 'मिप्': '', 'वस्': '', 'मस्': '', 'त': '', 'आताम्': '', 'झ': '', 'थास्': '', 'आथाम्': '', 'ध्वम्': '', 'इट्': '', 'वहि': '', 'महिङ्': ''},
}

// लिट्
// एकवचनम् द्विवचनम् बहुवचनम्
// प्रथमपुरुषः  बभामे   बभामाते   बभामिरे
// मध्यमपुरुषः बभामिषे  बभामाथे  बभामिध्वे
// उत्तमपुरुषः  बभामे  बभामिवहे  बभामिमहे


exports = module.exports = tins;


// 1. लट् (law): वर्तमानः Present Tense =
//     2. लोट् (low): आज्ञार्थः Imperative (exclusively for giving blessings or benedictions)
// 3. लङ् (laN): अनद्यतनभूतः Imperfect (past tense) =
//     4. लिङ् (liN): विध्यर्थः Potential Mood -  विधिलिङ् -- Potential mood
// 5. लिट् (liw): परोक्षभूतः Perfect (past tense) =
//     6. लुट् (luw): अनद्यतनभविष्यन् 1st Future = (likely)
// 7. लृट् (xw): भविष्यन् 2nd Future = (certain)
// 8. आशीर्लिङ् (ASIrliN): आशीरर्थः Benedictive Mood
// 9. लुङ् (luN): भूतः Aorist (past tense) =
//     10. लृङ् (XN): संकेतार्थः Conditional Mood
// 11. One more Lakara is known to be seen in Vedic texts. It is known as लेट् - imperative
