// sg3, du3, pl3, sg2, du2, pl2, sg1, du1, pl1
// first - 14610, second - 235789

// перенести в utils
var c = {};
c.laN = 'लङ्';

var laN = {
    first: {
        'परस्मै': ['त्', 'ताम्', 'अन्', 'स्', 'तम्', 'त', 'अम्', 'व', 'म'],
        'आत्मने': ['त', 'इताम्', 'अन्त', 'थाः', 'इथाम्', 'ध्वम्', 'इ', 'वहि', 'महि']
    },
    second: {
        'परस्मै': ['', '', '', '', '', '', '', '', ''],
        'आत्मने': ['', '', '', '', '', '', '', '', '']
    },
}

// правила для фильтров в comm: A-14610, B-235789

var tins = {
    law: {
        p: ['ति', 'तः', 'न्ति', 'सि', 'थः', 'थ', 'मि', 'वः', 'मः'], // pl.3: anti
        a: ['ते', 'ते', 'न्ते-न्ते', 'से', 'थे', 'इथेध्वे', 'ि-े', 'वहे', 'महे'] // du.3 ite-Ate ; pl.3: ate-ante ; du.2: iTe-ATe ; sg.1: i-e ;
    },
    laN: {
        p: ['त्-द्', 'ताम्', 'न्-उः', 'स्', 'तम्', 'त', 'म्', 'व', 'म'], // du3: (A - an, uH, B: n) ; sg1: m-am (нет ?AB);
        a: ['त', 'ताम्', 'न्त', 'थाः', 'थाम्', 'ध्वम्', 'ि', 'वहि', 'महि'] // sg.2: itAn-atAn ; pl.3: anta-nta-ata ; du.2: iTAm-aTAm ;
    },
    la: {
        p: ['', '', '', '', '', '', '', '', ''], //
        a: ['', '', '', '', '', '', '', '', '']
    },
}


exports = module.exports = tins;

/*
  thema - совсем убрать, преверять отличия в фильтрах
  law: {}
  laN: {}

  а затем, спец. скпиптом - преобразовать в форму
  [
  {'त्': { gana, pada, thema, } }
  ]

*/
