var dump = [
{ key: 'As-upaveSane-adAdiH-1565',
  num: 1565,
  dhatu: 'आस्',
  dp: 'आसँ॒',
  dpc: 'आस्',
  gana: 2,
  artha: 'उपवेशने',
  set: true,
  la: 
   { par: {},
     atm: 
      { 'लट्': 
         { '1': [ 'आसे', 'आस्वहे', 'आस्महे' ],
           '2': [ 'आस्से', 'आसाथे', 'आद्ध्वे/आध्वे' ],
           '3': [ 'आस्ते', 'आसाते', 'आसते' ] },
        'लिट्': 
         { '1': 
            [ 'आसामास/आसाम्बभूव/आसाञ्चक्रे',
              'आसामासिव/आसाम्बभूविव/आसाञ्चकृवहे',
              'आसामासिम/आसाम्बभूविम/आसाञ्चकृमहे' ],
           '2': 
            [ 'आसामासिथ/आसाञ्चकृषे/आसाम्बभूविथ',
              'आसामासथुः/आसाञ्चक्राथे/आसाम्बभूवथुः',
              'आसामास/आसाम्बभूव/आसाञ्चकृढ्वे' ],
           '3': 
            [ 'आसामास/आसाम्बभूव/आसाञ्चक्रे',
              'आसामासतुः/आसाञ्चक्राते/आसाम्बभूवतुः',
              'आसामासुः/आसाम्बभूवुः/आसाञ्चक्रिरे' ] },
        'लुट्': 
         { '1': [ 'आसिताहे', 'आसितास्वहे', 'आसितास्महे' ],
           '2': [ 'आसितासे', 'आसितासाथे', 'आसिताध्वे' ],
           '3': [ 'आसिता', 'आसितारौ', 'आसितारः' ] },
        'लृट्': 
         { '1': [ 'आसिष्ये', 'आसिष्यावहे', 'आसिष्यामहे' ],
           '2': [ 'आसिष्यसे', 'आसिष्येथे', 'आसिष्यध्वे' ],
           '3': [ 'आसिष्यते', 'आसिष्येते', 'आसिष्यन्ते' ] },
        'लोट्': 
         { '1': [ 'आसै', 'आसावहै', 'आसामहै' ],
           '2': [ 'आस्स्व', 'आसाथाम्', 'आद्ध्वम्/आध्वम' ],
           '3': [ 'आस्ताम्', 'आसाताम्', 'आसताम्' ] },
        'लङ्': 
         { '1': [ 'आसि', 'आस्वहि', 'आस्महि' ],
           '2': [ 'आस्थाः', 'आसाथाम्', 'आद्धध्वम्/आध्वम्' ],
           '3': [ 'आस्त', 'आसाताम्', 'आसत' ] },
        'विधिलिङ्': 
         { '1': [ 'आसीय', 'आसीवहि', 'आसीमहि' ],
           '2': [ 'आसीथाः', 'आसीयाथाम्', 'आसीध्वम्' ],
           '3': [ 'आसीत', 'आसीयाताम्', 'आसीरन्' ] },
        'आशीर्लिङ्': 
         { '1': [ 'आसिषीय', 'आसिषीवहि', 'आसिषीमहि' ],
           '2': [ 'आसिषीष्ठाः', 'आसिषीयास्थाम्', 'आसिषीध्वम्' ],
           '3': [ 'आसिषीष्ट', 'आसिषीयास्ताम्', 'आसिषीरन्' ] },
        'लुङ्': 
         { '1': [ 'आसिषि', 'आसिष्वहि', 'आसिष्महि' ],
           '2': [ 'आसिष्ठाः', 'आसिषाथाम्', 'आसिढ्वम्' ],
           '3': [ 'आसिष्ट', 'आसिषाताम्', 'आसिषत' ] },
        'लृङ्': 
         { '1': [ 'आसिष्ये', 'आसिष्यावहि', 'आसिष्यामहि' ],
           '2': [ 'आसिष्यथाः', 'आसिष्येथाम्', 'आसिष्यध्वम्' ],
           '3': [ 'आसिष्यत', 'आसिष्येताम्', 'आसिष्यन्त' ] } } } },
{ key: 'BU-sattAyAm-BvAdiH-1',
  num: 1,
  dhatu: 'भू',
  dp: 'भू',
  dpc: 'भू',
  gana: 1,
  artha: 'सत्तायाम्',
  set: true,
  la: 
   { par: 
      { 'लट्': 
         { '1': [ 'भवामि', 'भवावः', 'भवामः' ],
           '2': [ 'भवसि', 'भवथः', 'भवथ' ],
           '3': [ 'भवति', 'भवतः', 'भवन्ति' ] },
        'लिट्': 
         { '1': [ 'बभूव', 'बभूविव', 'बभूविम' ],
           '2': [ 'बभूविथ', 'बभूवथुः', 'बभूव' ],
           '3': [ 'बभूव', 'बभूवतुः', 'बभूवुः' ] },
        'लुट्': 
         { '1': [ 'भवितास्मि', 'भवितास्वः', 'भवितास्मः' ],
           '2': [ 'भवितासि', 'भवितास्थः', 'भवितास्थ' ],
           '3': [ 'भविता', 'भवितारौ', 'भवितारः' ] },
        'लृट्': 
         { '1': [ 'भविष्यामि', 'भविष्यावः', 'भविष्यामः' ],
           '2': [ 'भविष्यसि', 'भविष्यथः', 'भविष्यथ' ],
           '3': [ 'भविष्यति', 'भविष्यतः', 'भविष्यन्ति' ] },
        'लोट्': 
         { '1': [ 'भवानि', 'भवाव', 'भवाम' ],
           '2': [ 'भव/भवतात्', 'भवतम्', 'भवत' ],
           '3': [ 'भवतु/भवतात्', 'भवताम्', 'भवन्तु' ] },
        'लङ्': 
         { '1': [ 'अभवम्', 'अभवाव', 'अभवाम' ],
           '2': [ 'अभवः', 'अभवतम्', 'अभवत' ],
           '3': [ 'अभवत्', 'अभवताम्', 'अभवन्' ] },
        'विधिलिङ्': 
         { '1': [ 'भवेयम्', 'भवेव', 'भवेम' ],
           '2': [ 'भवेः', 'भवेतम्', 'भवेत' ],
           '3': [ 'भवेत्', 'भवेताम्', 'भवेयुः' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भूयासम्', 'भूयास्व', 'भूयास्म' ],
           '2': [ 'भूयाः', 'भूयास्तम्', 'भूयास्त' ],
           '3': [ 'भूयात्', 'भूयास्ताम्', 'भूयासुः' ] },
        'लुङ्': 
         { '1': [ 'अभूवम्', 'अभूव', 'अभूम' ],
           '2': [ 'अभूः', 'अभूतम्', 'अभूत' ],
           '3': [ 'अभूत्', 'अभूताम्', 'अभूवन्' ] },
        'लृङ्': 
         { '1': [ 'अभविष्यम्', 'अभविष्याव', 'अभविष्याम' ],
           '2': [ 'अभविष्यः', 'अभविष्यतम्', 'अभविष्यत' ],
           '3': [ 'अभविष्यत्', 'अभविष्यताम्', 'अभविष्यन्' ] } },
     atm: {} } },
]
exports = module.exports = dump;