var dump = [
{ key: 'BU-prAptO-curAdiH-2748',
  num: 2748,
  dhatu: 'भू',
  dp: 'भू',
  dpc: 'भू',
  gana: 'चुरादिः',
  artha: 'प्राप्तौ',
  iDAgama: 'सेट्',
  la: 
   { 'परस्मै': {},
     'आत्मने': 
      { 'लट्': 
         { 'प्रथमपुरुषः': [ 'भवते/भावयते', 'भवेते/भावयेते', 'भवन्ते/भावयन्ते' ],
           'मध्यमपुरुषः': [ 'भवसे/भावयसे', 'भवेथे/भावयेथे', 'भवध्वे/भावयध्वे' ],
           'उत्तमपुरुषः': [ 'भवे/भावये', 'भवावहे/भावयावहे', 'भवामहे/भावयामहे' ] },
        'लिट्': 
         { 'प्रथमपुरुषः': 
            [ 'भावयामास/भावयाञ्चक्रे/भावयाम्बभूव',
              'भावयामासतुः/भावयाञ्चक्राते/भावयाम्बभूवतुः',
              'भावयामासुः/भावयाम्बभूवुः/भावयाञ्चक्रिरे' ],
           'मध्यमपुरुषः': 
            [ 'भावयामासिथ/भावयाञ्चकृषे/भावयाम्बभूविथ',
              'भावयामासथुः/भावयाञ्चक्राथे/भावयाम्बभूवथुः',
              'भावयामास/भावयाम्बभूव/भावयाञ्चकृढ्वे' ],
           'उत्तमपुरुषः': 
            [ 'भावयामास/भावयाञ्चक्रे/भावयाम्बभूव',
              'भावयामासिव/भावयाम्बभूविव/भावयाञ्चकृवहे',
              'भावयामासिम/भावयाम्बभूविम/भावयाञ्चकृमहे' ] },
        'लुट्': 
         { 'प्रथमपुरुषः': [ 'भावयिता', 'भावयितारौ', 'भावयितारः' ],
           'मध्यमपुरुषः': [ 'भावयितासे', 'भावयितासाथे', 'भावयिताध्वे' ],
           'उत्तमपुरुषः': [ 'भावयिताहे', 'भावयितास्वहे', 'भावयितास्महे' ] },
        'लृट्': 
         { 'प्रथमपुरुषः': [ 'भावयिष्यते', 'भावयिष्येते', 'भावयिष्यन्ते' ],
           'मध्यमपुरुषः': [ 'भावयिष्यसे', 'भावयिष्येथे', 'भावयिष्यध्वे' ],
           'उत्तमपुरुषः': [ 'भावयिष्ये', 'भावयिष्यावहे', 'भावयिष्यामहे' ] },
        'लोट्': 
         { 'प्रथमपुरुषः': [ 'भावयताम्', 'भावयेताम्', 'भावयन्ताम्' ],
           'मध्यमपुरुषः': [ 'भावयस्व', 'भावयेथाम्', 'भावयध्वम्' ],
           'उत्तमपुरुषः': [ 'भावयै', 'भावयावहै', 'भावयामहै' ] },
        'लङ्': 
         { 'प्रथमपुरुषः': [ 'अभावयत', 'अभावयेताम्', 'अभावयन्त' ],
           'मध्यमपुरुषः': [ 'अभावयथाः', 'अभावयेथाम्', 'अभावयध्वम्' ],
           'उत्तमपुरुषः': [ 'अभावये', 'अभावयावहि', 'अभावयामहि' ] },
        'विधिलिङ्': 
         { 'प्रथमपुरुषः': [ 'भावयेत', 'भावयेयाताम्', 'भावयेरन्' ],
           'मध्यमपुरुषः': [ 'भावयेथाः', 'भावयेयाथाम्', 'भावयेध्वम्' ],
           'उत्तमपुरुषः': [ 'भावयेय', 'भावयेवहि', 'भावयेमहि' ] },
        'आशीर्लिङ्': 
         { 'प्रथमपुरुषः': [ 'भावयिषीष्ट', 'भावयिषीयास्ताम्', 'भावयिषीरन्' ],
           'मध्यमपुरुषः': [ 'भावयिषीष्ठाः', 'भावयिषीयास्थाम्', 'भावयिषीध्वम्' ],
           'उत्तमपुरुषः': [ 'भावयिषीय', 'भावयिषीवहि', 'भावयिषीमहि' ] },
        'लुङ्': 
         { 'प्रथमपुरुषः': [ 'अबीभवत', 'अबीभवेताम्', 'अबीभवन्त' ],
           'मध्यमपुरुषः': [ 'अबीभवथाः', 'अबीभवेथाम्', 'अबीभवध्वम्' ],
           'उत्तमपुरुषः': [ 'अबीभवे', 'अबीभवावहि', 'अबीभवामहि' ] },
        'लृङ्': 
         { 'प्रथमपुरुषः': [ 'अभावयिष्यत', 'अभावयिष्येताम्', 'अभावयिष्यन्त' ],
           'मध्यमपुरुषः': [ 'अभावयिष्यथाः', 'अभावयिष्येथाम्', 'अभावयिष्यध्वम्' ],
           'उत्तमपुरुषः': [ 'अभावयिष्ये', 'अभावयिष्यावहि', 'अभावयिष्यामहि' ] } } } },
{ key: 'BU-sattAyAm-BvAdiH-1',
  num: 1,
  dhatu: 'भू',
  dp: 'भू',
  dpc: 'भू',
  gana: 'भ्वादिः',
  artha: 'सत्तायाम्',
  iDAgama: 'सेट्',
  la: 
   { 'परस्मै': 
      { 'लट्': 
         { 'प्रथमपुरुषः': [ 'भवति', 'भवतः', 'भवन्ति' ],
           'मध्यमपुरुषः': [ 'भवसि', 'भवथः', 'भवथ' ],
           'उत्तमपुरुषः': [ 'भवामि', 'भवावः', 'भवामः' ] },
        'लिट्': 
         { 'प्रथमपुरुषः': [ 'बभूव', 'बभूवतुः', 'बभूवुः' ],
           'मध्यमपुरुषः': [ 'बभूविथ', 'बभूवथुः', 'बभूव' ],
           'उत्तमपुरुषः': [ 'बभूव', 'बभूविव', 'बभूविम' ] },
        'लुट्': 
         { 'प्रथमपुरुषः': [ 'भविता', 'भवितारौ', 'भवितारः' ],
           'मध्यमपुरुषः': [ 'भवितासि', 'भवितास्थः', 'भवितास्थ' ],
           'उत्तमपुरुषः': [ 'भवितास्मि', 'भवितास्वः', 'भवितास्मः' ] },
        'लृट्': 
         { 'प्रथमपुरुषः': [ 'भविष्यति', 'भविष्यतः', 'भविष्यन्ति' ],
           'मध्यमपुरुषः': [ 'भविष्यसि', 'भविष्यथः', 'भविष्यथ' ],
           'उत्तमपुरुषः': [ 'भविष्यामि', 'भविष्यावः', 'भविष्यामः' ] },
        'लोट्': 
         { 'प्रथमपुरुषः': [ 'भवतु/भवतात्', 'भवताम्', 'भवन्तु' ],
           'मध्यमपुरुषः': [ 'भव/भवतात्', 'भवतम्', 'भवत' ],
           'उत्तमपुरुषः': [ 'भवानि', 'भवाव', 'भवाम' ] },
        'लङ्': 
         { 'प्रथमपुरुषः': [ 'अभवत्', 'अभवताम्', 'अभवन्' ],
           'मध्यमपुरुषः': [ 'अभवः', 'अभवतम्', 'अभवत' ],
           'उत्तमपुरुषः': [ 'अभवम्', 'अभवाव', 'अभवाम' ] },
        'विधिलिङ्': 
         { 'प्रथमपुरुषः': [ 'भवेत्', 'भवेताम्', 'भवेयुः' ],
           'मध्यमपुरुषः': [ 'भवेः', 'भवेतम्', 'भवेत' ],
           'उत्तमपुरुषः': [ 'भवेयम्', 'भवेव', 'भवेम' ] },
        'आशीर्लिङ्': 
         { 'प्रथमपुरुषः': [ 'भूयात्', 'भूयास्ताम्', 'भूयासुः' ],
           'मध्यमपुरुषः': [ 'भूयाः', 'भूयास्तम्', 'भूयास्त' ],
           'उत्तमपुरुषः': [ 'भूयासम्', 'भूयास्व', 'भूयास्म' ] },
        'लुङ्': 
         { 'प्रथमपुरुषः': [ 'अभूत्', 'अभूताम्', 'अभूवन्' ],
           'मध्यमपुरुषः': [ 'अभूः', 'अभूतम्', 'अभूत' ],
           'उत्तमपुरुषः': [ 'अभूवम्', 'अभूव', 'अभूम' ] },
        'लृङ्': 
         { 'प्रथमपुरुषः': [ 'अभविष्यत्', 'अभविष्यताम्', 'अभविष्यन्' ],
           'मध्यमपुरुषः': [ 'अभविष्यः', 'अभविष्यतम्', 'अभविष्यत' ],
           'उत्तमपुरुषः': [ 'अभविष्यम्', 'अभविष्याव', 'अभविष्याम' ] } },
     'आत्मने': {} } },
]
exports = module.exports = dump;