var dump = [
{ key: 'As-upaveSane-adAdiH-1565',
  num: 1565,
  dhatu: 'आस्',
  dp: 'आसँ॒',
  dpc: 'आस्',
  gana: 2,
  artha: 'उपवेशने',
  set: true,
  la: 
   { par: {},
     atm: 
      { 'लट्': 
         { '1': [ 'आसे', 'आस्वहे', 'आस्महे' ],
           '2': [ 'आस्से', 'आसाथे', 'आद्ध्वे/आध्वे' ],
           '3': [ 'आस्ते', 'आसाते', 'आसते' ] },
        'लिट्': 
         { '1': 
            [ 'आसामास/आसाम्बभूव/आसाञ्चक्रे',
              'आसामासिव/आसाम्बभूविव/आसाञ्चकृवहे',
              'आसामासिम/आसाम्बभूविम/आसाञ्चकृमहे' ],
           '2': 
            [ 'आसामासिथ/आसाञ्चकृषे/आसाम्बभूविथ',
              'आसामासथुः/आसाञ्चक्राथे/आसाम्बभूवथुः',
              'आसामास/आसाम्बभूव/आसाञ्चकृढ्वे' ],
           '3': 
            [ 'आसामास/आसाम्बभूव/आसाञ्चक्रे',
              'आसामासतुः/आसाञ्चक्राते/आसाम्बभूवतुः',
              'आसामासुः/आसाम्बभूवुः/आसाञ्चक्रिरे' ] },
        'लुट्': 
         { '1': [ 'आसिताहे', 'आसितास्वहे', 'आसितास्महे' ],
           '2': [ 'आसितासे', 'आसितासाथे', 'आसिताध्वे' ],
           '3': [ 'आसिता', 'आसितारौ', 'आसितारः' ] },
        'लृट्': 
         { '1': [ 'आसिष्ये', 'आसिष्यावहे', 'आसिष्यामहे' ],
           '2': [ 'आसिष्यसे', 'आसिष्येथे', 'आसिष्यध्वे' ],
           '3': [ 'आसिष्यते', 'आसिष्येते', 'आसिष्यन्ते' ] },
        'लोट्': 
         { '1': [ 'आसै', 'आसावहै', 'आसामहै' ],
           '2': [ 'आस्स्व', 'आसाथाम्', 'आद्ध्वम्/आध्वम' ],
           '3': [ 'आस्ताम्', 'आसाताम्', 'आसताम्' ] },
        'लङ्': 
         { '1': [ 'आसि', 'आस्वहि', 'आस्महि' ],
           '2': [ 'आस्थाः', 'आसाथाम्', 'आद्धध्वम्/आध्वम्' ],
           '3': [ 'आस्त', 'आसाताम्', 'आसत' ] },
        'विधिलिङ्': 
         { '1': [ 'आसीय', 'आसीवहि', 'आसीमहि' ],
           '2': [ 'आसीथाः', 'आसीयाथाम्', 'आसीध्वम्' ],
           '3': [ 'आसीत', 'आसीयाताम्', 'आसीरन्' ] },
        'आशीर्लिङ्': 
         { '1': [ 'आसिषीय', 'आसिषीवहि', 'आसिषीमहि' ],
           '2': [ 'आसिषीष्ठाः', 'आसिषीयास्थाम्', 'आसिषीध्वम्' ],
           '3': [ 'आसिषीष्ट', 'आसिषीयास्ताम्', 'आसिषीरन्' ] },
        'लुङ्': 
         { '1': [ 'आसिषि', 'आसिष्वहि', 'आसिष्महि' ],
           '2': [ 'आसिष्ठाः', 'आसिषाथाम्', 'आसिढ्वम्' ],
           '3': [ 'आसिष्ट', 'आसिषाताम्', 'आसिषत' ] },
        'लृङ्': 
         { '1': [ 'आसिष्ये', 'आसिष्यावहि', 'आसिष्यामहि' ],
           '2': [ 'आसिष्यथाः', 'आसिष्येथाम्', 'आसिष्यध्वम्' ],
           '3': [ 'आसिष्यत', 'आसिष्येताम्', 'आसिष्यन्त' ] } } } },
{ key: 'BA-dIptO-adAdiH-1610',
  num: 1610,
  dhatu: 'भा',
  dp: 'भा॒',
  dpc: 'भा',
  gana: 2,
  artha: 'दीप्तौ',
  set: false,
  la: 
   { par: 
      { 'लट्': 
         { '1': [ 'भामि', 'भावः', 'भामः' ],
           '2': [ 'भासि', 'भाथः', 'भाथ' ],
           '3': [ 'भाति', 'भातः', 'भान्ति' ] },
        'लिट्': 
         { '1': [ 'बभौ', 'बभिव', 'बभिम' ],
           '2': [ 'बभाथ/बभिथ', 'बभथुः', 'बभ' ],
           '3': [ 'बभौ', 'बभतुः', 'बभुः' ] },
        'लुट्': 
         { '1': [ 'भातास्मि', 'भातास्वः', 'भातास्मः' ],
           '2': [ 'भातासि', 'भातास्थः', 'भातास्थ' ],
           '3': [ 'भाता', 'भातारौ', 'भातारः' ] },
        'लृट्': 
         { '1': [ 'भास्यामि', 'भास्यावः', 'भास्यामः' ],
           '2': [ 'भास्यसि', 'भास्यथः', 'भास्यथ' ],
           '3': [ 'भास्यति', 'भास्यतः', 'भास्यन्ति' ] },
        'लोट्': 
         { '1': [ 'भानि', 'भाव', 'भाम' ],
           '2': [ 'भातात्/भाहि', 'भातम्', 'भात' ],
           '3': [ 'भातात्/भातु', 'भाताम्', 'भान्तु' ] },
        'लङ्': 
         { '1': [ 'अभाम्', 'अभाव', 'अभाम' ],
           '2': [ 'अभाः', 'अभातम्', 'अभात' ],
           '3': [ 'अभात्', 'अभाताम्', 'अभान्/अभुः' ] },
        'विधिलिङ्': 
         { '1': [ 'भायाम्', 'भायाव', 'भायाम' ],
           '2': [ 'भायाः', 'भायातम्', 'भायात' ],
           '3': [ 'भायात्', 'भायाताम्', 'भायुः' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भायासम्', 'भायास्व', 'भायास्म' ],
           '2': [ 'भायाः', 'भायास्तम्', 'भायास्त' ],
           '3': [ 'भायात्', 'भायास्ताम्', 'भायासुः' ] },
        'लुङ्': 
         { '1': [ 'अभासिषम्', 'अभासिष्व', 'अभासिष्म' ],
           '2': [ 'अभासीः', 'अभासिष्टम्', 'अभासिष्ट' ],
           '3': [ 'अभासीत्', 'अभासिष्टाम्', 'अभासिषुः' ] },
        'लृङ्': 
         { '1': [ 'अभास्यम्', 'अभास्याव', 'अभास्याम' ],
           '2': [ 'अभास्यः', 'अभास्यतम्', 'अभास्यत' ],
           '3': [ 'अभास्यत्', 'अभास्यताम्', 'अभास्यन्' ] } },
     atm: {} } },
{ key: 'BAja-pfTakkarmaRi-curAdiH-2794',
  num: 2794,
  dhatu: 'भाज',
  dp: 'भाज',
  dpc: 'भाज',
  gana: 10,
  artha: 'पृथक्कर्मणि',
  set: true },
{ key: 'BAja-pfTakkarmaRi-curAdiH-3210',
  num: 3210,
  dhatu: 'भाज',
  dp: 'भाज',
  dpc: 'भाज',
  gana: 10,
  artha: 'पृथक्कर्मणि',
  set: true },
{ key: 'BAm-kroDe-BvAdiH-630',
  num: 630,
  dhatu: 'भाम्',
  dp: 'भामँ॒',
  dpc: 'भाम्',
  gana: 1,
  artha: 'क्रोधे',
  set: true,
  la: 
   { par: {},
     atm: 
      { 'लट्': 
         { '1': [ 'भामे', 'भामावहे', 'भामामहे' ],
           '2': [ 'भामसे', 'भामेथे', 'भामध्वे' ],
           '3': [ 'भामते', 'भामेते', 'भामन्ते' ] },
        'लिट्': 
         { '1': [ 'बभामे', 'बभामिवहे', 'बभामिमहे' ],
           '2': [ 'बभामिषे', 'बभामाथे', 'बभामिध्वे' ],
           '3': [ 'बभामे', 'बभामाते', 'बभामिरे' ] },
        'लुट्': 
         { '1': [ 'भामिताहे', 'भामितास्वहे', 'भामितास्महे' ],
           '2': [ 'भामितासे', 'भामितासाथे', 'भामिताध्वे' ],
           '3': [ 'भामिता', 'भामितारौ', 'भामितारः' ] },
        'लृट्': 
         { '1': [ 'भामिष्ये', 'भामिष्यावहे', 'भामिष्यामहे' ],
           '2': [ 'भामिष्यसे', 'भामिष्येथे', 'भामिष्यध्वे' ],
           '3': [ 'भामिष्यते', 'भामिष्येते', 'भामिष्यन्ते' ] },
        'लोट्': 
         { '1': [ 'भामै', 'भामावहै', 'भामामहै' ],
           '2': [ 'भामस्व', 'भामेथाम्', 'भामध्वम्' ],
           '3': [ 'भामताम्', 'भामेताम्', 'भामन्ताम्' ] },
        'लङ्': 
         { '1': [ 'अभामे', 'अभामावहि', 'अभामामहि' ],
           '2': [ 'अभामथाः', 'अभामेथाम्', 'अभामध्वम्' ],
           '3': [ 'अभामत', 'अभामेताम्', 'अभामन्त' ] },
        'विधिलिङ्': 
         { '1': [ 'भामेय', 'भामेवहि', 'भामेमहि' ],
           '2': [ 'भामेथाः', 'भामेयाथाम्', 'भामेध्वम्' ],
           '3': [ 'भामेत', 'भामेयाताम्', 'भामेरन्' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भामिषीय', 'भामिषीवहि', 'भामिषीमहि' ],
           '2': [ 'भामिषीष्ठाः', 'भामिषीयास्थाम्', 'भामिषीध्वम्' ],
           '3': [ 'भामिषीष्ट', 'भामिषीयास्ताम्', 'भामिषीरन्' ] },
        'लुङ्': 
         { '1': [ 'अभामिषि', 'अभामिष्वहि', 'अभामिष्महि' ],
           '2': [ 'अभामिष्ठाः', 'अभामिषाथाम्', 'अभामिध्वम्/अभामिढ्वम्' ],
           '3': [ 'अभामिष्ट', 'अभामिषाताम्', 'अभामिषत' ] },
        'लृङ्': 
         { '1': [ 'अभामिष्ये', 'अभामिष्यावहि', 'अभामिष्यामहि' ],
           '2': [ 'अभामिष्यथाः', 'अभामिष्येथाम्', 'अभामिष्यध्वम्' ],
           '3': [ 'अभामिष्यत', 'अभामिष्येताम्', 'अभामिष्यन्त' ] } } } },
{ key: 'BAs-dIptO-BvAdiH-941',
  num: 941,
  dhatu: 'भास्',
  dp: 'भासृँ॒',
  dpc: 'भास्',
  gana: 1,
  artha: 'दीप्तौ',
  set: true,
  la: 
   { par: {},
     atm: 
      { 'लट्': 
         { '1': [ 'भासे', 'भासावहे', 'भासामहे' ],
           '2': [ 'भाससे', 'भासेथे', 'भासध्वे' ],
           '3': [ 'भासते', 'भासेते', 'भासन्ते' ] },
        'लिट्': 
         { '1': [ 'बभासे', 'बभासिवहे', 'बभासिमहे' ],
           '2': [ 'बभासिषे', 'बभासाथे', 'बभासिध्वे' ],
           '3': [ 'बभासे', 'बभासाते', 'बभासिरे' ] },
        'लुट्': 
         { '1': [ 'भासिताहे', 'भासितास्वहे', 'भासितास्महे' ],
           '2': [ 'भासितासे', 'भासितासाथे', 'भासिताध्वे' ],
           '3': [ 'भासिता', 'भासितारौ', 'भासितारः' ] },
        'लृट्': 
         { '1': [ 'भासिष्ये', 'भासिष्यावहे', 'भासिष्यामहे' ],
           '2': [ 'भासिष्यसे', 'भासिष्येथे', 'भासिष्यध्वे' ],
           '3': [ 'भासिष्यते', 'भासिष्येते', 'भासिष्यन्ते' ] },
        'लोट्': 
         { '1': [ 'भासै', 'भासावहै', 'भासामहै' ],
           '2': [ 'भासस्व', 'भासेथाम्', 'भासध्वम्' ],
           '3': [ 'भासताम्', 'भासेताम्', 'भासन्ताम्' ] },
        'लङ्': 
         { '1': [ 'अभासे', 'अभासावहि', 'अभासामहि' ],
           '2': [ 'अभासथाः', 'अभासेथाम्', 'अभासध्वम्' ],
           '3': [ 'अभासत', 'अभासेताम्', 'अभासन्त' ] },
        'विधिलिङ्': 
         { '1': [ 'भासेय', 'भासेवहि', 'भासेमहि' ],
           '2': [ 'भासेथाः', 'भासेयाथाम्', 'भासेध्वम्' ],
           '3': [ 'भासेत', 'भासेयाताम्', 'भासेरन्' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भासिषीय', 'भासिषीवहि', 'भासिषीमहि' ],
           '2': [ 'भासिषीष्ठाः', 'भासिषीयास्थाम्', 'भासिषीध्वम्' ],
           '3': [ 'भासिषीष्ट', 'भासिषीयास्ताम्', 'भासिषीरन्' ] },
        'लुङ्': 
         { '1': [ 'अभासिषि', 'अभासिष्वहि', 'अभासिष्महि' ],
           '2': [ 'अभासिष्ठाः', 'अभासिषाथाम्', 'अभासिध्वम्/अभासिढ्वम्' ],
           '3': [ 'अभासिष्ट', 'अभासिषाताम्', 'अभासिषत' ] },
        'लृङ्': 
         { '1': [ 'अभासिष्ये', 'अभासिष्यावहि', 'अभासिष्यामहि' ],
           '2': [ 'अभासिष्यथाः', 'अभासिष्येथाम्', 'अभासिष्यध्वम्' ],
           '3': [ 'अभासिष्यत', 'अभासिष्येताम्', 'अभासिष्यन्त' ] } } } },
]
exports = module.exports = dump;