var dump = [
{ key: 'As-upaveSane-adAdiH-1565',
  num: 1565,
  dhatu: 'आस्',
  dp: 'आसँ॒',
  dpc: 'आस्',
  gana: 2,
  artha: 'उपवेशने',
  set: true,
  la: 
   { par: {},
     atm: 
      { 'लट्': 
         { '1': [ 'आसे', 'आस्वहे', 'आस्महे' ],
           '2': [ 'आस्से', 'आसाथे', 'आद्ध्वे/आध्वे' ],
           '3': [ 'आस्ते', 'आसाते', 'आसते' ] },
        'लिट्': 
         { '1': 
            [ 'आसामास/आसाम्बभूव/आसाञ्चक्रे',
              'आसामासिव/आसाम्बभूविव/आसाञ्चकृवहे',
              'आसामासिम/आसाम्बभूविम/आसाञ्चकृमहे' ],
           '2': 
            [ 'आसामासिथ/आसाञ्चकृषे/आसाम्बभूविथ',
              'आसामासथुः/आसाञ्चक्राथे/आसाम्बभूवथुः',
              'आसामास/आसाम्बभूव/आसाञ्चकृढ्वे' ],
           '3': 
            [ 'आसामास/आसाम्बभूव/आसाञ्चक्रे',
              'आसामासतुः/आसाञ्चक्राते/आसाम्बभूवतुः',
              'आसामासुः/आसाम्बभूवुः/आसाञ्चक्रिरे' ] },
        'लुट्': 
         { '1': [ 'आसिताहे', 'आसितास्वहे', 'आसितास्महे' ],
           '2': [ 'आसितासे', 'आसितासाथे', 'आसिताध्वे' ],
           '3': [ 'आसिता', 'आसितारौ', 'आसितारः' ] },
        'लृट्': 
         { '1': [ 'आसिष्ये', 'आसिष्यावहे', 'आसिष्यामहे' ],
           '2': [ 'आसिष्यसे', 'आसिष्येथे', 'आसिष्यध्वे' ],
           '3': [ 'आसिष्यते', 'आसिष्येते', 'आसिष्यन्ते' ] },
        'लोट्': 
         { '1': [ 'आसै', 'आसावहै', 'आसामहै' ],
           '2': [ 'आस्स्व', 'आसाथाम्', 'आद्ध्वम्/आध्वम' ],
           '3': [ 'आस्ताम्', 'आसाताम्', 'आसताम्' ] },
        'लङ्': 
         { '1': [ 'आसि', 'आस्वहि', 'आस्महि' ],
           '2': [ 'आस्थाः', 'आसाथाम्', 'आद्धध्वम्/आध्वम्' ],
           '3': [ 'आस्त', 'आसाताम्', 'आसत' ] },
        'विधिलिङ्': 
         { '1': [ 'आसीय', 'आसीवहि', 'आसीमहि' ],
           '2': [ 'आसीथाः', 'आसीयाथाम्', 'आसीध्वम्' ],
           '3': [ 'आसीत', 'आसीयाताम्', 'आसीरन्' ] },
        'आशीर्लिङ्': 
         { '1': [ 'आसिषीय', 'आसिषीवहि', 'आसिषीमहि' ],
           '2': [ 'आसिषीष्ठाः', 'आसिषीयास्थाम्', 'आसिषीध्वम्' ],
           '3': [ 'आसिषीष्ट', 'आसिषीयास्ताम्', 'आसिषीरन्' ] },
        'लुङ्': 
         { '1': [ 'आसिषि', 'आसिष्वहि', 'आसिष्महि' ],
           '2': [ 'आसिष्ठाः', 'आसिषाथाम्', 'आसिढ्वम्' ],
           '3': [ 'आसिष्ट', 'आसिषाताम्', 'आसिषत' ] },
        'लृङ्': 
         { '1': [ 'आसिष्ये', 'आसिष्यावहि', 'आसिष्यामहि' ],
           '2': [ 'आसिष्यथाः', 'आसिष्येथाम्', 'आसिष्यध्वम्' ],
           '3': [ 'आसिष्यत', 'आसिष्येताम्', 'आसिष्यन्त' ] } } } },
{ key: 'BA-dIptO-adAdiH-1610',
  num: 1610,
  dhatu: 'भा',
  dp: 'भा॒',
  dpc: 'भा',
  gana: 2,
  artha: 'दीप्तौ',
  set: false,
  la: 
   { par: 
      { 'लट्': 
         { '1': [ 'भामि', 'भावः', 'भामः' ],
           '2': [ 'भासि', 'भाथः', 'भाथ' ],
           '3': [ 'भाति', 'भातः', 'भान्ति' ] },
        'लिट्': 
         { '1': [ 'बभौ', 'बभिव', 'बभिम' ],
           '2': [ 'बभाथ/बभिथ', 'बभथुः', 'बभ' ],
           '3': [ 'बभौ', 'बभतुः', 'बभुः' ] },
        'लुट्': 
         { '1': [ 'भातास्मि', 'भातास्वः', 'भातास्मः' ],
           '2': [ 'भातासि', 'भातास्थः', 'भातास्थ' ],
           '3': [ 'भाता', 'भातारौ', 'भातारः' ] },
        'लृट्': 
         { '1': [ 'भास्यामि', 'भास्यावः', 'भास्यामः' ],
           '2': [ 'भास्यसि', 'भास्यथः', 'भास्यथ' ],
           '3': [ 'भास्यति', 'भास्यतः', 'भास्यन्ति' ] },
        'लोट्': 
         { '1': [ 'भानि', 'भाव', 'भाम' ],
           '2': [ 'भातात्/भाहि', 'भातम्', 'भात' ],
           '3': [ 'भातात्/भातु', 'भाताम्', 'भान्तु' ] },
        'लङ्': 
         { '1': [ 'अभाम्', 'अभाव', 'अभाम' ],
           '2': [ 'अभाः', 'अभातम्', 'अभात' ],
           '3': [ 'अभात्', 'अभाताम्', 'अभान्/अभुः' ] },
        'विधिलिङ्': 
         { '1': [ 'भायाम्', 'भायाव', 'भायाम' ],
           '2': [ 'भायाः', 'भायातम्', 'भायात' ],
           '3': [ 'भायात्', 'भायाताम्', 'भायुः' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भायासम्', 'भायास्व', 'भायास्म' ],
           '2': [ 'भायाः', 'भायास्तम्', 'भायास्त' ],
           '3': [ 'भायात्', 'भायास्ताम्', 'भायासुः' ] },
        'लुङ्': 
         { '1': [ 'अभासिषम्', 'अभासिष्व', 'अभासिष्म' ],
           '2': [ 'अभासीः', 'अभासिष्टम्', 'अभासिष्ट' ],
           '3': [ 'अभासीत्', 'अभासिष्टाम्', 'अभासिषुः' ] },
        'लृङ्': 
         { '1': [ 'अभास्यम्', 'अभास्याव', 'अभास्याम' ],
           '2': [ 'अभास्यः', 'अभास्यतम्', 'अभास्यत' ],
           '3': [ 'अभास्यत्', 'अभास्यताम्', 'अभास्यन्' ] } },
     atm: {} } },
{ key: 'BAja-pfTakkarmaRi-curAdiH-2794',
  num: 2794,
  dhatu: 'भाज',
  dp: 'भाज',
  dpc: 'भाज',
  gana: 10,
  artha: 'पृथक्कर्मणि',
  set: true },
{ key: 'BAja-pfTakkarmaRi-curAdiH-3210',
  num: 3210,
  dhatu: 'भाज',
  dp: 'भाज',
  dpc: 'भाज',
  gana: 10,
  artha: 'पृथक्कर्मणि',
  set: true },
{ key: 'BAm-kroDe-BvAdiH-630',
  num: 630,
  dhatu: 'भाम्',
  dp: 'भामँ॒',
  dpc: 'भाम्',
  gana: 1,
  artha: 'क्रोधे',
  set: true,
  la: 
   { par: {},
     atm: 
      { 'लट्': 
         { '1': [ 'भामे', 'भामावहे', 'भामामहे' ],
           '2': [ 'भामसे', 'भामेथे', 'भामध्वे' ],
           '3': [ 'भामते', 'भामेते', 'भामन्ते' ] },
        'लिट्': 
         { '1': [ 'बभामे', 'बभामिवहे', 'बभामिमहे' ],
           '2': [ 'बभामिषे', 'बभामाथे', 'बभामिध्वे' ],
           '3': [ 'बभामे', 'बभामाते', 'बभामिरे' ] },
        'लुट्': 
         { '1': [ 'भामिताहे', 'भामितास्वहे', 'भामितास्महे' ],
           '2': [ 'भामितासे', 'भामितासाथे', 'भामिताध्वे' ],
           '3': [ 'भामिता', 'भामितारौ', 'भामितारः' ] },
        'लृट्': 
         { '1': [ 'भामिष्ये', 'भामिष्यावहे', 'भामिष्यामहे' ],
           '2': [ 'भामिष्यसे', 'भामिष्येथे', 'भामिष्यध्वे' ],
           '3': [ 'भामिष्यते', 'भामिष्येते', 'भामिष्यन्ते' ] },
        'लोट्': 
         { '1': [ 'भामै', 'भामावहै', 'भामामहै' ],
           '2': [ 'भामस्व', 'भामेथाम्', 'भामध्वम्' ],
           '3': [ 'भामताम्', 'भामेताम्', 'भामन्ताम्' ] },
        'लङ्': 
         { '1': [ 'अभामे', 'अभामावहि', 'अभामामहि' ],
           '2': [ 'अभामथाः', 'अभामेथाम्', 'अभामध्वम्' ],
           '3': [ 'अभामत', 'अभामेताम्', 'अभामन्त' ] },
        'विधिलिङ्': 
         { '1': [ 'भामेय', 'भामेवहि', 'भामेमहि' ],
           '2': [ 'भामेथाः', 'भामेयाथाम्', 'भामेध्वम्' ],
           '3': [ 'भामेत', 'भामेयाताम्', 'भामेरन्' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भामिषीय', 'भामिषीवहि', 'भामिषीमहि' ],
           '2': [ 'भामिषीष्ठाः', 'भामिषीयास्थाम्', 'भामिषीध्वम्' ],
           '3': [ 'भामिषीष्ट', 'भामिषीयास्ताम्', 'भामिषीरन्' ] },
        'लुङ्': 
         { '1': [ 'अभामिषि', 'अभामिष्वहि', 'अभामिष्महि' ],
           '2': [ 'अभामिष्ठाः', 'अभामिषाथाम्', 'अभामिध्वम्/अभामिढ्वम्' ],
           '3': [ 'अभामिष्ट', 'अभामिषाताम्', 'अभामिषत' ] },
        'लृङ्': 
         { '1': [ 'अभामिष्ये', 'अभामिष्यावहि', 'अभामिष्यामहि' ],
           '2': [ 'अभामिष्यथाः', 'अभामिष्येथाम्', 'अभामिष्यध्वम्' ],
           '3': [ 'अभामिष्यत', 'अभामिष्येताम्', 'अभामिष्यन्त' ] } } } },
{ key: 'BAs-dIptO-BvAdiH-941',
  num: 941,
  dhatu: 'भास्',
  dp: 'भासृँ॒',
  dpc: 'भास्',
  gana: 1,
  artha: 'दीप्तौ',
  set: true,
  la: 
   { par: {},
     atm: 
      { 'लट्': 
         { '1': [ 'भासे', 'भासावहे', 'भासामहे' ],
           '2': [ 'भाससे', 'भासेथे', 'भासध्वे' ],
           '3': [ 'भासते', 'भासेते', 'भासन्ते' ] },
        'लिट्': 
         { '1': [ 'बभासे', 'बभासिवहे', 'बभासिमहे' ],
           '2': [ 'बभासिषे', 'बभासाथे', 'बभासिध्वे' ],
           '3': [ 'बभासे', 'बभासाते', 'बभासिरे' ] },
        'लुट्': 
         { '1': [ 'भासिताहे', 'भासितास्वहे', 'भासितास्महे' ],
           '2': [ 'भासितासे', 'भासितासाथे', 'भासिताध्वे' ],
           '3': [ 'भासिता', 'भासितारौ', 'भासितारः' ] },
        'लृट्': 
         { '1': [ 'भासिष्ये', 'भासिष्यावहे', 'भासिष्यामहे' ],
           '2': [ 'भासिष्यसे', 'भासिष्येथे', 'भासिष्यध्वे' ],
           '3': [ 'भासिष्यते', 'भासिष्येते', 'भासिष्यन्ते' ] },
        'लोट्': 
         { '1': [ 'भासै', 'भासावहै', 'भासामहै' ],
           '2': [ 'भासस्व', 'भासेथाम्', 'भासध्वम्' ],
           '3': [ 'भासताम्', 'भासेताम्', 'भासन्ताम्' ] },
        'लङ्': 
         { '1': [ 'अभासे', 'अभासावहि', 'अभासामहि' ],
           '2': [ 'अभासथाः', 'अभासेथाम्', 'अभासध्वम्' ],
           '3': [ 'अभासत', 'अभासेताम्', 'अभासन्त' ] },
        'विधिलिङ्': 
         { '1': [ 'भासेय', 'भासेवहि', 'भासेमहि' ],
           '2': [ 'भासेथाः', 'भासेयाथाम्', 'भासेध्वम्' ],
           '3': [ 'भासेत', 'भासेयाताम्', 'भासेरन्' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भासिषीय', 'भासिषीवहि', 'भासिषीमहि' ],
           '2': [ 'भासिषीष्ठाः', 'भासिषीयास्थाम्', 'भासिषीध्वम्' ],
           '3': [ 'भासिषीष्ट', 'भासिषीयास्ताम्', 'भासिषीरन्' ] },
        'लुङ्': 
         { '1': [ 'अभासिषि', 'अभासिष्वहि', 'अभासिष्महि' ],
           '2': [ 'अभासिष्ठाः', 'अभासिषाथाम्', 'अभासिध्वम्/अभासिढ्वम्' ],
           '3': [ 'अभासिष्ट', 'अभासिषाताम्', 'अभासिषत' ] },
        'लृङ्': 
         { '1': [ 'अभासिष्ये', 'अभासिष्यावहि', 'अभासिष्यामहि' ],
           '2': [ 'अभासिष्यथाः', 'अभासिष्येथाम्', 'अभासिष्यध्वम्' ],
           '3': [ 'अभासिष्यत', 'अभासिष्येताम्', 'अभासिष्यन्त' ] } } } },
{ key: 'BI-Baye-juhotyAdiH-1650',
  num: 1650,
  dhatu: 'भी',
  dp: 'ञिभी॒',
  dpc: 'भी',
  gana: 3,
  artha: 'भये',
  set: false,
  la: 
   { par: 
      { 'लट्': 
         { '1': [ 'बिभेमि', 'बिभिवः/बिभीवः', 'बिभिमः/बिभीमः' ],
           '2': [ 'बिभेषि', 'बिभिथः/बिभीथः', 'बिभिथ/बिभीथ' ],
           '3': [ 'बिभेति', 'बिभितः/बिभीतः', 'बिभ्यति' ] },
        'लिट्': 
         { '1': 
            [ 'बिभाय/बिभय/बिभयामास/बिभयाम्बभूव/बिभयाञ्चकर/बिभयाञ्चकार',
              'बिभ्यिव/बिभयामासिव/बिभयाञ्चकृव/बिभयाम्बभूविव',
              'बिभ्यिम/बिभयामासिम/बिभयाञ्चकृम/बिभयाम्बभूविम' ],
           '2': 
            [ 'बिभयिथ/बिभेथ/बिभयामासिथ/बिभयाञ्चकर्थ/बिभयाम्बभूविथ',
              'बिभ्यथुः/बिभयामासथुः/बिभयाञ्चक्रथुः/बिभयाम्बभूवथुः',
              'बिभय/बिभयामास/बिभयाञ्चक्र/बिभयाम्बभूव' ],
           '3': 
            [ 'बिभाय/बिभयामास/बिभयाम्बभूव/बिभयाञ्चकार',
              'बिभ्यतुः/बिभयामासतुः/बिभयाञ्चक्रतुः/बिभयाम्बभूवतुः',
              'बिभ्युः/बिभयामासुः/बिभयाञ्चक्रुः/बिभयाम्बभूवुः' ] },
        'लुट्': 
         { '1': [ 'भेतास्मि', 'भेतास्वः', 'भेतास्मः' ],
           '2': [ 'भेतासि', 'भेतास्थः', 'भेतास्थ' ],
           '3': [ 'भेता', 'भेतारौ', 'भेतारः' ] },
        'लृट्': 
         { '1': [ 'भेष्यामि', 'भेष्यावः', 'भेष्यामः' ],
           '2': [ 'भेष्यसि', 'भेष्यथः', 'भेष्यथ' ],
           '3': [ 'भेष्यति', 'भेष्यतः', 'भेष्यन्ति' ] },
        'लोट्': 
         { '1': [ 'बिभयानि', 'बिभयाव', 'बिभयाम' ],
           '2': 
            [ 'बिभितात्/बिभिहि/बिभीतात्/बिभीहि',
              'बिभितम्/बिभीतम्',
              'बिभित/बिभीत' ],
           '3': [ 'बिभितात्/बिभेतु/बिभीतात्', 'बिभिताम्/बिभीताम्', 'बिभ्यतु' ] },
        'लङ्': 
         { '1': [ 'अबिभयम्', 'अबिभिव/अबिभीव', 'अबिभिम/अबिभीम' ],
           '2': [ 'अबिभेः', 'अबिभितम्/अबिभीतम्', 'अबिभित/अबिभीत' ],
           '3': [ 'अबिभेत्', 'अबिभिताम्/अबिभीताम्', 'अबिभयुः' ] },
        'विधिलिङ्': 
         { '1': [ 'बिभियाम्/बिभीयाम्', 'बिभियाव/बिभीयाव', 'बिभियाम/बिभीयाम' ],
           '2': [ 'बिभियाः/बिभीयाः', 'बिभियातम्/बिभीयातम्', 'बिभियात/बिभीयात' ],
           '3': 
            [ 'बिभियात्/बिभीयात्',
              'बिभियाताम्/बिभीयाताम्',
              'बिभियुः/बिभीयुः' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भीयासम्', 'भीयास्व', 'भीयास्म' ],
           '2': [ 'भीयाः', 'भीयास्तम्', 'भीयास्त' ],
           '3': [ 'भीयात्', 'भीयास्ताम्', 'भीयासुः' ] },
        'लुङ्': 
         { '1': [ 'अभैषम्', 'अभैष्व', 'अभैष्म' ],
           '2': [ 'अभैषीः', 'अभैष्टम्', 'अभैष्ट' ],
           '3': [ 'अभैषीत्', 'अभैष्टाम्', 'अभैषुः' ] },
        'लृङ्': 
         { '1': [ 'अभेष्यम्', 'अभेष्याव', 'अभेष्याम' ],
           '2': [ 'अभेष्यः', 'अभेष्यतम्', 'अभेष्यत' ],
           '3': [ 'अभेष्यत्', 'अभेष्यताम्', 'अभेष्यन्' ] } },
     atm: {} } },
{ key: 'BI-Baye-juhotyAdiH-1659',
  num: 1659,
  dhatu: 'भी',
  dp: 'ञि॒भी॒',
  dpc: 'भी',
  gana: 3,
  artha: 'भये',
  set: false,
  la: 
   { par: 
      { 'लट्': 
         { '1': [ 'बिभेमि', 'बिभिवः/बिभीवः', 'बिभिमः/बिभीमः' ],
           '2': [ 'बिभेषि', 'बिभिथः/बिभीथः', 'बिभिथ/बिभीथ' ],
           '3': [ 'बिभेति', 'बिभितः/बिभीतः', 'बिभ्यति' ] },
        'लिट्': 
         { '1': 
            [ 'बिभाय/बिभय/बिभयामास/बिभयाम्बभूव/बिभयाञ्चकर/बिभयाञ्चकार',
              'बिभ्यिव/बिभयामासिव/बिभयाञ्चकृव/बिभयाम्बभूविव',
              'बिभ्यिम/बिभयामासिम/बिभयाञ्चकृम/बिभयाम्बभूविम' ],
           '2': 
            [ 'बिभयिथ/बिभेथ/बिभयामासिथ/बिभयाञ्चकर्थ/बिभयाम्बभूविथ',
              'बिभ्यथुः/बिभयामासथुः/बिभयाञ्चक्रथुः/बिभयाम्बभूवथुः',
              'बिभय/बिभयामास/बिभयाञ्चक्र/बिभयाम्बभूव' ],
           '3': 
            [ 'बिभाय/बिभयामास/बिभयाम्बभूव/बिभयाञ्चकार',
              'बिभ्यतुः/बिभयामासतुः/बिभयाञ्चक्रतुः/बिभयाम्बभूवतुः',
              'बिभ्युः/बिभयामासुः/बिभयाञ्चक्रुः/बिभयाम्बभूवुः' ] },
        'लुट्': 
         { '1': [ 'भेतास्मि', 'भेतास्वः', 'भेतास्मः' ],
           '2': [ 'भेतासि', 'भेतास्थः', 'भेतास्थ' ],
           '3': [ 'भेता', 'भेतारौ', 'भेतारः' ] },
        'लृट्': 
         { '1': [ 'भेष्यामि', 'भेष्यावः', 'भेष्यामः' ],
           '2': [ 'भेष्यसि', 'भेष्यथः', 'भेष्यथ' ],
           '3': [ 'भेष्यति', 'भेष्यतः', 'भेष्यन्ति' ] },
        'लोट्': 
         { '1': [ 'बिभयानि', 'बिभयाव', 'बिभयाम' ],
           '2': 
            [ 'बिभितात्/बिभिहि/बिभीतात्/बिभीहि',
              'बिभितम्/बिभीतम्',
              'बिभित/बिभीत' ],
           '3': [ 'बिभितात्/बिभेतु/बिभीतात्', 'बिभिताम्/बिभीताम्', 'बिभ्यतु' ] },
        'लङ्': 
         { '1': [ 'अबिभयम्', 'अबिभिव/अबिभीव', 'अबिभिम/अबिभीम' ],
           '2': [ 'अबिभेः', 'अबिभितम्/अबिभीतम्', 'अबिभित/अबिभीत' ],
           '3': [ 'अबिभेत्', 'अबिभिताम्/अबिभीताम्', 'अबिभयुः' ] },
        'विधिलिङ्': 
         { '1': [ 'बिभियाम्/बिभीयाम्', 'बिभियाव/बिभीयाव', 'बिभियाम/बिभीयाम' ],
           '2': [ 'बिभियाः/बिभीयाः', 'बिभियातम्/बिभीयातम्', 'बिभियात/बिभीयात' ],
           '3': 
            [ 'बिभियात्/बिभीयात्',
              'बिभियाताम्/बिभीयाताम्',
              'बिभियुः/बिभीयुः' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भीयासम्', 'भीयास्व', 'भीयास्म' ],
           '2': [ 'भीयाः', 'भीयास्तम्', 'भीयास्त' ],
           '3': [ 'भीयात्', 'भीयास्ताम्', 'भीयासुः' ] },
        'लुङ्': 
         { '1': [ 'अभैषम्', 'अभैष्व', 'अभैष्म' ],
           '2': [ 'अभैषीः', 'अभैष्टम्', 'अभैष्ट' ],
           '3': [ 'अभैषीत्', 'अभैष्टाम्', 'अभैषुः' ] },
        'लृङ्': 
         { '1': [ 'अभेष्यम्', 'अभेष्याव', 'अभेष्याम' ],
           '2': [ 'अभेष्यः', 'अभेष्यतम्', 'अभेष्यत' ],
           '3': [ 'अभेष्यत्', 'अभेष्यताम्', 'अभेष्यन्' ] } },
     atm: {} } },
{ key: 'BU-prAptO-curAdiH-2748',
  num: 2748,
  dhatu: 'भू',
  dp: 'भू',
  dpc: 'भू',
  gana: 10,
  artha: 'प्राप्तौ',
  set: true,
  la: 
   { par: {},
     atm: 
      { 'लट्': 
         { '1': [ 'भवे/भावये', 'भवावहे/भावयावहे', 'भवामहे/भावयामहे' ],
           '2': [ 'भवसे/भावयसे', 'भवेथे/भावयेथे', 'भवध्वे/भावयध्वे' ],
           '3': [ 'भवते/भावयते', 'भवेते/भावयेते', 'भवन्ते/भावयन्ते' ] },
        'लिट्': 
         { '1': 
            [ 'भावयामास/भावयाञ्चक्रे/भावयाम्बभूव',
              'भावयामासिव/भावयाम्बभूविव/भावयाञ्चकृवहे',
              'भावयामासिम/भावयाम्बभूविम/भावयाञ्चकृमहे' ],
           '2': 
            [ 'भावयामासिथ/भावयाञ्चकृषे/भावयाम्बभूविथ',
              'भावयामासथुः/भावयाञ्चक्राथे/भावयाम्बभूवथुः',
              'भावयामास/भावयाम्बभूव/भावयाञ्चकृढ्वे' ],
           '3': 
            [ 'भावयामास/भावयाञ्चक्रे/भावयाम्बभूव',
              'भावयामासतुः/भावयाञ्चक्राते/भावयाम्बभूवतुः',
              'भावयामासुः/भावयाम्बभूवुः/भावयाञ्चक्रिरे' ] },
        'लुट्': 
         { '1': [ 'भावयिताहे', 'भावयितास्वहे', 'भावयितास्महे' ],
           '2': [ 'भावयितासे', 'भावयितासाथे', 'भावयिताध्वे' ],
           '3': [ 'भावयिता', 'भावयितारौ', 'भावयितारः' ] },
        'लृट्': 
         { '1': [ 'भावयिष्ये', 'भावयिष्यावहे', 'भावयिष्यामहे' ],
           '2': [ 'भावयिष्यसे', 'भावयिष्येथे', 'भावयिष्यध्वे' ],
           '3': [ 'भावयिष्यते', 'भावयिष्येते', 'भावयिष्यन्ते' ] },
        'लोट्': 
         { '1': [ 'भावयै', 'भावयावहै', 'भावयामहै' ],
           '2': [ 'भावयस्व', 'भावयेथाम्', 'भावयध्वम्' ],
           '3': [ 'भावयताम्', 'भावयेताम्', 'भावयन्ताम्' ] },
        'लङ्': 
         { '1': [ 'अभावये', 'अभावयावहि', 'अभावयामहि' ],
           '2': [ 'अभावयथाः', 'अभावयेथाम्', 'अभावयध्वम्' ],
           '3': [ 'अभावयत', 'अभावयेताम्', 'अभावयन्त' ] },
        'विधिलिङ्': 
         { '1': [ 'भावयेय', 'भावयेवहि', 'भावयेमहि' ],
           '2': [ 'भावयेथाः', 'भावयेयाथाम्', 'भावयेध्वम्' ],
           '3': [ 'भावयेत', 'भावयेयाताम्', 'भावयेरन्' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भावयिषीय', 'भावयिषीवहि', 'भावयिषीमहि' ],
           '2': [ 'भावयिषीष्ठाः', 'भावयिषीयास्थाम्', 'भावयिषीध्वम्' ],
           '3': [ 'भावयिषीष्ट', 'भावयिषीयास्ताम्', 'भावयिषीरन्' ] },
        'लुङ्': 
         { '1': [ 'अबीभवे', 'अबीभवावहि', 'अबीभवामहि' ],
           '2': [ 'अबीभवथाः', 'अबीभवेथाम्', 'अबीभवध्वम्' ],
           '3': [ 'अबीभवत', 'अबीभवेताम्', 'अबीभवन्त' ] },
        'लृङ्': 
         { '1': [ 'अभावयिष्ये', 'अभावयिष्यावहि', 'अभावयिष्यामहि' ],
           '2': [ 'अभावयिष्यथाः', 'अभावयिष्येथाम्', 'अभावयिष्यध्वम्' ],
           '3': [ 'अभावयिष्यत', 'अभावयिष्येताम्', 'अभावयिष्यन्त' ] } } } },
{ key: 'BU-prAptO-curAdiH-3161',
  num: 3161,
  dhatu: 'भू',
  dp: 'भू',
  dpc: 'भू',
  gana: 10,
  artha: 'प्राप्तौ',
  set: true,
  la: 
   { par: {},
     atm: 
      { 'लट्': 
         { '1': [ 'भवे/भावये', 'भवावहे/भावयावहे', 'भवामहे/भावयामहे' ],
           '2': [ 'भवसे/भावयसे', 'भवेथे/भावयेथे', 'भवध्वे/भावयध्वे' ],
           '3': [ 'भवते/भावयते', 'भवेते/भावयेते', 'भवन्ते/भावयन्ते' ] },
        'लिट्': 
         { '1': 
            [ 'भावयामास/भावयाञ्चक्रे/भावयाम्बभूव',
              'भावयामासिव/भावयाम्बभूविव/भावयाञ्चकृवहे',
              'भावयामासिम/भावयाम्बभूविम/भावयाञ्चकृमहे' ],
           '2': 
            [ 'भावयामासिथ/भावयाञ्चकृषे/भावयाम्बभूविथ',
              'भावयामासथुः/भावयाञ्चक्राथे/भावयाम्बभूवथुः',
              'भावयामास/भावयाम्बभूव/भावयाञ्चकृढ्वे' ],
           '3': 
            [ 'भावयामास/भावयाञ्चक्रे/भावयाम्बभूव',
              'भावयामासतुः/भावयाञ्चक्राते/भावयाम्बभूवतुः',
              'भावयामासुः/भावयाम्बभूवुः/भावयाञ्चक्रिरे' ] },
        'लुट्': 
         { '1': [ 'भावयिताहे', 'भावयितास्वहे', 'भावयितास्महे' ],
           '2': [ 'भावयितासे', 'भावयितासाथे', 'भावयिताध्वे' ],
           '3': [ 'भावयिता', 'भावयितारौ', 'भावयितारः' ] },
        'लृट्': 
         { '1': [ 'भावयिष्ये', 'भावयिष्यावहे', 'भावयिष्यामहे' ],
           '2': [ 'भावयिष्यसे', 'भावयिष्येथे', 'भावयिष्यध्वे' ],
           '3': [ 'भावयिष्यते', 'भावयिष्येते', 'भावयिष्यन्ते' ] },
        'लोट्': 
         { '1': [ 'भावयै', 'भावयावहै', 'भावयामहै' ],
           '2': [ 'भावयस्व', 'भावयेथाम्', 'भावयध्वम्' ],
           '3': [ 'भावयताम्', 'भावयेताम्', 'भावयन्ताम्' ] },
        'लङ्': 
         { '1': [ 'अभावये', 'अभावयावहि', 'अभावयामहि' ],
           '2': [ 'अभावयथाः', 'अभावयेथाम्', 'अभावयध्वम्' ],
           '3': [ 'अभावयत', 'अभावयेताम्', 'अभावयन्त' ] },
        'विधिलिङ्': 
         { '1': [ 'भावयेय', 'भावयेवहि', 'भावयेमहि' ],
           '2': [ 'भावयेथाः', 'भावयेयाथाम्', 'भावयेध्वम्' ],
           '3': [ 'भावयेत', 'भावयेयाताम्', 'भावयेरन्' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भावयिषीय', 'भावयिषीवहि', 'भावयिषीमहि' ],
           '2': [ 'भावयिषीष्ठाः', 'भावयिषीयास्थाम्', 'भावयिषीध्वम्' ],
           '3': [ 'भावयिषीष्ट', 'भावयिषीयास्ताम्', 'भावयिषीरन्' ] },
        'लुङ्': 
         { '1': [ 'अबीभवे', 'अबीभवावहि', 'अबीभवामहि' ],
           '2': [ 'अबीभवथाः', 'अबीभवेथाम्', 'अबीभवध्वम्' ],
           '3': [ 'अबीभवत', 'अबीभवेताम्', 'अबीभवन्त' ] },
        'लृङ्': 
         { '1': [ 'अभावयिष्ये', 'अभावयिष्यावहि', 'अभावयिष्यामहि' ],
           '2': [ 'अभावयिष्यथाः', 'अभावयिष्येथाम्', 'अभावयिष्यध्वम्' ],
           '3': [ 'अभावयिष्यत', 'अभावयिष्येताम्', 'अभावयिष्यन्त' ] } } } },
{ key: 'BU-sattAyAm-BvAdiH-1',
  num: 1,
  dhatu: 'भू',
  dp: 'भू',
  dpc: 'भू',
  gana: 1,
  artha: 'सत्तायाम्',
  set: true,
  la: 
   { par: 
      { 'लट्': 
         { '1': [ 'भवामि', 'भवावः', 'भवामः' ],
           '2': [ 'भवसि', 'भवथः', 'भवथ' ],
           '3': [ 'भवति', 'भवतः', 'भवन्ति' ] },
        'लिट्': 
         { '1': [ 'बभूव', 'बभूविव', 'बभूविम' ],
           '2': [ 'बभूविथ', 'बभूवथुः', 'बभूव' ],
           '3': [ 'बभूव', 'बभूवतुः', 'बभूवुः' ] },
        'लुट्': 
         { '1': [ 'भवितास्मि', 'भवितास्वः', 'भवितास्मः' ],
           '2': [ 'भवितासि', 'भवितास्थः', 'भवितास्थ' ],
           '3': [ 'भविता', 'भवितारौ', 'भवितारः' ] },
        'लृट्': 
         { '1': [ 'भविष्यामि', 'भविष्यावः', 'भविष्यामः' ],
           '2': [ 'भविष्यसि', 'भविष्यथः', 'भविष्यथ' ],
           '3': [ 'भविष्यति', 'भविष्यतः', 'भविष्यन्ति' ] },
        'लोट्': 
         { '1': [ 'भवानि', 'भवाव', 'भवाम' ],
           '2': [ 'भव/भवतात्', 'भवतम्', 'भवत' ],
           '3': [ 'भवतु/भवतात्', 'भवताम्', 'भवन्तु' ] },
        'लङ्': 
         { '1': [ 'अभवम्', 'अभवाव', 'अभवाम' ],
           '2': [ 'अभवः', 'अभवतम्', 'अभवत' ],
           '3': [ 'अभवत्', 'अभवताम्', 'अभवन्' ] },
        'विधिलिङ्': 
         { '1': [ 'भवेयम्', 'भवेव', 'भवेम' ],
           '2': [ 'भवेः', 'भवेतम्', 'भवेत' ],
           '3': [ 'भवेत्', 'भवेताम्', 'भवेयुः' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भूयासम्', 'भूयास्व', 'भूयास्म' ],
           '2': [ 'भूयाः', 'भूयास्तम्', 'भूयास्त' ],
           '3': [ 'भूयात्', 'भूयास्ताम्', 'भूयासुः' ] },
        'लुङ्': 
         { '1': [ 'अभूवम्', 'अभूव', 'अभूम' ],
           '2': [ 'अभूः', 'अभूतम्', 'अभूत' ],
           '3': [ 'अभूत्', 'अभूताम्', 'अभूवन्' ] },
        'लृङ्': 
         { '1': [ 'अभविष्यम्', 'अभविष्याव', 'अभविष्याम' ],
           '2': [ 'अभविष्यः', 'अभविष्यतम्', 'अभविष्यत' ],
           '3': [ 'अभविष्यत्', 'अभविष्यताम्', 'अभविष्यन्' ] } },
     atm: {} } },
{ key: 'BUz-alaNkAre-BvAdiH-1032',
  num: 1032,
  dhatu: 'भूष्',
  dp: 'भूषँ',
  dpc: 'भूष्',
  gana: 1,
  artha: 'अलङ्कारे',
  set: true,
  la: 
   { par: 
      { 'लट्': 
         { '1': [ 'भूषामि', 'भूषावः', 'भूषामः' ],
           '2': [ 'भूषसि', 'भूषथः', 'भूषथ' ],
           '3': [ 'भूषति', 'भूषतः', 'भूषन्ति' ] },
        'लिट्': 
         { '1': [ 'बुभूष', 'बुभूषिव', 'बुभूषिम' ],
           '2': [ 'बुभूषिथ', 'बुभूषथुः', 'बुभूष' ],
           '3': [ 'बुभूष', 'बुभूषतुः', 'बुभूषुः' ] },
        'लुट्': 
         { '1': [ 'भूषितास्मि', 'भूषितास्वः', 'भूषितास्मः' ],
           '2': [ 'भूषितासि', 'भूषितास्थः', 'भूषितास्थ' ],
           '3': [ 'भूषिता', 'भूषितारौ', 'भूषितारः' ] },
        'लृट्': 
         { '1': [ 'भूषिष्यामि', 'भूषिष्यावः', 'भूषिष्यामः' ],
           '2': [ 'भूषिष्यसि', 'भूषिष्यथः', 'भूषिष्यथ' ],
           '3': [ 'भूषिष्यति', 'भूषिष्यतः', 'भूषिष्यन्ति' ] },
        'लोट्': 
         { '1': [ 'भूषाणि', 'भूषाव', 'भूषाम' ],
           '2': [ 'भूष/भूषतात्', 'भूषतम्', 'भूषत' ],
           '3': [ 'भूषतात्/भूषतु', 'भूषताम्', 'भूषन्तु' ] },
        'लङ्': 
         { '1': [ 'अभूषम्', 'अभूषाव', 'अभूषाम' ],
           '2': [ 'अभूषः', 'अभूषतम्', 'अभूषत' ],
           '3': [ 'अभूषत्', 'अभूषताम्', 'अभूषन्' ] },
        'विधिलिङ्': 
         { '1': [ 'भूषेयम्', 'भूषेव', 'भूषेम' ],
           '2': [ 'भूषेः', 'भूषेतम्', 'भूषेत' ],
           '3': [ 'भूषेत्', 'भूषेताम्', 'भूषेयुः' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भूष्यासम्', 'भूष्यास्व', 'भूष्यास्म' ],
           '2': [ 'भूष्याः', 'भूष्यास्तम्', 'भूष्यास्त' ],
           '3': [ 'भूष्यात्', 'भूष्यास्ताम्', 'भूष्यासुः' ] },
        'लुङ्': 
         { '1': [ 'अभूषिषम्', 'अभूषिष्व', 'अभूषिष्म' ],
           '2': [ 'अभूषीः', 'अभूषिष्टम्', 'अभूषिष्ट' ],
           '3': [ 'अभूषीत्', 'अभूषिष्टाम्', 'अभूषिषुः' ] },
        'लृङ्': 
         { '1': [ 'अभूषिष्यम्', 'अभूषिष्याव', 'अभूषिष्याम' ],
           '2': [ 'अभूषिष्यः', 'अभूषिष्यतम्', 'अभूषिष्यत' ],
           '3': [ 'अभूषिष्यत्', 'अभूषिष्यताम्', 'अभूषिष्यन्' ] } },
     atm: {} } },
{ key: 'BUz-alaNkAre-curAdiH-2634',
  num: 2634,
  dhatu: 'भूष्',
  dp: 'भूषँ॑',
  dpc: 'भूष्',
  gana: 10,
  artha: 'अलङ्कारे',
  set: true,
  la: 
   { par: 
      { 'लट्': 
         { '1': [ 'भूषयामि', 'भूषयावः', 'भूषयामः' ],
           '2': [ 'भूषयसि', 'भूषयथः', 'भूषयथ' ],
           '3': [ 'भूषयति', 'भूषयतः', 'भूषयन्ति' ] },
        'लिट्': 
         { '1': 
            [ 'भूषयामास/भूषयाम्बभूव/भूषयाञ्चकर/भूषयाञ्चकार',
              'भूषयामासिव/भूषयाञ्चकृव/भूषयाम्बभूविव',
              'भूषयामासिम/भूषयाञ्चकृम/भूषयाम्बभूविम' ],
           '2': 
            [ 'भूषयामासिथ/भूषयाञ्चकर्थ/भूषयाम्बभूविथ',
              'भूषयामासथुः/भूषयाञ्चक्रथुः/भूषयाम्बभूवथुः',
              'भूषयामास/भूषयाञ्चक्र/भूषयाम्बभूव' ],
           '3': 
            [ 'भूषयामास/भूषयाम्बभूव/भूषयाञ्चकार',
              'भूषयामासतुः/भूषयाञ्चक्रतुः/भूषयाम्बभूवतुः',
              'भूषयामासुः/भूषयाञ्चक्रुः/भूषयाम्बभूवुः' ] },
        'लुट्': 
         { '1': [ 'भूषयितास्मि', 'भूषयितास्वः', 'भूषयितास्मः' ],
           '2': [ 'भूषयितासि', 'भूषयितास्थः', 'भूषयितास्थ' ],
           '3': [ 'भूषयिता', 'भूषयितारौ', 'भूषयितारः' ] },
        'लृट्': 
         { '1': [ 'भूषयिष्यामि', 'भूषयिष्यावः', 'भूषयिष्यामः' ],
           '2': [ 'भूषयिष्यसि', 'भूषयिष्यथः', 'भूषयिष्यथ' ],
           '3': [ 'भूषयिष्यति', 'भूषयिष्यतः', 'भूषयिष्यन्ति' ] },
        'लोट्': 
         { '1': [ 'भूषयाणि', 'भूषयाव', 'भूषयाम' ],
           '2': [ 'भूषय/भूषयतात्', 'भूषयतम्', 'भूषयत' ],
           '3': [ 'भूषयतात्/भूषयतु', 'भूषयताम्', 'भूषयन्तु' ] },
        'लङ्': 
         { '1': [ 'अभूषयम्', 'अभूषयाव', 'अभूषयाम' ],
           '2': [ 'अभूषयः', 'अभूषयतम्', 'अभूषयत' ],
           '3': [ 'अभूषयत्', 'अभूषयताम्', 'अभूषयन्' ] },
        'विधिलिङ्': 
         { '1': [ 'भूषयेयम्', 'भूषयेव', 'भूषयेम' ],
           '2': [ 'भूषयेः', 'भूषयेतम्', 'भूषयेत' ],
           '3': [ 'भूषयेत्', 'भूषयेताम्', 'भूषयेयुः' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भूष्यासम्', 'भूष्यास्व', 'भूष्यास्म' ],
           '2': [ 'भूष्याः', 'भूष्यास्तम्', 'भूष्यास्त' ],
           '3': [ 'भूष्यात्', 'भूष्यास्ताम्', 'भूष्यासुः' ] },
        'लुङ्': 
         { '1': [ 'अबूभुषम्', 'अबूभुषाव', 'अबूभुषाम' ],
           '2': [ 'अबूभुषः', 'अबूभुषतम्', 'अबूभुषत' ],
           '3': [ 'अबूभुषत्', 'अबूभुषताम्', 'अबूभुषन्' ] },
        'लृङ्': 
         { '1': [ 'अभूषयिष्यम्', 'अभूषयिष्याव', 'अभूषयिष्याम' ],
           '2': [ 'अभूषयिष्यः', 'अभूषयिष्यतम्', 'अभूषयिष्यत' ],
           '3': [ 'अभूषयिष्यत्', 'अभूषयिष्यताम्', 'अभूषयिष्यन्' ] } },
     atm: 
      { 'लट्': 
         { '1': [ 'भूषये', 'भूषयावहे', 'भूषयामहे' ],
           '2': [ 'भूषयसे', 'भूषयेथे', 'भूषयध्वे' ],
           '3': [ 'भूषयते', 'भूषयेते', 'भूषयन्ते' ] },
        'लिट्': 
         { '1': 
            [ 'भूषयामास/भूषयाञ्चक्रे/भूषयाम्बभूव',
              'भूषयामासिव/भूषयाम्बभूविव/भूषयाञ्चकृवहे',
              'भूषयामासिम/भूषयाम्बभूविम/भूषयाञ्चकृमहे' ],
           '2': 
            [ 'भूषयामासिथ/भूषयाञ्चकृषे/भूषयाम्बभूविथ',
              'भूषयामासथुः/भूषयाञ्चक्राथे/भूषयाम्बभूवथुः',
              'भूषयामास/भूषयाम्बभूव/भूषयाञ्चकृढ्वे' ],
           '3': 
            [ 'भूषयामास/भूषयाञ्चक्रे/भूषयाम्बभूव',
              'भूषयामासतुः/भूषयाञ्चक्राते/भूषयाम्बभूवतुः',
              'भूषयामासुः/भूषयाम्बभूवुः/भूषयाञ्चक्रिरे' ] },
        'लुट्': 
         { '1': [ 'भूषयिताहे', 'भूषयितास्वहे', 'भूषयितास्महे' ],
           '2': [ 'भूषयितासे', 'भूषयितासाथे', 'भूषयिताध्वे' ],
           '3': [ 'भूषयिता', 'भूषयितारौ', 'भूषयितारः' ] },
        'लृट्': 
         { '1': [ 'भूषयिष्ये', 'भूषयिष्यावहे', 'भूषयिष्यामहे' ],
           '2': [ 'भूषयिष्यसे', 'भूषयिष्येथे', 'भूषयिष्यध्वे' ],
           '3': [ 'भूषयिष्यते', 'भूषयिष्येते', 'भूषयिष्यन्ते' ] },
        'लोट्': 
         { '1': [ 'भूषयै', 'भूषयावहै', 'भूषयामहै' ],
           '2': [ 'भूषयस्व', 'भूषयेथाम्', 'भूषयध्वम्' ],
           '3': [ 'भूषयताम्', 'भूषयेताम्', 'भूषयन्ताम्' ] },
        'लङ्': 
         { '1': [ 'अभूषये', 'अभूषयावहि', 'अभूषयामहि' ],
           '2': [ 'अभूषयथाः', 'अभूषयेथाम्', 'अभूषयध्वम्' ],
           '3': [ 'अभूषयत', 'अभूषयेताम्', 'अभूषयन्त' ] },
        'विधिलिङ्': 
         { '1': [ 'भूषयेय', 'भूषयेवहि', 'भूषयेम/भूषयेमहि' ],
           '2': [ 'भूषयेथाः', 'भूषयेयाथाम्', 'भूषयेध्वम्' ],
           '3': [ 'भूषयेत', 'भूषयेयाताम्', 'भूषयेरन्' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भूषयिषीय', 'भूषयिषीवहि', 'भूषयिषीमहि' ],
           '2': [ 'भूषयिषीष्ठाः', 'भूषयिषीयास्थाम्', 'भूषयिषीध्वम्' ],
           '3': [ 'भूषयिषीष्ट', 'भूषयिषीयास्ताम्', 'भूषयिषीरन्' ] },
        'लुङ्': 
         { '1': [ 'अबूभुषे', 'अबूभुषावहि', 'अबूभुषामहि' ],
           '2': [ 'अबूभुषथाः', 'अबूभुषेथाम्', 'अबूभुषध्वम्' ],
           '3': [ 'अबूभुषत', 'अबूभुषेताम्', 'अबूभुषन्त' ] },
        'लृङ्': 
         { '1': [ 'अभूषयिष्ये', 'अभूषयिष्यावहि', 'अभूषयिष्यामहि' ],
           '2': [ 'अभूषयिष्यथाः', 'अभूषयिष्येथाम्', 'अभूषयिष्यध्वम्' ],
           '3': [ 'अभूषयिष्यत', 'अभूषयिष्येताम्', 'अभूषयिष्यन्त' ] } } } },
{ key: 'BaR-Sabde-BvAdiH-639',
  num: 639,
  dhatu: 'भण्',
  dp: 'भणँ',
  dpc: 'भण्',
  gana: 1,
  artha: 'शब्दे',
  set: true,
  la: 
   { par: 
      { 'लट्': 
         { '1': [ 'भणामि', 'भणावः', 'भणामः' ],
           '2': [ 'भणसि', 'भणथः', 'भणथ' ],
           '3': [ 'भणति', 'भणतः', 'भणन्ति' ] },
        'लिट्': 
         { '1': [ 'बभण/बभाण', 'बभणिव', 'बभणिम' ],
           '2': [ 'बभणिथ', 'बभणथुः', 'बभण' ],
           '3': [ 'बभाण', 'बभणतुः', 'बभणुः' ] },
        'लुट्': 
         { '1': [ 'भणितास्मि', 'भणितास्वः', 'भणितास्मः' ],
           '2': [ 'भणितासि', 'भणितास्थः', 'भणितास्थ' ],
           '3': [ 'भणिता', 'भणितारौ', 'भणितारः' ] },
        'लृट्': 
         { '1': [ 'भणिष्यामि', 'भणिष्यावः', 'भणिष्यामः' ],
           '2': [ 'भणिष्यसि', 'भणिष्यथः', 'भणिष्यथ' ],
           '3': [ 'भणिष्यति', 'भणिष्यतः', 'भणिष्यन्ति' ] },
        'लोट्': 
         { '1': [ 'भणानि', 'भणाव', 'भणाम' ],
           '2': [ 'भण/भणतात्', 'भणतम्', 'भणत' ],
           '3': [ 'भणतात्/भणतु', 'भणताम्', 'भणन्तु' ] },
        'लङ्': 
         { '1': [ 'अभणम्', 'अभणाव', 'अभणाम' ],
           '2': [ 'अभणः', 'अभणतम्', 'अभणत' ],
           '3': [ 'अभणत्', 'अभणताम्', 'अभणन्' ] },
        'विधिलिङ्': 
         { '1': [ 'भणेयम्', 'भणेव', 'भणेम' ],
           '2': [ 'भणेः', 'भणेतम्', 'भणेत' ],
           '3': [ 'भणेत्', 'भणेताम्', 'भणेयुः' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भण्यासम्', 'भण्यास्व', 'भण्यास्म' ],
           '2': [ 'भण्याः', 'भण्यास्तम्', 'भण्यास्त' ],
           '3': [ 'भण्यात्', 'भण्यास्ताम्', 'भण्यासुः' ] },
        'लुङ्': 
         { '1': [ 'अभणिषम्/अभाणिषम्', 'अभणिष्व/अभाणिष्व', 'अभणिष्म/अभाणिष्म' ],
           '2': [ 'अभणीः/अभाणीः', 'अभणिष्टम्/अभाणिष्टम्', 'अभणिष्ट/अभाणिष्ट' ],
           '3': 
            [ 'अभणीत्/अभाणीत्',
              'अभणिष्टाम्/अभाणिष्टाम्',
              'अभणिषुः/अभाणिषुः' ] },
        'लृङ्': 
         { '1': [ 'अभणिष्यम्', 'अभणिष्याव', 'अभणिष्याम' ],
           '2': [ 'अभणिष्यः', 'अभणिष्यतम्', 'अभणिष्यत' ],
           '3': [ 'अभणिष्यत्', 'अभणिष्यताम्', 'अभणिष्यन्' ] } },
     atm: {} } },
{ key: 'Baj-BAzArTe-curAdiH-2679',
  num: 2679,
  dhatu: 'भञ्ज्',
  dp: 'भजिँ॑',
  dpc: 'भज्',
  gana: 10,
  artha: 'भाषार्थे',
  set: true,
  la: 
   { par: 
      { 'लट्': 
         { '1': [ 'भञ्जयामि/भञ्जामि', 'भञ्जयावः/भञ्जावः', 'भञ्जयामः/भञ्जामः' ],
           '2': [ 'भञ्जसि/भञ्जयसि', 'भञ्जथः/भञ्जयथः', 'भञ्जथ/भञ्जयथ' ],
           '3': [ 'भञ्जति/भञ्जयति', 'भञ्जतः/भञ्जयतः', 'भञ्जन्ति/भञ्जयन्ति' ] },
        'लिट्': 
         { '1': 
            [ 'बभञ्ज/भञ्जयामास/भञ्जयाम्बभूव/भञ्जयाञ्चकर/भञ्जयाञ्चकार',
              'बभञ्जिव/भञ्जयामासिव/भञ्जयाञ्चकृव/भञ्जयाम्बभूविव',
              'बभञ्जिम/भञ्जयामासिम/भञ्जयाञ्चकृम/भञ्जयाम्बभूविम' ],
           '2': 
            [ 'बभञ्जिथ/भञ्जयामासिथ/भञ्जयाञ्चकर्थ/भञ्जयाम्बभूविथ',
              'बभञ्जथुः/भञ्जयामासथुः/भञ्जयाञ्चक्रथुः/भञ्जयाम्बभूवथुः',
              'बभञ्ज/भञ्जयामास/भञ्जयाञ्चक्र/भञ्जयाम्बभूव' ],
           '3': 
            [ 'बभञ्ज/भञ्जयामास/भञ्जयाम्बभूव/भञ्जयाञ्चकार',
              'बभञ्जतुः/भञ्जयामासतुः/भञ्जयाञ्चक्रतुः/भञ्जयाम्बभूवतुः',
              'बभञ्जुः/भञ्जयामासुः/भञ्जयाञ्चक्रुः/भञ्जयाम्बभूवुः' ] },
        'लुट्': 
         { '1': 
            [ 'भञ्जयितास्मि/भञ्जितास्मि',
              'भञ्जयितास्वः/भञ्जितास्वः',
              'भञ्जयितास्मः/भञ्जितास्मः' ],
           '2': 
            [ 'भञ्जयितासि/भञ्जितासि',
              'भञ्जयितास्थः/भञ्जितास्थः',
              'भञ्जयितास्थ/भञ्जितास्थ' ],
           '3': 
            [ 'भञ्जयिता/भञ्जिता',
              'भञ्जयितारौ/भञ्जितारौ',
              'भञ्जयितारः/भञ्जितारः' ] },
        'लृट्': 
         { '1': 
            [ 'भञ्जयिष्यामि/भञ्जिष्यामि',
              'भञ्जयिष्यावः/भञ्जिष्यावः',
              'भञ्जयिष्यामः/भञ्जिष्यामः' ],
           '2': 
            [ 'भञ्जयिष्यसि/भञ्जिष्यसि',
              'भञ्जयिष्यथः/भञ्जिष्यथः',
              'भञ्जयिष्यथ/भञ्जिष्यथ' ],
           '3': 
            [ 'भञ्जयिष्यति/भञ्जिष्यति',
              'भञ्जयिष्यतः/भञ्जिष्यतः',
              'भञ्जयिष्यन्ति/भञ्जिष्यन्ति' ] },
        'लोट्': 
         { '1': [ 'भञ्जयानि/भञ्जानि', 'भञ्जयाव/भञ्जाव', 'भञ्जयाम/भञ्जाम' ],
           '2': 
            [ 'भञ्ज/भञ्जतात्/भञ्जय/भञ्जयतात्',
              'भञ्जतम्/भञ्जयतम्',
              'भञ्जत/भञ्जयत' ],
           '3': 
            [ 'भञ्जतात्/भञ्जतु/भञ्जयतात्/भञ्जयतु',
              'भञ्जताम्/भञ्जयताम्',
              'भञ्जन्तु/भञ्जयन्तु' ] },
        'लङ्': 
         { '1': [ 'अभञ्जम्', 'अभञ्जाव/अभञ्जयाव', 'अभञ्जाम/अभञ्जयाम' ],
           '3': 
            [ 'अभञ्जत्/अभञ्जयत्',
              'अभञ्जताम्/अभञ्जयताम्',
              'अभञ्जन्/अभञ्जयन्' ] },
        'विधिलिङ्': 
         { '1': [ 'भञ्जयेयम्/भञ्जेयम्', 'भञ्जयेव/भञ्जेव', 'भञ्जयेम/भञ्जेम' ],
           '2': [ 'भञ्जयेः/भञ्जेः', 'भञ्जयेतम्/भञ्जेतम्', 'भञ्जयेत/भञ्जेत' ],
           '3': 
            [ 'भञ्जयेत्/भञ्जेत्',
              'भञ्जयेताम्/भञ्जेताम्',
              'भञ्जयेयुः/भञ्जेयुः' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भञ्ज्यासम्', 'भञ्ज्यास्व', 'भञ्ज्यास्म' ],
           '2': [ 'भञ्ज्याः', 'भञ्ज्यास्तम्', 'भञ्ज्यास्त' ],
           '3': [ 'भञ्ज्यात्', 'भञ्ज्यास्ताम्', 'भञ्ज्यासुः' ] },
        'लुङ्': 
         { '1': [ 'अबभञ्जम्', 'अबभञ्जाव', 'अबभञ्जाम' ],
           '2': [ 'अबभञ्जः', 'अबभञ्जतम्', 'अबभञ्जत' ],
           '3': [ 'अबभञ्जत्', 'अबभञ्जताम्', 'अबभञ्जन्' ] },
        'लृङ्': 
         { '1': 
            [ 'अभञ्जयिष्यम्/अभञ्जिष्यम्',
              'अभञ्जयिष्याव/अभञ्जिष्याव',
              'अभञ्जयिष्याम/अभञ्जिष्याम' ],
           '2': 
            [ 'अभञ्जयिष्यः/अभञ्जिष्यः',
              'अभञ्जिष्यतम्/अभञ्जयिष्यतम्',
              'अभञ्जयिष्यत/अभञ्जिष्यत' ],
           '3': 
            [ 'अभञ्जयिष्यत्/अभञ्जिष्यत्',
              'अभञ्जिष्यताम्/अभञ्जयिष्यताम्',
              'अभञ्जयिष्यन्/अभञ्जिष्यन्' ] } },
     atm: 
      { 'लट्': 
         { '1': [ 'भञ्जये', 'भञ्जयावहे', 'भञ्जयामहे' ],
           '2': [ 'भञ्जयसे', 'भञ्जयेथे', 'भञ्जयध्वे' ],
           '3': [ 'भञ्जयते', 'भञ्जयेते', 'भञ्जयन्ते' ] },
        'लिट्': 
         { '1': 
            [ 'भञ्जयामास/भञ्जयाञ्चक्रे/भञ्जयाम्बभूव',
              'भञ्जयामासिव/भञ्जयाम्बभूविव/भञ्जयाञ्चकृवहे',
              'भञ्जयामासिम/भञ्जयाम्बभूविम/भञ्जयाञ्चकृमहे' ],
           '2': 
            [ 'भञ्जयामासिथ/भञ्जयाञ्चकृषे/भञ्जयाम्बभूविथ',
              'भञ्जयामासथुः/भञ्जयाञ्चक्राथे/भञ्जयाम्बभूवथुः',
              'भञ्जयामास/भञ्जयाम्बभूव/भञ्जयाञ्चकृढ्वे' ],
           '3': 
            [ 'भञ्जयामास/भञ्जयाञ्चक्रे/भञ्जयाम्बभूव',
              'भञ्जयामासतुः/भञ्जयाञ्चक्राते/भञ्जयाम्बभूवतुः',
              'भञ्जयामासुः/भञ्जयाम्बभूवुः/भञ्जयाञ्चक्रिरे' ] },
        'लुट्': 
         { '1': [ 'भञ्जयिताहे', 'भञ्जयितास्वहे', 'भञ्जयितास्महे' ],
           '2': [ 'भञ्जयितासे', 'भञ्जयितासाथे', 'भञ्जयिताध्वे' ],
           '3': [ 'भञ्जयिता', 'भञ्जयितारौ', 'भञ्जयितारः' ] },
        'लृट्': 
         { '1': [ 'भञ्जयिष्ये', 'भञ्जयिष्यावहे', 'भञ्जयिष्यामहे' ],
           '2': [ 'भञ्जयिष्यसे', 'भञ्जयिष्येथे', 'भञ्जयिष्यध्वे' ],
           '3': [ 'भञ्जयिष्यते', 'भञ्जयिष्येते', 'भञ्जयिष्यन्ते' ] },
        'लोट्': 
         { '1': [ 'भञ्जयै', 'भञ्जयावहै', 'भञ्जयामहै' ],
           '2': [ 'भञ्जयस्व', 'भञ्जयेथाम्', 'भञ्जयध्वम्' ],
           '3': [ 'भञ्जयताम्', 'भञ्जयेताम्', 'भञ्जयन्ताम्' ] },
        'लङ्': 
         { '1': [ 'अभञ्जयम्/अभञ्जये', 'अभञ्जयावहि', 'अभञ्जयामहि' ],
           '2': [ 'अभञ्जयथाः', 'अभञ्जयेथाम्', 'अभञ्जत/अभञ्जयत/अभञ्जयध्वम्' ],
           '3': [ 'अभञ्जयत', 'अभञ्जयेताम्', 'अभञ्जयन्त' ] },
        'विधिलिङ्': 
         { '1': [ 'भञ्जयेय', 'भञ्जयेवहि', 'भञ्जयेमहि' ],
           '2': [ 'भञ्जयेथाः', 'भञ्जयेयाथाम्', 'भञ्जयेध्वम्' ],
           '3': [ 'भञ्जयेत', 'भञ्जयेयाताम्', 'भञ्जयेरन्' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भञ्जयिषीय', 'भञ्जयिषीवहि', 'भञ्जयिषीमहि' ],
           '2': [ 'भञ्जयिषीष्ठाः', 'भञ्जयिषीयास्थाम्', 'भञ्जयिषीध्वम्' ],
           '3': [ 'भञ्जयिषीष्ट', 'भञ्जयिषीयास्ताम्', 'भञ्जयिषीरन्' ] },
        'लुङ्': 
         { '1': [ 'अबभञ्जे', 'अबभञ्जावहि', 'अबभञ्जामहि' ],
           '2': [ 'अबभञ्जथाः', 'अबभञ्जेथाम्', 'अबभञ्जध्वम्' ],
           '3': [ 'अबभञ्जत', 'अबभञ्जेताम्', 'अबभञ्जन्त' ] },
        'लृङ्': 
         { '1': [ 'अभञ्जयिष्ये', 'अभञ्जयिष्यावहि', 'अभञ्जयिष्यामहि' ],
           '2': [ 'अभञ्जयिष्यथाः', 'अभञ्जयिष्येथाम्', 'अभञ्जयिष्यध्वम्' ],
           '3': [ 'अभञ्जयिष्यत', 'अभञ्जयिष्येताम्', 'अभञ्जयिष्यन्त' ] } } } },
{ key: 'Baj-BAzArTe-curAdiH-3105',
  num: 3105,
  dhatu: 'भञ्ज्',
  dp: 'भजिँ',
  dpc: 'भज्',
  gana: 10,
  artha: 'भाषार्थे',
  set: true,
  la: 
   { par: 
      { 'लट्': 
         { '1': [ 'भञ्जयामि/भञ्जामि', 'भञ्जयावः/भञ्जावः', 'भञ्जयामः/भञ्जामः' ],
           '2': [ 'भञ्जसि/भञ्जयसि', 'भञ्जथः/भञ्जयथः', 'भञ्जथ/भञ्जयथ' ],
           '3': [ 'भञ्जति/भञ्जयति', 'भञ्जतः/भञ्जयतः', 'भञ्जन्ति/भञ्जयन्ति' ] },
        'लिट्': 
         { '1': 
            [ 'बभञ्ज/भञ्जयामास/भञ्जयाम्बभूव/भञ्जयाञ्चकर/भञ्जयाञ्चकार',
              'बभञ्जिव/भञ्जयामासिव/भञ्जयाञ्चकृव/भञ्जयाम्बभूविव',
              'बभञ्जिम/भञ्जयामासिम/भञ्जयाञ्चकृम/भञ्जयाम्बभूविम' ],
           '2': 
            [ 'बभञ्जिथ/भञ्जयामासिथ/भञ्जयाञ्चकर्थ/भञ्जयाम्बभूविथ',
              'बभञ्जथुः/भञ्जयामासथुः/भञ्जयाञ्चक्रथुः/भञ्जयाम्बभूवथुः',
              'बभञ्ज/भञ्जयामास/भञ्जयाञ्चक्र/भञ्जयाम्बभूव' ],
           '3': 
            [ 'बभञ्ज/भञ्जयामास/भञ्जयाम्बभूव/भञ्जयाञ्चकार',
              'बभञ्जतुः/भञ्जयामासतुः/भञ्जयाञ्चक्रतुः/भञ्जयाम्बभूवतुः',
              'बभञ्जुः/भञ्जयामासुः/भञ्जयाञ्चक्रुः/भञ्जयाम्बभूवुः' ] },
        'लुट्': 
         { '1': 
            [ 'भञ्जयितास्मि/भञ्जितास्मि',
              'भञ्जयितास्वः/भञ्जितास्वः',
              'भञ्जयितास्मः/भञ्जितास्मः' ],
           '2': 
            [ 'भञ्जयितासि/भञ्जितासि',
              'भञ्जयितास्थः/भञ्जितास्थः',
              'भञ्जयितास्थ/भञ्जितास्थ' ],
           '3': 
            [ 'भञ्जयिता/भञ्जिता',
              'भञ्जयितारौ/भञ्जितारौ',
              'भञ्जयितारः/भञ्जितारः' ] },
        'लृट्': 
         { '1': 
            [ 'भञ्जयिष्यामि/भञ्जिष्यामि',
              'भञ्जयिष्यावः/भञ्जिष्यावः',
              'भञ्जयिष्यामः/भञ्जिष्यामः' ],
           '2': 
            [ 'भञ्जयिष्यसि/भञ्जिष्यसि',
              'भञ्जयिष्यथः/भञ्जिष्यथः',
              'भञ्जयिष्यथ/भञ्जिष्यथ' ],
           '3': 
            [ 'भञ्जयिष्यति/भञ्जिष्यति',
              'भञ्जयिष्यतः/भञ्जिष्यतः',
              'भञ्जयिष्यन्ति/भञ्जिष्यन्ति' ] },
        'लोट्': 
         { '1': [ 'भञ्जयानि/भञ्जानि', 'भञ्जयाव/भञ्जाव', 'भञ्जयाम/भञ्जाम' ],
           '2': 
            [ 'भञ्ज/भञ्जतात्/भञ्जय/भञ्जयतात्',
              'भञ्जतम्/भञ्जयतम्',
              'भञ्जत/भञ्जयत' ],
           '3': 
            [ 'भञ्जतात्/भञ्जतु/भञ्जयतात्/भञ्जयतु',
              'भञ्जताम्/भञ्जयताम्',
              'भञ्जन्तु/भञ्जयन्तु' ] },
        'लङ्': 
         { '1': [ 'अभञ्जम्', 'अभञ्जाव/अभञ्जयाव', 'अभञ्जाम/अभञ्जयाम' ],
           '3': 
            [ 'अभञ्जत्/अभञ्जयत्',
              'अभञ्जताम्/अभञ्जयताम्',
              'अभञ्जन्/अभञ्जयन्' ] },
        'विधिलिङ्': 
         { '1': [ 'भञ्जयेयम्/भञ्जेयम्', 'भञ्जयेव/भञ्जेव', 'भञ्जयेम/भञ्जेम' ],
           '2': [ 'भञ्जयेः/भञ्जेः', 'भञ्जयेतम्/भञ्जेतम्', 'भञ्जयेत/भञ्जेत' ],
           '3': 
            [ 'भञ्जयेत्/भञ्जेत्',
              'भञ्जयेताम्/भञ्जेताम्',
              'भञ्जयेयुः/भञ्जेयुः' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भञ्ज्यासम्', 'भञ्ज्यास्व', 'भञ्ज्यास्म' ],
           '2': [ 'भञ्ज्याः', 'भञ्ज्यास्तम्', 'भञ्ज्यास्त' ],
           '3': [ 'भञ्ज्यात्', 'भञ्ज्यास्ताम्', 'भञ्ज्यासुः' ] },
        'लुङ्': 
         { '1': [ 'अबभञ्जम्', 'अबभञ्जाव', 'अबभञ्जाम' ],
           '2': [ 'अबभञ्जः', 'अबभञ्जतम्', 'अबभञ्जत' ],
           '3': [ 'अबभञ्जत्', 'अबभञ्जताम्', 'अबभञ्जन्' ] },
        'लृङ्': 
         { '1': 
            [ 'अभञ्जयिष्यम्/अभञ्जिष्यम्',
              'अभञ्जयिष्याव/अभञ्जिष्याव',
              'अभञ्जयिष्याम/अभञ्जिष्याम' ],
           '2': 
            [ 'अभञ्जयिष्यः/अभञ्जिष्यः',
              'अभञ्जिष्यतम्/अभञ्जयिष्यतम्',
              'अभञ्जयिष्यत/अभञ्जिष्यत' ],
           '3': 
            [ 'अभञ्जयिष्यत्/अभञ्जिष्यत्',
              'अभञ्जिष्यताम्/अभञ्जयिष्यताम्',
              'अभञ्जयिष्यन्/अभञ्जिष्यन्' ] } },
     atm: 
      { 'लट्': 
         { '1': [ 'भञ्जये', 'भञ्जयावहे', 'भञ्जयामहे' ],
           '2': [ 'भञ्जयसे', 'भञ्जयेथे', 'भञ्जयध्वे' ],
           '3': [ 'भञ्जयते', 'भञ्जयेते', 'भञ्जयन्ते' ] },
        'लिट्': 
         { '1': 
            [ 'भञ्जयामास/भञ्जयाञ्चक्रे/भञ्जयाम्बभूव',
              'भञ्जयामासिव/भञ्जयाम्बभूविव/भञ्जयाञ्चकृवहे',
              'भञ्जयामासिम/भञ्जयाम्बभूविम/भञ्जयाञ्चकृमहे' ],
           '2': 
            [ 'भञ्जयामासिथ/भञ्जयाञ्चकृषे/भञ्जयाम्बभूविथ',
              'भञ्जयामासथुः/भञ्जयाञ्चक्राथे/भञ्जयाम्बभूवथुः',
              'भञ्जयामास/भञ्जयाम्बभूव/भञ्जयाञ्चकृढ्वे' ],
           '3': 
            [ 'भञ्जयामास/भञ्जयाञ्चक्रे/भञ्जयाम्बभूव',
              'भञ्जयामासतुः/भञ्जयाञ्चक्राते/भञ्जयाम्बभूवतुः',
              'भञ्जयामासुः/भञ्जयाम्बभूवुः/भञ्जयाञ्चक्रिरे' ] },
        'लुट्': 
         { '1': [ 'भञ्जयिताहे', 'भञ्जयितास्वहे', 'भञ्जयितास्महे' ],
           '2': [ 'भञ्जयितासे', 'भञ्जयितासाथे', 'भञ्जयिताध्वे' ],
           '3': [ 'भञ्जयिता', 'भञ्जयितारौ', 'भञ्जयितारः' ] },
        'लृट्': 
         { '1': [ 'भञ्जयिष्ये', 'भञ्जयिष्यावहे', 'भञ्जयिष्यामहे' ],
           '2': [ 'भञ्जयिष्यसे', 'भञ्जयिष्येथे', 'भञ्जयिष्यध्वे' ],
           '3': [ 'भञ्जयिष्यते', 'भञ्जयिष्येते', 'भञ्जयिष्यन्ते' ] },
        'लोट्': 
         { '1': [ 'भञ्जयै', 'भञ्जयावहै', 'भञ्जयामहै' ],
           '2': [ 'भञ्जयस्व', 'भञ्जयेथाम्', 'भञ्जयध्वम्' ],
           '3': [ 'भञ्जयताम्', 'भञ्जयेताम्', 'भञ्जयन्ताम्' ] },
        'लङ्': 
         { '1': [ 'अभञ्जयम्/अभञ्जये', 'अभञ्जयावहि', 'अभञ्जयामहि' ],
           '2': [ 'अभञ्जयथाः', 'अभञ्जयेथाम्', 'अभञ्जत/अभञ्जयत/अभञ्जयध्वम्' ],
           '3': [ 'अभञ्जयत', 'अभञ्जयेताम्', 'अभञ्जयन्त' ] },
        'विधिलिङ्': 
         { '1': [ 'भञ्जयेय', 'भञ्जयेवहि', 'भञ्जयेमहि' ],
           '2': [ 'भञ्जयेथाः', 'भञ्जयेयाथाम्', 'भञ्जयेध्वम्' ],
           '3': [ 'भञ्जयेत', 'भञ्जयेयाताम्', 'भञ्जयेरन्' ] },
        'आशीर्लिङ्': 
         { '1': [ 'भञ्जयिषीय', 'भञ्जयिषीवहि', 'भञ्जयिषीमहि' ],
           '2': [ 'भञ्जयिषीष्ठाः', 'भञ्जयिषीयास्थाम्', 'भञ्जयिषीध्वम्' ],
           '3': [ 'भञ्जयिषीष्ट', 'भञ्जयिषीयास्ताम्', 'भञ्जयिषीरन्' ] },
        'लुङ्': 
         { '1': [ 'अबभञ्जे', 'अबभञ्जावहि', 'अबभञ्जामहि' ],
           '2': [ 'अबभञ्जथाः', 'अबभञ्जेथाम्', 'अबभञ्जध्वम्' ],
           '3': [ 'अबभञ्जत', 'अबभञ्जेताम्', 'अबभञ्जन्त' ] },
        'लृङ्': 
         { '1': [ 'अभञ्जयिष्ये', 'अभञ्जयिष्यावहि', 'अभञ्जयिष्यामहि' ],
           '2': [ 'अभञ्जयिष्यथाः', 'अभञ्जयिष्येथाम्', 'अभञ्जयिष्यध्वम्' ],
           '3': [ 'अभञ्जयिष्यत', 'अभञ्जयिष्येताम्', 'अभञ्जयिष्यन्त' ] } } } },
]
exports = module.exports = dump;